#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserModeSetListEntry

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function ActivityBrowserModeSetListEntry.ActivityBrowserModeSetListEntry_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserModeSetListEntry_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserModeSetListEntry_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on ActivityBrowserModeSetListEntry_C_BP_OnItemSelectionChanged");
static_assert(sizeof(ActivityBrowserModeSetListEntry_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on ActivityBrowserModeSetListEntry_C_BP_OnItemSelectionChanged");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'ActivityBrowserModeSetListEntry_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function ActivityBrowserModeSetListEntry.ActivityBrowserModeSetListEntry_C.ExecuteUbergraph_ActivityBrowserModeSetListEntry
// 0x0080 (0x0080 - 0x0000)
struct ActivityBrowserModeSetListEntry_C_ExecuteUbergraph_ActivityBrowserModeSetListEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsLoading;                           // 0x0018(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UTexture*                         K2Node_Event_Texture;                              // 0x0020(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CallFunc_K2_GetTextureParameterValue_ReturnValue;  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CallFunc_K2_GetTextureParameterValue_ReturnValue_1; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_ActivityName;                         // 0x0068(0x0018)(ConstParm)
};
static_assert(alignof(ActivityBrowserModeSetListEntry_C_ExecuteUbergraph_ActivityBrowserModeSetListEntry) == 0x000008, "Wrong alignment on ActivityBrowserModeSetListEntry_C_ExecuteUbergraph_ActivityBrowserModeSetListEntry");
static_assert(sizeof(ActivityBrowserModeSetListEntry_C_ExecuteUbergraph_ActivityBrowserModeSetListEntry) == 0x000080, "Wrong size on ActivityBrowserModeSetListEntry_C_ExecuteUbergraph_ActivityBrowserModeSetListEntry");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_ExecuteUbergraph_ActivityBrowserModeSetListEntry, EntryPoint) == 0x000000, "Member 'ActivityBrowserModeSetListEntry_C_ExecuteUbergraph_ActivityBrowserModeSetListEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_ExecuteUbergraph_ActivityBrowserModeSetListEntry, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'ActivityBrowserModeSetListEntry_C_ExecuteUbergraph_ActivityBrowserModeSetListEntry::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_ExecuteUbergraph_ActivityBrowserModeSetListEntry, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'ActivityBrowserModeSetListEntry_C_ExecuteUbergraph_ActivityBrowserModeSetListEntry::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_ExecuteUbergraph_ActivityBrowserModeSetListEntry, K2Node_Event_bIsLoading) == 0x000018, "Member 'ActivityBrowserModeSetListEntry_C_ExecuteUbergraph_ActivityBrowserModeSetListEntry::K2Node_Event_bIsLoading' has a wrong offset!");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_ExecuteUbergraph_ActivityBrowserModeSetListEntry, K2Node_Event_Texture) == 0x000020, "Member 'ActivityBrowserModeSetListEntry_C_ExecuteUbergraph_ActivityBrowserModeSetListEntry::K2Node_Event_Texture' has a wrong offset!");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_ExecuteUbergraph_ActivityBrowserModeSetListEntry, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'ActivityBrowserModeSetListEntry_C_ExecuteUbergraph_ActivityBrowserModeSetListEntry::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_ExecuteUbergraph_ActivityBrowserModeSetListEntry, CallFunc_Not_PreBool_ReturnValue) == 0x000029, "Member 'ActivityBrowserModeSetListEntry_C_ExecuteUbergraph_ActivityBrowserModeSetListEntry::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_ExecuteUbergraph_ActivityBrowserModeSetListEntry, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000030, "Member 'ActivityBrowserModeSetListEntry_C_ExecuteUbergraph_ActivityBrowserModeSetListEntry::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_ExecuteUbergraph_ActivityBrowserModeSetListEntry, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000038, "Member 'ActivityBrowserModeSetListEntry_C_ExecuteUbergraph_ActivityBrowserModeSetListEntry::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_ExecuteUbergraph_ActivityBrowserModeSetListEntry, CallFunc_K2_GetTextureParameterValue_ReturnValue) == 0x000040, "Member 'ActivityBrowserModeSetListEntry_C_ExecuteUbergraph_ActivityBrowserModeSetListEntry::CallFunc_K2_GetTextureParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_ExecuteUbergraph_ActivityBrowserModeSetListEntry, CallFunc_PlayAnimationForward_ReturnValue) == 0x000048, "Member 'ActivityBrowserModeSetListEntry_C_ExecuteUbergraph_ActivityBrowserModeSetListEntry::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_ExecuteUbergraph_ActivityBrowserModeSetListEntry, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000050, "Member 'ActivityBrowserModeSetListEntry_C_ExecuteUbergraph_ActivityBrowserModeSetListEntry::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_ExecuteUbergraph_ActivityBrowserModeSetListEntry, CallFunc_K2_GetTextureParameterValue_ReturnValue_1) == 0x000058, "Member 'ActivityBrowserModeSetListEntry_C_ExecuteUbergraph_ActivityBrowserModeSetListEntry::CallFunc_K2_GetTextureParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_ExecuteUbergraph_ActivityBrowserModeSetListEntry, K2Node_Event_bIsSelected) == 0x000060, "Member 'ActivityBrowserModeSetListEntry_C_ExecuteUbergraph_ActivityBrowserModeSetListEntry::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_ExecuteUbergraph_ActivityBrowserModeSetListEntry, K2Node_Event_ActivityName) == 0x000068, "Member 'ActivityBrowserModeSetListEntry_C_ExecuteUbergraph_ActivityBrowserModeSetListEntry::K2Node_Event_ActivityName' has a wrong offset!");

// Function ActivityBrowserModeSetListEntry.ActivityBrowserModeSetListEntry_C.OnActivityNameSet
// 0x0018 (0x0018 - 0x0000)
struct ActivityBrowserModeSetListEntry_C_OnActivityNameSet final
{
public:
	class FText                                   ActivityName;                                      // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(ActivityBrowserModeSetListEntry_C_OnActivityNameSet) == 0x000008, "Wrong alignment on ActivityBrowserModeSetListEntry_C_OnActivityNameSet");
static_assert(sizeof(ActivityBrowserModeSetListEntry_C_OnActivityNameSet) == 0x000018, "Wrong size on ActivityBrowserModeSetListEntry_C_OnActivityNameSet");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_OnActivityNameSet, ActivityName) == 0x000000, "Member 'ActivityBrowserModeSetListEntry_C_OnActivityNameSet::ActivityName' has a wrong offset!");

// Function ActivityBrowserModeSetListEntry.ActivityBrowserModeSetListEntry_C.OnPreviewImageChanged
// 0x0010 (0x0010 - 0x0000)
struct ActivityBrowserModeSetListEntry_C_OnPreviewImageChanged final
{
public:
	bool                                          bIsLoading;                                        // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UTexture*                         Texture;                                           // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserModeSetListEntry_C_OnPreviewImageChanged) == 0x000008, "Wrong alignment on ActivityBrowserModeSetListEntry_C_OnPreviewImageChanged");
static_assert(sizeof(ActivityBrowserModeSetListEntry_C_OnPreviewImageChanged) == 0x000010, "Wrong size on ActivityBrowserModeSetListEntry_C_OnPreviewImageChanged");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_OnPreviewImageChanged, bIsLoading) == 0x000000, "Member 'ActivityBrowserModeSetListEntry_C_OnPreviewImageChanged::bIsLoading' has a wrong offset!");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_OnPreviewImageChanged, Texture) == 0x000008, "Member 'ActivityBrowserModeSetListEntry_C_OnPreviewImageChanged::Texture' has a wrong offset!");

// Function ActivityBrowserModeSetListEntry.ActivityBrowserModeSetListEntry_C.RefreshDisabledState
// 0x00E0 (0x00E0 - 0x0000)
struct ActivityBrowserModeSetListEntry_C_RefreshDisabledState final
{
public:
	bool                                          IsActivityPreviouslyValid;                         // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortInvalidActivityReason                    Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0038(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0050(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0068(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x0080(0x0018)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B[0x5];                                       // 0x009B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortInvalidActivityReason                    CallFunc_GetInvalidActivityReason_ReturnValue;     // 0x00BF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x00C8(0x0018)()
};
static_assert(alignof(ActivityBrowserModeSetListEntry_C_RefreshDisabledState) == 0x000008, "Wrong alignment on ActivityBrowserModeSetListEntry_C_RefreshDisabledState");
static_assert(sizeof(ActivityBrowserModeSetListEntry_C_RefreshDisabledState) == 0x0000E0, "Wrong size on ActivityBrowserModeSetListEntry_C_RefreshDisabledState");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_RefreshDisabledState, IsActivityPreviouslyValid) == 0x000000, "Member 'ActivityBrowserModeSetListEntry_C_RefreshDisabledState::IsActivityPreviouslyValid' has a wrong offset!");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_RefreshDisabledState, Temp_byte_Variable) == 0x000001, "Member 'ActivityBrowserModeSetListEntry_C_RefreshDisabledState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_RefreshDisabledState, Temp_text_Variable) == 0x000008, "Member 'ActivityBrowserModeSetListEntry_C_RefreshDisabledState::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_RefreshDisabledState, Temp_text_Variable_1) == 0x000020, "Member 'ActivityBrowserModeSetListEntry_C_RefreshDisabledState::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_RefreshDisabledState, Temp_text_Variable_2) == 0x000038, "Member 'ActivityBrowserModeSetListEntry_C_RefreshDisabledState::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_RefreshDisabledState, Temp_text_Variable_3) == 0x000050, "Member 'ActivityBrowserModeSetListEntry_C_RefreshDisabledState::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_RefreshDisabledState, Temp_text_Variable_4) == 0x000068, "Member 'ActivityBrowserModeSetListEntry_C_RefreshDisabledState::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_RefreshDisabledState, Temp_text_Variable_5) == 0x000080, "Member 'ActivityBrowserModeSetListEntry_C_RefreshDisabledState::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_RefreshDisabledState, CallFunc_Not_PreBool_ReturnValue) == 0x000098, "Member 'ActivityBrowserModeSetListEntry_C_RefreshDisabledState::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_RefreshDisabledState, CallFunc_Not_PreBool_ReturnValue_1) == 0x000099, "Member 'ActivityBrowserModeSetListEntry_C_RefreshDisabledState::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_RefreshDisabledState, CallFunc_BooleanOR_ReturnValue) == 0x00009A, "Member 'ActivityBrowserModeSetListEntry_C_RefreshDisabledState::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_RefreshDisabledState, CallFunc_PlayAnimationReverse_ReturnValue) == 0x0000A0, "Member 'ActivityBrowserModeSetListEntry_C_RefreshDisabledState::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_RefreshDisabledState, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000A8, "Member 'ActivityBrowserModeSetListEntry_C_RefreshDisabledState::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_RefreshDisabledState, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x0000B0, "Member 'ActivityBrowserModeSetListEntry_C_RefreshDisabledState::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_RefreshDisabledState, CallFunc_GetRenderOpacity_ReturnValue) == 0x0000B8, "Member 'ActivityBrowserModeSetListEntry_C_RefreshDisabledState::CallFunc_GetRenderOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_RefreshDisabledState, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000BC, "Member 'ActivityBrowserModeSetListEntry_C_RefreshDisabledState::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_RefreshDisabledState, CallFunc_Not_PreBool_ReturnValue_2) == 0x0000BD, "Member 'ActivityBrowserModeSetListEntry_C_RefreshDisabledState::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_RefreshDisabledState, CallFunc_BooleanAND_ReturnValue) == 0x0000BE, "Member 'ActivityBrowserModeSetListEntry_C_RefreshDisabledState::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_RefreshDisabledState, CallFunc_GetInvalidActivityReason_ReturnValue) == 0x0000BF, "Member 'ActivityBrowserModeSetListEntry_C_RefreshDisabledState::CallFunc_GetInvalidActivityReason_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_RefreshDisabledState, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000C0, "Member 'ActivityBrowserModeSetListEntry_C_RefreshDisabledState::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_RefreshDisabledState, K2Node_Select_Default) == 0x0000C8, "Member 'ActivityBrowserModeSetListEntry_C_RefreshDisabledState::K2Node_Select_Default' has a wrong offset!");

// Function ActivityBrowserModeSetListEntry.ActivityBrowserModeSetListEntry_C.ResetSetDisabledColorationAnimation
// 0x0008 (0x0008 - 0x0000)
struct ActivityBrowserModeSetListEntry_C_ResetSetDisabledColorationAnimation final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserModeSetListEntry_C_ResetSetDisabledColorationAnimation) == 0x000008, "Wrong alignment on ActivityBrowserModeSetListEntry_C_ResetSetDisabledColorationAnimation");
static_assert(sizeof(ActivityBrowserModeSetListEntry_C_ResetSetDisabledColorationAnimation) == 0x000008, "Wrong size on ActivityBrowserModeSetListEntry_C_ResetSetDisabledColorationAnimation");
static_assert(offsetof(ActivityBrowserModeSetListEntry_C_ResetSetDisabledColorationAnimation, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000000, "Member 'ActivityBrowserModeSetListEntry_C_ResetSetDisabledColorationAnimation::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

}

