#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserSoloButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function ActivityBrowserSoloButton.ActivityBrowserSoloButton_C.EventOnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserSoloButton_C_EventOnInputMethodChanged final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserSoloButton_C_EventOnInputMethodChanged) == 0x000001, "Wrong alignment on ActivityBrowserSoloButton_C_EventOnInputMethodChanged");
static_assert(sizeof(ActivityBrowserSoloButton_C_EventOnInputMethodChanged) == 0x000001, "Wrong size on ActivityBrowserSoloButton_C_EventOnInputMethodChanged");
static_assert(offsetof(ActivityBrowserSoloButton_C_EventOnInputMethodChanged, bNewInputType) == 0x000000, "Member 'ActivityBrowserSoloButton_C_EventOnInputMethodChanged::bNewInputType' has a wrong offset!");

// Function ActivityBrowserSoloButton.ActivityBrowserSoloButton_C.ExecuteUbergraph_ActivityBrowserSoloButton
// 0x00C8 (0x00C8 - 0x0000)
struct ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ESlateVisibility InVisibility)> K2Node_CreateDelegate_OutputDelegate;             // 0x0024(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0064(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingGamepad_ReturnValue;               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_DynamicCast_AsSound_Base;                   // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_2;          // 0x00A4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_3;          // 0x00B0(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_CustomEvent_InVisibility;                   // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BE[0x2];                                       // 0x00BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_2;       // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton) == 0x000008, "Wrong alignment on ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton");
static_assert(sizeof(ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton) == 0x0000C8, "Wrong size on ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton");
static_assert(offsetof(ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton, EntryPoint) == 0x000000, "Member 'ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000010, "Member 'ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton, CallFunc_GetCurrentInputType_ReturnValue) == 0x000020, "Member 'ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000030, "Member 'ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000038, "Member 'ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000040, "Member 'ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000048, "Member 'ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000050, "Member 'ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000058, "Member 'ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x000060, "Member 'ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton, K2Node_CreateDelegate_OutputDelegate_1) == 0x000064, "Member 'ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton, CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result) == 0x000070, "Member 'ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton::CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton, CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue) == 0x000078, "Member 'ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton::CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton, K2Node_CustomEvent_bNewInputType) == 0x000081, "Member 'ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton, CallFunc_GetFirstLocalFortPlayerController_ReturnValue) == 0x000088, "Member 'ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton::CallFunc_GetFirstLocalFortPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton, CallFunc_IsUsingGamepad_ReturnValue) == 0x000090, "Member 'ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton::CallFunc_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton, CallFunc_IsValid_ReturnValue_1) == 0x000091, "Member 'ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton, K2Node_DynamicCast_AsSound_Base) == 0x000098, "Member 'ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton::K2Node_DynamicCast_AsSound_Base' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton, K2Node_Event_IsDesignTime) == 0x0000A1, "Member 'ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000A4, "Member 'ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000B0, "Member 'ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton, K2Node_CustomEvent_InVisibility) == 0x0000BC, "Member 'ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton::K2Node_CustomEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton, K2Node_SwitchEnum_CmpSuccess) == 0x0000BD, "Member 'ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton, CallFunc_PlayAnimationReverse_ReturnValue_2) == 0x0000C0, "Member 'ActivityBrowserSoloButton_C_ExecuteUbergraph_ActivityBrowserSoloButton::CallFunc_PlayAnimationReverse_ReturnValue_2' has a wrong offset!");

// Function ActivityBrowserSoloButton.ActivityBrowserSoloButton_C.MakeButtonBrush
// 0x01A0 (0x01A0 - 0x0000)
struct ActivityBrowserSoloButton_C_MakeButtonBrush final
{
public:
	class UObject*                                ResourceObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            SlateBrush;                                        // 0x0010(0x00C0)(Parm, OutParm)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x00E0(0x00C0)()
};
static_assert(alignof(ActivityBrowserSoloButton_C_MakeButtonBrush) == 0x000010, "Wrong alignment on ActivityBrowserSoloButton_C_MakeButtonBrush");
static_assert(sizeof(ActivityBrowserSoloButton_C_MakeButtonBrush) == 0x0001A0, "Wrong size on ActivityBrowserSoloButton_C_MakeButtonBrush");
static_assert(offsetof(ActivityBrowserSoloButton_C_MakeButtonBrush, ResourceObject) == 0x000000, "Member 'ActivityBrowserSoloButton_C_MakeButtonBrush::ResourceObject' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_MakeButtonBrush, SlateBrush) == 0x000010, "Member 'ActivityBrowserSoloButton_C_MakeButtonBrush::SlateBrush' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_MakeButtonBrush, CallFunc_MakeVector2D_ReturnValue) == 0x0000D0, "Member 'ActivityBrowserSoloButton_C_MakeButtonBrush::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_MakeButtonBrush, K2Node_MakeStruct_SlateBrush) == 0x0000E0, "Member 'ActivityBrowserSoloButton_C_MakeButtonBrush::K2Node_MakeStruct_SlateBrush' has a wrong offset!");

// Function ActivityBrowserSoloButton.ActivityBrowserSoloButton_C.OnVisibilityChange
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserSoloButton_C_OnVisibilityChange final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserSoloButton_C_OnVisibilityChange) == 0x000001, "Wrong alignment on ActivityBrowserSoloButton_C_OnVisibilityChange");
static_assert(sizeof(ActivityBrowserSoloButton_C_OnVisibilityChange) == 0x000001, "Wrong size on ActivityBrowserSoloButton_C_OnVisibilityChange");
static_assert(offsetof(ActivityBrowserSoloButton_C_OnVisibilityChange, InVisibility) == 0x000000, "Member 'ActivityBrowserSoloButton_C_OnVisibilityChange::InVisibility' has a wrong offset!");

// Function ActivityBrowserSoloButton.ActivityBrowserSoloButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserSoloButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserSoloButton_C_PreConstruct) == 0x000001, "Wrong alignment on ActivityBrowserSoloButton_C_PreConstruct");
static_assert(sizeof(ActivityBrowserSoloButton_C_PreConstruct) == 0x000001, "Wrong size on ActivityBrowserSoloButton_C_PreConstruct");
static_assert(offsetof(ActivityBrowserSoloButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ActivityBrowserSoloButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ActivityBrowserSoloButton.ActivityBrowserSoloButton_C.ResetFontMaterial
// 0x0008 (0x0008 - 0x0000)
struct ActivityBrowserSoloButton_C_ResetFontMaterial final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserSoloButton_C_ResetFontMaterial) == 0x000008, "Wrong alignment on ActivityBrowserSoloButton_C_ResetFontMaterial");
static_assert(sizeof(ActivityBrowserSoloButton_C_ResetFontMaterial) == 0x000008, "Wrong size on ActivityBrowserSoloButton_C_ResetFontMaterial");
static_assert(offsetof(ActivityBrowserSoloButton_C_ResetFontMaterial, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x000000, "Member 'ActivityBrowserSoloButton_C_ResetFontMaterial::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");

// Function ActivityBrowserSoloButton.ActivityBrowserSoloButton_C.ResetMaterials
// 0x0018 (0x0018 - 0x0000)
struct ActivityBrowserSoloButton_C_ResetMaterials final
{
public:
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserSoloButton_C_ResetMaterials) == 0x000008, "Wrong alignment on ActivityBrowserSoloButton_C_ResetMaterials");
static_assert(sizeof(ActivityBrowserSoloButton_C_ResetMaterials) == 0x000018, "Wrong size on ActivityBrowserSoloButton_C_ResetMaterials");
static_assert(offsetof(ActivityBrowserSoloButton_C_ResetMaterials, CallFunc_GetEndTime_ReturnValue) == 0x000000, "Member 'ActivityBrowserSoloButton_C_ResetMaterials::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_ResetMaterials, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'ActivityBrowserSoloButton_C_ResetMaterials::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_ResetMaterials, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'ActivityBrowserSoloButton_C_ResetMaterials::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function ActivityBrowserSoloButton.ActivityBrowserSoloButton_C.SetButtonMaterial
// 0x00E0 (0x00E0 - 0x0000)
struct ActivityBrowserSoloButton_C_SetButtonMaterial final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_MakeButtonBrush_SlateBrush;               // 0x0010(0x00C0)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserSoloButton_C_SetButtonMaterial) == 0x000010, "Wrong alignment on ActivityBrowserSoloButton_C_SetButtonMaterial");
static_assert(sizeof(ActivityBrowserSoloButton_C_SetButtonMaterial) == 0x0000E0, "Wrong size on ActivityBrowserSoloButton_C_SetButtonMaterial");
static_assert(offsetof(ActivityBrowserSoloButton_C_SetButtonMaterial, Temp_bool_Variable) == 0x000000, "Member 'ActivityBrowserSoloButton_C_SetButtonMaterial::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_SetButtonMaterial, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'ActivityBrowserSoloButton_C_SetButtonMaterial::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_SetButtonMaterial, CallFunc_IsUsingTouch_ReturnValue) == 0x000002, "Member 'ActivityBrowserSoloButton_C_SetButtonMaterial::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_SetButtonMaterial, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'ActivityBrowserSoloButton_C_SetButtonMaterial::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_SetButtonMaterial, CallFunc_BooleanAND_ReturnValue_1) == 0x000004, "Member 'ActivityBrowserSoloButton_C_SetButtonMaterial::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_SetButtonMaterial, K2Node_Select_Default) == 0x000008, "Member 'ActivityBrowserSoloButton_C_SetButtonMaterial::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_SetButtonMaterial, CallFunc_MakeButtonBrush_SlateBrush) == 0x000010, "Member 'ActivityBrowserSoloButton_C_SetButtonMaterial::CallFunc_MakeButtonBrush_SlateBrush' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_SetButtonMaterial, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000D0, "Member 'ActivityBrowserSoloButton_C_SetButtonMaterial::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function ActivityBrowserSoloButton.ActivityBrowserSoloButton_C.SetText
// 0x0028 (0x0028 - 0x0000)
struct ActivityBrowserSoloButton_C_SetText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserSoloButton_C_SetText) == 0x000008, "Wrong alignment on ActivityBrowserSoloButton_C_SetText");
static_assert(sizeof(ActivityBrowserSoloButton_C_SetText) == 0x000028, "Wrong size on ActivityBrowserSoloButton_C_SetText");
static_assert(offsetof(ActivityBrowserSoloButton_C_SetText, Text) == 0x000000, "Member 'ActivityBrowserSoloButton_C_SetText::Text' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_SetText, CallFunc_MakeVector2D_ReturnValue) == 0x000018, "Member 'ActivityBrowserSoloButton_C_SetText::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function ActivityBrowserSoloButton.ActivityBrowserSoloButton_C.SetTextStyle
// 0x0014 (0x0014 - 0x0000)
struct ActivityBrowserSoloButton_C_SetTextStyle final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_Select_Default;                             // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActivityBrowserSoloButton_C_SetTextStyle) == 0x000004, "Wrong alignment on ActivityBrowserSoloButton_C_SetTextStyle");
static_assert(sizeof(ActivityBrowserSoloButton_C_SetTextStyle) == 0x000014, "Wrong size on ActivityBrowserSoloButton_C_SetTextStyle");
static_assert(offsetof(ActivityBrowserSoloButton_C_SetTextStyle, Temp_bool_Variable) == 0x000000, "Member 'ActivityBrowserSoloButton_C_SetTextStyle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_SetTextStyle, CallFunc_IsUsingTouch_ReturnValue) == 0x000001, "Member 'ActivityBrowserSoloButton_C_SetTextStyle::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_SetTextStyle, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'ActivityBrowserSoloButton_C_SetTextStyle::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_SetTextStyle, K2Node_Select_Default) == 0x000004, "Member 'ActivityBrowserSoloButton_C_SetTextStyle::K2Node_Select_Default' has a wrong offset!");

// Function ActivityBrowserSoloButton.ActivityBrowserSoloButton_C.Toggle Mobile Overrides
// 0x0058 (0x0058 - 0x0000)
struct ActivityBrowserSoloButton_C_Toggle_Mobile_Overrides final
{
public:
	bool                                          bApplyMobileOverrides;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0008(0x0050)(HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserSoloButton_C_Toggle_Mobile_Overrides) == 0x000008, "Wrong alignment on ActivityBrowserSoloButton_C_Toggle_Mobile_Overrides");
static_assert(sizeof(ActivityBrowserSoloButton_C_Toggle_Mobile_Overrides) == 0x000058, "Wrong size on ActivityBrowserSoloButton_C_Toggle_Mobile_Overrides");
static_assert(offsetof(ActivityBrowserSoloButton_C_Toggle_Mobile_Overrides, bApplyMobileOverrides) == 0x000000, "Member 'ActivityBrowserSoloButton_C_Toggle_Mobile_Overrides::bApplyMobileOverrides' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_Toggle_Mobile_Overrides, K2Node_MakeStruct_SlateFontInfo) == 0x000008, "Member 'ActivityBrowserSoloButton_C_Toggle_Mobile_Overrides::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");

// Function ActivityBrowserSoloButton.ActivityBrowserSoloButton_C.UpdateStylingOnInputType
// 0x0020 (0x0020 - 0x0000)
struct ActivityBrowserSoloButton_C_UpdateStylingOnInputType final
{
public:
	ECommonInputType                              Index_0;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserSoloButton_C_UpdateStylingOnInputType) == 0x000008, "Wrong alignment on ActivityBrowserSoloButton_C_UpdateStylingOnInputType");
static_assert(sizeof(ActivityBrowserSoloButton_C_UpdateStylingOnInputType) == 0x000020, "Wrong size on ActivityBrowserSoloButton_C_UpdateStylingOnInputType");
static_assert(offsetof(ActivityBrowserSoloButton_C_UpdateStylingOnInputType, Index_0) == 0x000000, "Member 'ActivityBrowserSoloButton_C_UpdateStylingOnInputType::Index_0' has a wrong offset!");
static_assert(offsetof(ActivityBrowserSoloButton_C_UpdateStylingOnInputType, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'ActivityBrowserSoloButton_C_UpdateStylingOnInputType::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
