#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArmadilloPodEntryIndicator

#include "Basic.hpp"


namespace SDK::Params
{

// Function ArmadilloPodEntryIndicator.ArmadilloPodEntryIndicator_C.ExecuteUbergraph_ArmadilloPodEntryIndicator
// 0x0040 (0x0040 - 0x0000)
struct ArmadilloPodEntryIndicator_C_ExecuteUbergraph_ArmadilloPodEntryIndicator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_InitObject;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AArmadillo_PodInteract_C*               K2Node_DynamicCast_AsArmadillo_Pod_Interact;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bShouldBeVisible;               // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bShouldBeVisible)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArmadilloPodEntryIndicator_C_ExecuteUbergraph_ArmadilloPodEntryIndicator) == 0x000008, "Wrong alignment on ArmadilloPodEntryIndicator_C_ExecuteUbergraph_ArmadilloPodEntryIndicator");
static_assert(sizeof(ArmadilloPodEntryIndicator_C_ExecuteUbergraph_ArmadilloPodEntryIndicator) == 0x000040, "Wrong size on ArmadilloPodEntryIndicator_C_ExecuteUbergraph_ArmadilloPodEntryIndicator");
static_assert(offsetof(ArmadilloPodEntryIndicator_C_ExecuteUbergraph_ArmadilloPodEntryIndicator, EntryPoint) == 0x000000, "Member 'ArmadilloPodEntryIndicator_C_ExecuteUbergraph_ArmadilloPodEntryIndicator::EntryPoint' has a wrong offset!");
static_assert(offsetof(ArmadilloPodEntryIndicator_C_ExecuteUbergraph_ArmadilloPodEntryIndicator, K2Node_Event_InitObject) == 0x000008, "Member 'ArmadilloPodEntryIndicator_C_ExecuteUbergraph_ArmadilloPodEntryIndicator::K2Node_Event_InitObject' has a wrong offset!");
static_assert(offsetof(ArmadilloPodEntryIndicator_C_ExecuteUbergraph_ArmadilloPodEntryIndicator, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'ArmadilloPodEntryIndicator_C_ExecuteUbergraph_ArmadilloPodEntryIndicator::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloPodEntryIndicator_C_ExecuteUbergraph_ArmadilloPodEntryIndicator, K2Node_DynamicCast_AsArmadillo_Pod_Interact) == 0x000018, "Member 'ArmadilloPodEntryIndicator_C_ExecuteUbergraph_ArmadilloPodEntryIndicator::K2Node_DynamicCast_AsArmadillo_Pod_Interact' has a wrong offset!");
static_assert(offsetof(ArmadilloPodEntryIndicator_C_ExecuteUbergraph_ArmadilloPodEntryIndicator, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ArmadilloPodEntryIndicator_C_ExecuteUbergraph_ArmadilloPodEntryIndicator::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ArmadilloPodEntryIndicator_C_ExecuteUbergraph_ArmadilloPodEntryIndicator, K2Node_CustomEvent_bShouldBeVisible) == 0x000021, "Member 'ArmadilloPodEntryIndicator_C_ExecuteUbergraph_ArmadilloPodEntryIndicator::K2Node_CustomEvent_bShouldBeVisible' has a wrong offset!");
static_assert(offsetof(ArmadilloPodEntryIndicator_C_ExecuteUbergraph_ArmadilloPodEntryIndicator, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'ArmadilloPodEntryIndicator_C_ExecuteUbergraph_ArmadilloPodEntryIndicator::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ArmadilloPodEntryIndicator_C_ExecuteUbergraph_ArmadilloPodEntryIndicator, CallFunc_PlayAnimation_ReturnValue_1) == 0x000030, "Member 'ArmadilloPodEntryIndicator_C_ExecuteUbergraph_ArmadilloPodEntryIndicator::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ArmadilloPodEntryIndicator_C_ExecuteUbergraph_ArmadilloPodEntryIndicator, CallFunc_PlayAnimation_ReturnValue_2) == 0x000038, "Member 'ArmadilloPodEntryIndicator_C_ExecuteUbergraph_ArmadilloPodEntryIndicator::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");

// Function ArmadilloPodEntryIndicator.ArmadilloPodEntryIndicator_C.InitFromObject
// 0x0008 (0x0008 - 0x0000)
struct ArmadilloPodEntryIndicator_C_InitFromObject final
{
public:
	class UObject*                                InitObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArmadilloPodEntryIndicator_C_InitFromObject) == 0x000008, "Wrong alignment on ArmadilloPodEntryIndicator_C_InitFromObject");
static_assert(sizeof(ArmadilloPodEntryIndicator_C_InitFromObject) == 0x000008, "Wrong size on ArmadilloPodEntryIndicator_C_InitFromObject");
static_assert(offsetof(ArmadilloPodEntryIndicator_C_InitFromObject, InitObject) == 0x000000, "Member 'ArmadilloPodEntryIndicator_C_InitFromObject::InitObject' has a wrong offset!");

// Function ArmadilloPodEntryIndicator.ArmadilloPodEntryIndicator_C.OnPodRequestIndicatorVis
// 0x0001 (0x0001 - 0x0000)
struct ArmadilloPodEntryIndicator_C_OnPodRequestIndicatorVis final
{
public:
	bool                                          bShouldBeVisible;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArmadilloPodEntryIndicator_C_OnPodRequestIndicatorVis) == 0x000001, "Wrong alignment on ArmadilloPodEntryIndicator_C_OnPodRequestIndicatorVis");
static_assert(sizeof(ArmadilloPodEntryIndicator_C_OnPodRequestIndicatorVis) == 0x000001, "Wrong size on ArmadilloPodEntryIndicator_C_OnPodRequestIndicatorVis");
static_assert(offsetof(ArmadilloPodEntryIndicator_C_OnPodRequestIndicatorVis, bShouldBeVisible) == 0x000000, "Member 'ArmadilloPodEntryIndicator_C_OnPodRequestIndicatorVis::bShouldBeVisible' has a wrong offset!");

}

