#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArmadilloReticlesCombined

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function ArmadilloReticlesCombined.ArmadilloReticlesCombined_C.BP_OnCursorModeChanged
// 0x0010 (0x0010 - 0x0000)
struct ArmadilloReticlesCombined_C_BP_OnCursorModeChanged final
{
public:
	class USpecialEventCursorPawnComponent*       InCursorPawnComponent;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           NewCursorModeTag;                                  // 0x0008(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           OldCursorModeTag;                                  // 0x000C(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArmadilloReticlesCombined_C_BP_OnCursorModeChanged) == 0x000008, "Wrong alignment on ArmadilloReticlesCombined_C_BP_OnCursorModeChanged");
static_assert(sizeof(ArmadilloReticlesCombined_C_BP_OnCursorModeChanged) == 0x000010, "Wrong size on ArmadilloReticlesCombined_C_BP_OnCursorModeChanged");
static_assert(offsetof(ArmadilloReticlesCombined_C_BP_OnCursorModeChanged, InCursorPawnComponent) == 0x000000, "Member 'ArmadilloReticlesCombined_C_BP_OnCursorModeChanged::InCursorPawnComponent' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_BP_OnCursorModeChanged, NewCursorModeTag) == 0x000008, "Member 'ArmadilloReticlesCombined_C_BP_OnCursorModeChanged::NewCursorModeTag' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_BP_OnCursorModeChanged, OldCursorModeTag) == 0x00000C, "Member 'ArmadilloReticlesCombined_C_BP_OnCursorModeChanged::OldCursorModeTag' has a wrong offset!");

// Function ArmadilloReticlesCombined.ArmadilloReticlesCombined_C.ExecuteUbergraph_ArmadilloReticlesCombined
// 0x0140 (0x0140 - 0x0000)
struct ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortWeapon*                            K2Node_Event_Weapon;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetIndexForWeaponClass_OutIndex;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderTransformAngle_ReturnValue;      // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue_1;        // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_CurrentValue;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_MaxValue;                       // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortWeaponOverheatState                      K2Node_CustomEvent_State;                          // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsInCooldown;                  // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue_1;               // 0x0086(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87[0x1];                                       // 0x0087(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue_1;            // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue_2;        // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue_3;        // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USpecialEventCursorPawnComponent*       K2Node_Event_InCursorPawnComponent;                // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_NewCursorModeTag;                     // 0x00C8(0x0004)(ConstParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_OldCursorModeTag;                     // 0x00CC(0x0004)(ConstParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00D8(0x0040)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIndexForWeaponClass_OutIndex_1;        // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined) == 0x000008, "Wrong alignment on ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined");
static_assert(sizeof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined) == 0x000140, "Wrong size on ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, EntryPoint) == 0x000000, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::EntryPoint' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, K2Node_Event_Weapon) == 0x000010, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::K2Node_Event_Weapon' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, CallFunc_GetIndexForWeaponClass_OutIndex) == 0x000024, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::CallFunc_GetIndexForWeaponClass_OutIndex' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, K2Node_SwitchInteger_CmpSuccess) == 0x000028, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, CallFunc_Add_FloatFloat_ReturnValue) == 0x000038, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, CallFunc_GetRenderTransformAngle_ReturnValue) == 0x00003C, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::CallFunc_GetRenderTransformAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000040, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, CallFunc_FClamp_ReturnValue) == 0x000044, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, CallFunc_PlayAnimation_ReturnValue_1) == 0x000048, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, CallFunc_IsMobileGame_ReturnValue) == 0x000050, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, CallFunc_PlayAnimation_ReturnValue_2) == 0x000058, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, CallFunc_PlayAnimation_ReturnValue_3) == 0x000060, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, CallFunc_GetPlatformName_ReturnValue) == 0x000068, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, CallFunc_EqualEqual_StriStri_ReturnValue) == 0x000078, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::CallFunc_EqualEqual_StriStri_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, CallFunc_IsValid_ReturnValue_1) == 0x000079, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, CallFunc_EqualEqual_StriStri_ReturnValue_1) == 0x00007A, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::CallFunc_EqualEqual_StriStri_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, CallFunc_BooleanOR_ReturnValue) == 0x00007B, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, K2Node_CustomEvent_CurrentValue) == 0x00007C, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::K2Node_CustomEvent_CurrentValue' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, K2Node_CustomEvent_MaxValue) == 0x000080, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::K2Node_CustomEvent_MaxValue' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, K2Node_CustomEvent_State) == 0x000084, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::K2Node_CustomEvent_State' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, K2Node_CustomEvent_bIsInCooldown) == 0x000085, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::K2Node_CustomEvent_bIsInCooldown' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, CallFunc_IsMobileGame_ReturnValue_1) == 0x000086, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::CallFunc_IsMobileGame_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000088, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, CallFunc_BooleanOR_ReturnValue_1) == 0x00008C, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, CallFunc_Not_PreBool_ReturnValue) == 0x00008D, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, CallFunc_GetPlatformName_ReturnValue_1) == 0x000090, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::CallFunc_GetPlatformName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, CallFunc_EqualEqual_StriStri_ReturnValue_2) == 0x0000A0, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::CallFunc_EqualEqual_StriStri_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, CallFunc_EqualEqual_StriStri_ReturnValue_3) == 0x0000A1, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::CallFunc_EqualEqual_StriStri_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, CallFunc_BooleanOR_ReturnValue_2) == 0x0000A2, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, K2Node_MakeArray_Array) == 0x0000A8, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, CallFunc_BooleanOR_ReturnValue_3) == 0x0000B8, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, K2Node_Event_InCursorPawnComponent) == 0x0000C0, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::K2Node_Event_InCursorPawnComponent' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, K2Node_Event_NewCursorModeTag) == 0x0000C8, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::K2Node_Event_NewCursorModeTag' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, K2Node_Event_OldCursorModeTag) == 0x0000CC, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::K2Node_Event_OldCursorModeTag' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000D0, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, CallFunc_Array_Contains_ReturnValue) == 0x0000D1, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, CallFunc_Array_Find_ReturnValue) == 0x0000D4, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, K2Node_Event_MyGeometry) == 0x0000D8, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, K2Node_Event_InDeltaTime) == 0x000118, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00011C, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, CallFunc_IsValid_ReturnValue_2) == 0x000120, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000124, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, CallFunc_GetIndexForWeaponClass_OutIndex_1) == 0x000128, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::CallFunc_GetIndexForWeaponClass_OutIndex_1' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, K2Node_SwitchInteger_CmpSuccess_1) == 0x00012C, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, CallFunc_PlayAnimation_ReturnValue_4) == 0x000130, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined, CallFunc_PlayAnimation_ReturnValue_5) == 0x000138, "Member 'ArmadilloReticlesCombined_C_ExecuteUbergraph_ArmadilloReticlesCombined::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");

// Function ArmadilloReticlesCombined.ArmadilloReticlesCombined_C.GetIndexForWeaponClass
// 0x0038 (0x0038 - 0x0000)
struct ArmadilloReticlesCombined_C_GetIndexForWeaponClass final
{
public:
	class AFortWeapon*                            InFortWeapon;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OutIndex;                                          // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ConstParm, ReferenceParm)
	struct FGameplayTag                           CallFunc_Map_Find_Value;                           // 0x0028(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArmadilloReticlesCombined_C_GetIndexForWeaponClass) == 0x000008, "Wrong alignment on ArmadilloReticlesCombined_C_GetIndexForWeaponClass");
static_assert(sizeof(ArmadilloReticlesCombined_C_GetIndexForWeaponClass) == 0x000038, "Wrong size on ArmadilloReticlesCombined_C_GetIndexForWeaponClass");
static_assert(offsetof(ArmadilloReticlesCombined_C_GetIndexForWeaponClass, InFortWeapon) == 0x000000, "Member 'ArmadilloReticlesCombined_C_GetIndexForWeaponClass::InFortWeapon' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_GetIndexForWeaponClass, OutIndex) == 0x000008, "Member 'ArmadilloReticlesCombined_C_GetIndexForWeaponClass::OutIndex' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_GetIndexForWeaponClass, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'ArmadilloReticlesCombined_C_GetIndexForWeaponClass::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_GetIndexForWeaponClass, CallFunc_GetObjectClass_ReturnValue) == 0x000010, "Member 'ArmadilloReticlesCombined_C_GetIndexForWeaponClass::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_GetIndexForWeaponClass, K2Node_MakeArray_Array) == 0x000018, "Member 'ArmadilloReticlesCombined_C_GetIndexForWeaponClass::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_GetIndexForWeaponClass, CallFunc_Map_Find_Value) == 0x000028, "Member 'ArmadilloReticlesCombined_C_GetIndexForWeaponClass::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_GetIndexForWeaponClass, CallFunc_Map_Find_ReturnValue) == 0x00002C, "Member 'ArmadilloReticlesCombined_C_GetIndexForWeaponClass::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_GetIndexForWeaponClass, CallFunc_Array_Contains_ReturnValue) == 0x00002D, "Member 'ArmadilloReticlesCombined_C_GetIndexForWeaponClass::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_GetIndexForWeaponClass, CallFunc_Array_Find_ReturnValue) == 0x000030, "Member 'ArmadilloReticlesCombined_C_GetIndexForWeaponClass::CallFunc_Array_Find_ReturnValue' has a wrong offset!");

// Function ArmadilloReticlesCombined.ArmadilloReticlesCombined_C.InitializeWeaponOverheatDisplay
// 0x0040 (0x0040 - 0x0000)
struct ArmadilloReticlesCombined_C_InitializeWeaponOverheatDisplay final
{
public:
	class AFortWeaponRanged*                      InWeapon;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float CurrentValue, float MaxValue, EFortWeaponOverheatState State, bool bIsInCooldown)> K2Node_CreateDelegate_OutputDelegate; // 0x0008(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetOverheatingMaxValue_ReturnValue;       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentOverheatValue_ReturnValue;      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Armadillo_HeartacheViewport_C*      CallFunc_GetActorOfClass_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float CurrentValue, float MaxValue, EFortWeaponOverheatState State, bool bIsInCooldown)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0034(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArmadilloReticlesCombined_C_InitializeWeaponOverheatDisplay) == 0x000008, "Wrong alignment on ArmadilloReticlesCombined_C_InitializeWeaponOverheatDisplay");
static_assert(sizeof(ArmadilloReticlesCombined_C_InitializeWeaponOverheatDisplay) == 0x000040, "Wrong size on ArmadilloReticlesCombined_C_InitializeWeaponOverheatDisplay");
static_assert(offsetof(ArmadilloReticlesCombined_C_InitializeWeaponOverheatDisplay, InWeapon) == 0x000000, "Member 'ArmadilloReticlesCombined_C_InitializeWeaponOverheatDisplay::InWeapon' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_InitializeWeaponOverheatDisplay, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'ArmadilloReticlesCombined_C_InitializeWeaponOverheatDisplay::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_InitializeWeaponOverheatDisplay, CallFunc_GetOverheatingMaxValue_ReturnValue) == 0x000014, "Member 'ArmadilloReticlesCombined_C_InitializeWeaponOverheatDisplay::CallFunc_GetOverheatingMaxValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_InitializeWeaponOverheatDisplay, CallFunc_GetCurrentOverheatValue_ReturnValue) == 0x000018, "Member 'ArmadilloReticlesCombined_C_InitializeWeaponOverheatDisplay::CallFunc_GetCurrentOverheatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_InitializeWeaponOverheatDisplay, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'ArmadilloReticlesCombined_C_InitializeWeaponOverheatDisplay::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_InitializeWeaponOverheatDisplay, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000020, "Member 'ArmadilloReticlesCombined_C_InitializeWeaponOverheatDisplay::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_InitializeWeaponOverheatDisplay, CallFunc_IsValid_ReturnValue_1) == 0x000024, "Member 'ArmadilloReticlesCombined_C_InitializeWeaponOverheatDisplay::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_InitializeWeaponOverheatDisplay, CallFunc_GetActorOfClass_ReturnValue) == 0x000028, "Member 'ArmadilloReticlesCombined_C_InitializeWeaponOverheatDisplay::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_InitializeWeaponOverheatDisplay, CallFunc_IsValid_ReturnValue_2) == 0x000030, "Member 'ArmadilloReticlesCombined_C_InitializeWeaponOverheatDisplay::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_InitializeWeaponOverheatDisplay, K2Node_CreateDelegate_OutputDelegate_1) == 0x000034, "Member 'ArmadilloReticlesCombined_C_InitializeWeaponOverheatDisplay::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function ArmadilloReticlesCombined.ArmadilloReticlesCombined_C.OnWeaponFireVisuals
// 0x0008 (0x0008 - 0x0000)
struct ArmadilloReticlesCombined_C_OnWeaponFireVisuals final
{
public:
	class AFortWeapon*                            Weapon;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArmadilloReticlesCombined_C_OnWeaponFireVisuals) == 0x000008, "Wrong alignment on ArmadilloReticlesCombined_C_OnWeaponFireVisuals");
static_assert(sizeof(ArmadilloReticlesCombined_C_OnWeaponFireVisuals) == 0x000008, "Wrong size on ArmadilloReticlesCombined_C_OnWeaponFireVisuals");
static_assert(offsetof(ArmadilloReticlesCombined_C_OnWeaponFireVisuals, Weapon) == 0x000000, "Member 'ArmadilloReticlesCombined_C_OnWeaponFireVisuals::Weapon' has a wrong offset!");

// Function ArmadilloReticlesCombined.ArmadilloReticlesCombined_C.OverheatChange
// 0x000C (0x000C - 0x0000)
struct ArmadilloReticlesCombined_C_OverheatChange final
{
public:
	float                                         CurrentValue;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxValue;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortWeaponOverheatState                      State;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInCooldown;                                     // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArmadilloReticlesCombined_C_OverheatChange) == 0x000004, "Wrong alignment on ArmadilloReticlesCombined_C_OverheatChange");
static_assert(sizeof(ArmadilloReticlesCombined_C_OverheatChange) == 0x00000C, "Wrong size on ArmadilloReticlesCombined_C_OverheatChange");
static_assert(offsetof(ArmadilloReticlesCombined_C_OverheatChange, CurrentValue) == 0x000000, "Member 'ArmadilloReticlesCombined_C_OverheatChange::CurrentValue' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_OverheatChange, MaxValue) == 0x000004, "Member 'ArmadilloReticlesCombined_C_OverheatChange::MaxValue' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_OverheatChange, State) == 0x000008, "Member 'ArmadilloReticlesCombined_C_OverheatChange::State' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_OverheatChange, bIsInCooldown) == 0x000009, "Member 'ArmadilloReticlesCombined_C_OverheatChange::bIsInCooldown' has a wrong offset!");

// Function ArmadilloReticlesCombined.ArmadilloReticlesCombined_C.Tick
// 0x0048 (0x0048 - 0x0000)
struct ArmadilloReticlesCombined_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArmadilloReticlesCombined_C_Tick) == 0x000008, "Wrong alignment on ArmadilloReticlesCombined_C_Tick");
static_assert(sizeof(ArmadilloReticlesCombined_C_Tick) == 0x000048, "Wrong size on ArmadilloReticlesCombined_C_Tick");
static_assert(offsetof(ArmadilloReticlesCombined_C_Tick, MyGeometry) == 0x000000, "Member 'ArmadilloReticlesCombined_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_Tick, InDeltaTime) == 0x000040, "Member 'ArmadilloReticlesCombined_C_Tick::InDeltaTime' has a wrong offset!");

// Function ArmadilloReticlesCombined.ArmadilloReticlesCombined_C.UpdateWeaponIconInViewportMesh
// 0x0018 (0x0018 - 0x0000)
struct ArmadilloReticlesCombined_C_UpdateWeaponIconInViewportMesh final
{
public:
	class AFortWeaponRanged*                      InWeapon;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Armadillo_HeartacheViewport_C*      CallFunc_GetActorOfClass_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArmadilloReticlesCombined_C_UpdateWeaponIconInViewportMesh) == 0x000008, "Wrong alignment on ArmadilloReticlesCombined_C_UpdateWeaponIconInViewportMesh");
static_assert(sizeof(ArmadilloReticlesCombined_C_UpdateWeaponIconInViewportMesh) == 0x000018, "Wrong size on ArmadilloReticlesCombined_C_UpdateWeaponIconInViewportMesh");
static_assert(offsetof(ArmadilloReticlesCombined_C_UpdateWeaponIconInViewportMesh, InWeapon) == 0x000000, "Member 'ArmadilloReticlesCombined_C_UpdateWeaponIconInViewportMesh::InWeapon' has a wrong offset!");
static_assert(offsetof(ArmadilloReticlesCombined_C_UpdateWeaponIconInViewportMesh, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'ArmadilloReticlesCombined_C_UpdateWeaponIconInViewportMesh::CallFunc_IsValid_ReturnValue' has a wrong offset!");
