#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArmadilloPodEntryIndicator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ArmadilloPodEntryIndicator.ArmadilloPodEntryIndicator_C
// 0x0028 (0x02A0 - 0x0278)
class UArmadilloPodEntryIndicator_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOut;                                           // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ambient;                                           // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_60;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_ArmadilloPodEntryIndicator(int32 EntryPoint);
	void InitFromObject(class UObject* InitObject);
	void OnPodRequestIndicatorVis(bool bShouldBeVisible);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ArmadilloPodEntryIndicator_C">();
	}
	static class UArmadilloPodEntryIndicator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArmadilloPodEntryIndicator_C>();
	}
};
static_assert(alignof(UArmadilloPodEntryIndicator_C) == 0x000008, "Wrong alignment on UArmadilloPodEntryIndicator_C");
static_assert(sizeof(UArmadilloPodEntryIndicator_C) == 0x0002A0, "Wrong size on UArmadilloPodEntryIndicator_C");
static_assert(offsetof(UArmadilloPodEntryIndicator_C, UberGraphFrame) == 0x000278, "Member 'UArmadilloPodEntryIndicator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UArmadilloPodEntryIndicator_C, FadeOut) == 0x000280, "Member 'UArmadilloPodEntryIndicator_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UArmadilloPodEntryIndicator_C, FadeIn) == 0x000288, "Member 'UArmadilloPodEntryIndicator_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UArmadilloPodEntryIndicator_C, Ambient) == 0x000290, "Member 'UArmadilloPodEntryIndicator_C::Ambient' has a wrong offset!");
static_assert(offsetof(UArmadilloPodEntryIndicator_C, Image_60) == 0x000298, "Member 'UArmadilloPodEntryIndicator_C::Image_60' has a wrong offset!");

}

