#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Armadillo_PedestalSwapper

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Armadillo_PedestalSwapper.Armadillo_PedestalSwapper_C
// 0x0110 (0x0380 - 0x0270)
class AArmadillo_PedestalSwapper_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    Sequence;                                          // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ATeamMemberPedestal_C*>          PedestalLobby;                                     // 0x0288(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class AFortPlayerController*                  StoredController;                                  // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         ActorToHide;                                       // 0x02A0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class AFortTeamMemberPedestal*>        Member_Pedestals;                                  // 0x02B0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	float                                         AnimTime;                                          // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ClearUpTime;                                       // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hide;                                              // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAnimMontage*>                   AnimArrayCMM;                                      // 0x02D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UAnimMontage*>                   AnimArrayCMF;                                      // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UAnimMontage*>                   AnimArrayCLM;                                      // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UAnimMontage*>                   AnimArrayCLF;                                      // 0x0300(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class ABP_FrontendBackPlate_C> FloorBP;                                           // 0x0310(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	float                                         PedestalLightTime;                                 // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    FortniteItemDefinition;                            // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UArmadillo_AnimComponent_C*>     Component;                                         // 0x0348(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class AActor*                                 ArmadilloFloorActor;                               // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayerInputBlocked;                                // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundMix*                              LobbyMixMod;                                       // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             EnterTubeSound;                                    // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsTest;                                            // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Cleanup();
	void ClearFPCBindings(class AActor* Actor);
	void ExecuteUbergraph_Armadillo_PedestalSwapper(int32 EntryPoint);
	void GetAnimation(class AFortPlayerPawn* Pawn, int32 Index_0, class UAnimMontage** Animation);
	void Hide_UI(bool Hide_0);
	void HoverLight(class ATeamMemberPedestal_C* Pedestal, bool Hover);
	void LobbyTest();
	void OnMatchingConnected(float DelayLength);
	void OnMatchmakingComplete(bool bSuccess);
	void PlayAnimation();
	void PlayAnimPawn();
	void ReAdd_Music_Pack_Audio();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void Remove_Music_Pack_Audio();
	void ResetAudio();
	void StartTimerForUI();
	void TimerDoneUI();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Armadillo_PedestalSwapper_C">();
	}
	static class AArmadillo_PedestalSwapper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AArmadillo_PedestalSwapper_C>();
	}
};
static_assert(alignof(AArmadillo_PedestalSwapper_C) == 0x000008, "Wrong alignment on AArmadillo_PedestalSwapper_C");
static_assert(sizeof(AArmadillo_PedestalSwapper_C) == 0x000380, "Wrong size on AArmadillo_PedestalSwapper_C");
static_assert(offsetof(AArmadillo_PedestalSwapper_C, UberGraphFrame) == 0x000270, "Member 'AArmadillo_PedestalSwapper_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AArmadillo_PedestalSwapper_C, DefaultSceneRoot) == 0x000278, "Member 'AArmadillo_PedestalSwapper_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AArmadillo_PedestalSwapper_C, Sequence) == 0x000280, "Member 'AArmadillo_PedestalSwapper_C::Sequence' has a wrong offset!");
static_assert(offsetof(AArmadillo_PedestalSwapper_C, PedestalLobby) == 0x000288, "Member 'AArmadillo_PedestalSwapper_C::PedestalLobby' has a wrong offset!");
static_assert(offsetof(AArmadillo_PedestalSwapper_C, StoredController) == 0x000298, "Member 'AArmadillo_PedestalSwapper_C::StoredController' has a wrong offset!");
static_assert(offsetof(AArmadillo_PedestalSwapper_C, ActorToHide) == 0x0002A0, "Member 'AArmadillo_PedestalSwapper_C::ActorToHide' has a wrong offset!");
static_assert(offsetof(AArmadillo_PedestalSwapper_C, Member_Pedestals) == 0x0002B0, "Member 'AArmadillo_PedestalSwapper_C::Member_Pedestals' has a wrong offset!");
static_assert(offsetof(AArmadillo_PedestalSwapper_C, AnimTime) == 0x0002C0, "Member 'AArmadillo_PedestalSwapper_C::AnimTime' has a wrong offset!");
static_assert(offsetof(AArmadillo_PedestalSwapper_C, ClearUpTime) == 0x0002C4, "Member 'AArmadillo_PedestalSwapper_C::ClearUpTime' has a wrong offset!");
static_assert(offsetof(AArmadillo_PedestalSwapper_C, Hide) == 0x0002C8, "Member 'AArmadillo_PedestalSwapper_C::Hide' has a wrong offset!");
static_assert(offsetof(AArmadillo_PedestalSwapper_C, AnimArrayCMM) == 0x0002D0, "Member 'AArmadillo_PedestalSwapper_C::AnimArrayCMM' has a wrong offset!");
static_assert(offsetof(AArmadillo_PedestalSwapper_C, AnimArrayCMF) == 0x0002E0, "Member 'AArmadillo_PedestalSwapper_C::AnimArrayCMF' has a wrong offset!");
static_assert(offsetof(AArmadillo_PedestalSwapper_C, AnimArrayCLM) == 0x0002F0, "Member 'AArmadillo_PedestalSwapper_C::AnimArrayCLM' has a wrong offset!");
static_assert(offsetof(AArmadillo_PedestalSwapper_C, AnimArrayCLF) == 0x000300, "Member 'AArmadillo_PedestalSwapper_C::AnimArrayCLF' has a wrong offset!");
static_assert(offsetof(AArmadillo_PedestalSwapper_C, FloorBP) == 0x000310, "Member 'AArmadillo_PedestalSwapper_C::FloorBP' has a wrong offset!");
static_assert(offsetof(AArmadillo_PedestalSwapper_C, PedestalLightTime) == 0x000338, "Member 'AArmadillo_PedestalSwapper_C::PedestalLightTime' has a wrong offset!");
static_assert(offsetof(AArmadillo_PedestalSwapper_C, FortniteItemDefinition) == 0x000340, "Member 'AArmadillo_PedestalSwapper_C::FortniteItemDefinition' has a wrong offset!");
static_assert(offsetof(AArmadillo_PedestalSwapper_C, Component) == 0x000348, "Member 'AArmadillo_PedestalSwapper_C::Component' has a wrong offset!");
static_assert(offsetof(AArmadillo_PedestalSwapper_C, ArmadilloFloorActor) == 0x000358, "Member 'AArmadillo_PedestalSwapper_C::ArmadilloFloorActor' has a wrong offset!");
static_assert(offsetof(AArmadillo_PedestalSwapper_C, PlayerInputBlocked) == 0x000360, "Member 'AArmadillo_PedestalSwapper_C::PlayerInputBlocked' has a wrong offset!");
static_assert(offsetof(AArmadillo_PedestalSwapper_C, LobbyMixMod) == 0x000368, "Member 'AArmadillo_PedestalSwapper_C::LobbyMixMod' has a wrong offset!");
static_assert(offsetof(AArmadillo_PedestalSwapper_C, EnterTubeSound) == 0x000370, "Member 'AArmadillo_PedestalSwapper_C::EnterTubeSound' has a wrong offset!");
static_assert(offsetof(AArmadillo_PedestalSwapper_C, IsTest) == 0x000378, "Member 'AArmadillo_PedestalSwapper_C::IsTest' has a wrong offset!");

}

