#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Armadillo_PedestalSwapper

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function Armadillo_PedestalSwapper.Armadillo_PedestalSwapper_C.ClearFPCBindings
// 0x0008 (0x0008 - 0x0000)
struct Armadillo_PedestalSwapper_C_ClearFPCBindings final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Armadillo_PedestalSwapper_C_ClearFPCBindings) == 0x000008, "Wrong alignment on Armadillo_PedestalSwapper_C_ClearFPCBindings");
static_assert(sizeof(Armadillo_PedestalSwapper_C_ClearFPCBindings) == 0x000008, "Wrong size on Armadillo_PedestalSwapper_C_ClearFPCBindings");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ClearFPCBindings, Actor) == 0x000000, "Member 'Armadillo_PedestalSwapper_C_ClearFPCBindings::Actor' has a wrong offset!");

// Function Armadillo_PedestalSwapper.Armadillo_PedestalSwapper_C.ExecuteUbergraph_Armadillo_PedestalSwapper
// 0x02E8 (0x02E8 - 0x0000)
struct Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class APedestalGroup_Primary_C*>       CallFunc_GetAllActorsOfClass_OutActors;            // 0x0048(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APedestalGroup_Primary_C*               CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortTeamMemberPedestal*                CallFunc_Array_Get_Item_1;                         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATeamMemberPedestal_C*                  K2Node_DynamicCast_AsTeam_Member_Pedestal;         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UArmadillo_AnimComponent_C*             CallFunc_AddComponentByClass_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float DelayLength)>            K2Node_CreateDelegate_OutputDelegate;              // 0x009C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DelayLength;                    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ULobbyPlayerAddPlayer_C*>        CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x00C0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class ULobbyPlayerAddPlayer_C*                CallFunc_Array_Get_Item_2;                         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Hide;                           // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x2];                                       // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_6;                  // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_106[0x2];                                      // 0x0106(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0108(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0118(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_7;                  // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATeamMemberPedestal_C*                  CallFunc_Array_Get_Item_3;                         // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_132[0x2];                                      // 0x0132(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_6;                   // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATeamMemberPedestal_C*                  CallFunc_Array_Get_Item_4;                         // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_getAnimation_Animation;                   // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UArmadillo_AnimComponent_C*             CallFunc_GetComponentByClass_ReturnValue;          // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_182[0x6];                                      // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerNameSafe_ReturnValue;            // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_7;                   // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATeamMemberPedestal_C*                  CallFunc_Array_Get_Item_5;                         // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_FrontendBackPlate_C*                K2Node_DynamicCast_AsBP_Frontend_Back_Plate;       // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateFrontEnd*                 K2Node_DynamicCast_AsFort_Game_State_Front_End;    // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FA[0x6];                                      // 0x01FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_BuildString_Object_ReturnValue;           // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BuildString_Object_ReturnValue_1;         // 0x0210(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue; // 0x0228(0x0010)(ReferenceParm)
	bool                                          K2Node_CustomEvent_bSuccess;                       // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_Array_Get_Item_6;                         // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerFrontEnd*          K2Node_DynamicCast_AsFort_Player_Controller_Front_End; // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bSuccess)>                K2Node_CreateDelegate_OutputDelegate_2;            // 0x0260(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue_1; // 0x0270(0x0010)(ReferenceParm)
	class AFortPlayerController*                  CallFunc_Array_Get_Item_7;                         // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_7;                // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x028D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28E[0x2];                                      // 0x028E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0290(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Actor;                          // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerFrontEnd*          K2Node_DynamicCast_AsFort_Player_Controller_Front_End_1; // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bSuccess)>                K2Node_CreateDelegate_OutputDelegate_4;            // 0x02B4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x02C0(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_BuildString_Object_ReturnValue_2;         // 0x02D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_2;          // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper) == 0x000008, "Wrong alignment on Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper");
static_assert(sizeof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper) == 0x0002E8, "Wrong size on Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, EntryPoint) == 0x000000, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::EntryPoint' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, Temp_int_Array_Index_Variable) == 0x000004, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, Temp_int_Loop_Counter_Variable_1) == 0x000014, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, Temp_byte_Variable) == 0x00001C, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, Temp_bool_Variable) == 0x00001D, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, Temp_bool_IsClosed_Variable) == 0x00001E, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, Temp_bool_Has_Been_Initd_Variable) == 0x00001F, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, Temp_byte_Variable_1) == 0x000020, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, Temp_int_Loop_Counter_Variable_2) == 0x000024, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Add_IntInt_ReturnValue_2) == 0x000028, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, Temp_int_Loop_Counter_Variable_3) == 0x00002C, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Add_IntInt_ReturnValue_3) == 0x000030, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, Temp_int_Array_Index_Variable_2) == 0x000034, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, Temp_int_Array_Index_Variable_3) == 0x000038, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, Temp_int_Loop_Counter_Variable_4) == 0x00003C, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Add_IntInt_ReturnValue_4) == 0x000040, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, Temp_int_Array_Index_Variable_4) == 0x000044, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_GetAllActorsOfClass_OutActors) == 0x000048, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, Temp_int_Array_Index_Variable_5) == 0x000058, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::Temp_int_Array_Index_Variable_5' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Array_Length_ReturnValue) == 0x00005C, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Array_Get_Item) == 0x000060, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_GetFirstLocalFortPlayerController_ReturnValue) == 0x000068, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_GetFirstLocalFortPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Array_Get_Item_1) == 0x000070, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Array_Length_ReturnValue_1) == 0x000078, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, K2Node_DynamicCast_AsTeam_Member_Pedestal) == 0x000080, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::K2Node_DynamicCast_AsTeam_Member_Pedestal' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Less_IntInt_ReturnValue) == 0x000089, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_AddComponentByClass_ReturnValue) == 0x000090, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_AddComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, K2Node_CreateDelegate_OutputDelegate) == 0x00009C, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, K2Node_CustomEvent_DelayLength) == 0x0000A8, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::K2Node_CustomEvent_DelayLength' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_GetContext_ReturnValue) == 0x0000B0, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_GetSequencePlayer_ReturnValue) == 0x0000B8, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_GetSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x0000C0, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Array_Get_Item_2) == 0x0000D0, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Array_Length_ReturnValue_2) == 0x0000D8, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, K2Node_CustomEvent_Hide) == 0x0000DC, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::K2Node_CustomEvent_Hide' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Array_AddUnique_ReturnValue) == 0x0000E0, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Array_Length_ReturnValue_3) == 0x0000E4, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, Temp_int_Loop_Counter_Variable_5) == 0x0000E8, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::Temp_int_Loop_Counter_Variable_5' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Array_Length_ReturnValue_4) == 0x0000EC, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000F0, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000F1, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Add_IntInt_ReturnValue_5) == 0x0000F4, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, Temp_int_Loop_Counter_Variable_6) == 0x0000F8, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::Temp_int_Loop_Counter_Variable_6' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Less_IntInt_ReturnValue_3) == 0x0000FC, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Add_IntInt_ReturnValue_6) == 0x000100, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Not_PreBool_ReturnValue) == 0x000104, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, K2Node_Select_Default) == 0x000105, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, K2Node_CreateDelegate_OutputDelegate_1) == 0x000108, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000118, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, Temp_int_Loop_Counter_Variable_7) == 0x000120, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::Temp_int_Loop_Counter_Variable_7' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Array_Get_Item_3) == 0x000128, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Less_IntInt_ReturnValue_4) == 0x000130, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_IsValid_ReturnValue_1) == 0x000131, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Add_IntInt_ReturnValue_7) == 0x000134, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Add_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Array_Length_ReturnValue_5) == 0x000138, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000140, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Less_IntInt_ReturnValue_5) == 0x000158, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Less_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, Temp_int_Array_Index_Variable_6) == 0x00015C, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::Temp_int_Array_Index_Variable_6' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Array_Get_Item_4) == 0x000160, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000168, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_getAnimation_Animation) == 0x000170, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_getAnimation_Animation' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_GetComponentByClass_ReturnValue) == 0x000178, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_IsValid_ReturnValue_2) == 0x000180, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_IsValid_ReturnValue_3) == 0x000181, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_GetPlayerNameSafe_ReturnValue) == 0x000188, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_GetPlayerNameSafe_ReturnValue' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Concat_StrStr_ReturnValue) == 0x000198, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0001A8, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, Temp_int_Array_Index_Variable_7) == 0x0001B8, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::Temp_int_Array_Index_Variable_7' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x0001C0, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Array_Get_Item_5) == 0x0001C8, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, K2Node_DynamicCast_AsBP_Frontend_Back_Plate) == 0x0001D0, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::K2Node_DynamicCast_AsBP_Frontend_Back_Plate' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, K2Node_DynamicCast_bSuccess_1) == 0x0001D8, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Array_AddUnique_ReturnValue_1) == 0x0001DC, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_GetGameState_ReturnValue) == 0x0001E0, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_IsValid_ReturnValue_4) == 0x0001E8, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, K2Node_DynamicCast_AsFort_Game_State_Front_End) == 0x0001F0, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::K2Node_DynamicCast_AsFort_Game_State_Front_End' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, K2Node_DynamicCast_bSuccess_2) == 0x0001F8, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0001F9, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_BuildString_Object_ReturnValue) == 0x000200, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_BuildString_Object_ReturnValue' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_BuildString_Object_ReturnValue_1) == 0x000210, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_BuildString_Object_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Conv_StringToName_ReturnValue) == 0x000220, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Conv_StringToName_ReturnValue_1) == 0x000224, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_GetLocalFortPlayerControllers_ReturnValue) == 0x000228, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_GetLocalFortPlayerControllers_ReturnValue' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, K2Node_CustomEvent_bSuccess) == 0x000238, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::K2Node_CustomEvent_bSuccess' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Array_Get_Item_6) == 0x000240, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, K2Node_DynamicCast_AsFort_Player_Controller_Front_End) == 0x000248, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::K2Node_DynamicCast_AsFort_Player_Controller_Front_End' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, K2Node_DynamicCast_bSuccess_3) == 0x000250, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Array_Length_ReturnValue_6) == 0x000254, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Array_Length_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Less_IntInt_ReturnValue_6) == 0x000258, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Less_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, K2Node_Event_DeltaSeconds) == 0x00025C, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, K2Node_CreateDelegate_OutputDelegate_2) == 0x000260, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_GetLocalFortPlayerControllers_ReturnValue_1) == 0x000270, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_GetLocalFortPlayerControllers_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Array_Get_Item_7) == 0x000280, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Array_Get_Item_7' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Array_Length_ReturnValue_7) == 0x000288, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Array_Length_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Less_IntInt_ReturnValue_7) == 0x00028C, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Less_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, K2Node_Event_EndPlayReason) == 0x00028D, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, K2Node_CreateDelegate_OutputDelegate_3) == 0x000290, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, K2Node_CustomEvent_Actor) == 0x0002A0, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::K2Node_CustomEvent_Actor' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, K2Node_DynamicCast_AsFort_Player_Controller_Front_End_1) == 0x0002A8, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::K2Node_DynamicCast_AsFort_Player_Controller_Front_End_1' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, K2Node_DynamicCast_bSuccess_4) == 0x0002B0, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, K2Node_CreateDelegate_OutputDelegate_4) == 0x0002B4, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, K2Node_CreateDelegate_OutputDelegate_5) == 0x0002C0, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_BuildString_Object_ReturnValue_2) == 0x0002D0, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_BuildString_Object_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper, CallFunc_Conv_StringToName_ReturnValue_2) == 0x0002E0, "Member 'Armadillo_PedestalSwapper_C_ExecuteUbergraph_Armadillo_PedestalSwapper::CallFunc_Conv_StringToName_ReturnValue_2' has a wrong offset!");

// Function Armadillo_PedestalSwapper.Armadillo_PedestalSwapper_C.GetAnimation
// 0x0158 (0x0158 - 0x0000)
struct Armadillo_PedestalSwapper_C_GetAnimation final
{
public:
	class AFortPlayerPawn*                        Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           Animation;                                         // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAnimMontage*>                   LArray;                                            // 0x0018(0x0010)(Edit, BlueprintVisible)
	TArray<class UAnimMontage*>                   Temp_object_Variable;                              // 0x0028(0x0010)(ReferenceParm)
	EFortCustomBodyType                           CallFunc_GetCharacterBodyType_ReturnValue;         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGender_IsMale;                         // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGender_IsFemale;                       // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class UAnimMontage*>                   Temp_object_Variable_1;                            // 0x0070(0x0010)(ReferenceParm)
