#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArmadilloSystemWarning

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ArmadilloSystemWarning.ArmadilloSystemWarning_C.ExecuteUbergraph_ArmadilloSystemWarning
// 0x00F8 (0x00F8 - 0x0000)
struct ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetPlayerPawn_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ArmadilloPlayerStateComponent_C*    CallFunc_GetComponentByClass_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F[0x1];                                       // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0070(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsCritical;                    // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(bool bIsCritical)>             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00A0(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00D0(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool MainEventStarted)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x00DC(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue; // 0x00E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_MainEventStarted;               // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning) == 0x000008, "Wrong alignment on ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning");
static_assert(sizeof(ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning) == 0x0000F8, "Wrong size on ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning");
static_assert(offsetof(ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning, EntryPoint) == 0x000000, "Member 'ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning::EntryPoint' has a wrong offset!");
static_assert(offsetof(ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning, Temp_bool_Variable) == 0x000004, "Member 'ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning, Temp_int_Variable) == 0x000008, "Member 'ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning, CallFunc_Concat_StrStr_ReturnValue) == 0x000010, "Member 'ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning, Temp_bool_Variable_1) == 0x000020, "Member 'ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning, Temp_int_Variable_1) == 0x000024, "Member 'ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning, Temp_int_Variable_2) == 0x000028, "Member 'ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning, Temp_byte_Variable) == 0x00002C, "Member 'ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning, CallFunc_GetFirstLocalFortPlayerController_ReturnValue) == 0x000030, "Member 'ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning::CallFunc_GetFirstLocalFortPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning, CallFunc_PlayAnimation_ReturnValue) == 0x000038, "Member 'ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning, CallFunc_GetPlayerPawn_ReturnValue) == 0x000048, "Member 'ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning, CallFunc_IsValid_ReturnValue_2) == 0x000051, "Member 'ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning, CallFunc_GetComponentByClass_ReturnValue) == 0x000058, "Member 'ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning, CallFunc_IsValid_ReturnValue_3) == 0x000060, "Member 'ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning, CallFunc_Not_PreBool_ReturnValue) == 0x000061, "Member 'ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning, K2Node_Select_Default) == 0x000064, "Member 'ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning, K2Node_Select_Default_1) == 0x000068, "Member 'ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning, CallFunc_BooleanOR_ReturnValue) == 0x00006C, "Member 'ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning, Temp_bool_Variable_2) == 0x00006D, "Member 'ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning, CallFunc_BooleanOR_ReturnValue_1) == 0x00006E, "Member 'ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning, K2Node_CreateDelegate_OutputDelegate) == 0x000070, "Member 'ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning, K2Node_CustomEvent_bIsCritical) == 0x00007C, "Member 'ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning::K2Node_CustomEvent_bIsCritical' has a wrong offset!");
static_assert(offsetof(ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning, CallFunc_Conv_BoolToString_ReturnValue) == 0x000080, "Member 'ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000090, "Member 'ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000A0, "Member 'ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000B0, "Member 'ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning, CallFunc_PlayAnimation_ReturnValue_2) == 0x0000B8, "Member 'ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning, Temp_byte_Variable_1) == 0x0000C0, "Member 'ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning, K2Node_Select_Default_2) == 0x0000C1, "Member 'ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning, CallFunc_PlayAnimation_ReturnValue_3) == 0x0000C8, "Member 'ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000D0, "Member 'ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000DC, "Member 'ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning, CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue) == 0x0000E8, "Member 'ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning::CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning, K2Node_CustomEvent_MainEventStarted) == 0x0000F0, "Member 'ArmadilloSystemWarning_C_ExecuteUbergraph_ArmadilloSystemWarning::K2Node_CustomEvent_MainEventStarted' has a wrong offset!");

// Function ArmadilloSystemWarning.ArmadilloSystemWarning_C.OnMainEventStarted
// 0x0001 (0x0001 - 0x0000)
struct ArmadilloSystemWarning_C_OnMainEventStarted final
{
public:
	bool                                          MainEventStarted;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArmadilloSystemWarning_C_OnMainEventStarted) == 0x000001, "Wrong alignment on ArmadilloSystemWarning_C_OnMainEventStarted");
static_assert(sizeof(ArmadilloSystemWarning_C_OnMainEventStarted) == 0x000001, "Wrong size on ArmadilloSystemWarning_C_OnMainEventStarted");
static_assert(offsetof(ArmadilloSystemWarning_C_OnMainEventStarted, MainEventStarted) == 0x000000, "Member 'ArmadilloSystemWarning_C_OnMainEventStarted::MainEventStarted' has a wrong offset!");

// Function ArmadilloSystemWarning.ArmadilloSystemWarning_C.OnSystemsCriticalChanged
// 0x0001 (0x0001 - 0x0000)
struct ArmadilloSystemWarning_C_OnSystemsCriticalChanged final
{
public:
	bool                                          bIsCritical;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArmadilloSystemWarning_C_OnSystemsCriticalChanged) == 0x000001, "Wrong alignment on ArmadilloSystemWarning_C_OnSystemsCriticalChanged");
static_assert(sizeof(ArmadilloSystemWarning_C_OnSystemsCriticalChanged) == 0x000001, "Wrong size on ArmadilloSystemWarning_C_OnSystemsCriticalChanged");
static_assert(offsetof(ArmadilloSystemWarning_C_OnSystemsCriticalChanged, bIsCritical) == 0x000000, "Member 'ArmadilloSystemWarning_C_OnSystemsCriticalChanged::bIsCritical' has a wrong offset!");

}

