#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Armadillo_Struct_Missile

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct Armadillo_Struct_Missile.Armadillo_Struct_Missile
// 0x0040 (0x0040 - 0x0000)
struct FArmadillo_Struct_Missile final
{
public:
	class AActor*                                 Target_2_5FFDDF5941963B11755B228E8CD37EFF;         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location_5_43DAE19246E0327D204776B7C8EC36D4;       // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal_12_8F059C3B4D03BCDA2FF0FABF9A456427;     // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsShield_8_B9BD6CB545BAE0C60DCB149BF330B6C1;      // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LockedOn_15_F42896EF488370E3494C4187F1F3E355;      // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDebrisShip_17_04BC715741BA3C7EE7CF2BAACCC87229;  // 0x003A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FArmadillo_Struct_Missile) == 0x000008, "Wrong alignment on FArmadillo_Struct_Missile");
static_assert(sizeof(FArmadillo_Struct_Missile) == 0x000040, "Wrong size on FArmadillo_Struct_Missile");
static_assert(offsetof(FArmadillo_Struct_Missile, Target_2_5FFDDF5941963B11755B228E8CD37EFF) == 0x000000, "Member 'FArmadillo_Struct_Missile::Target_2_5FFDDF5941963B11755B228E8CD37EFF' has a wrong offset!");
static_assert(offsetof(FArmadillo_Struct_Missile, Location_5_43DAE19246E0327D204776B7C8EC36D4) == 0x000008, "Member 'FArmadillo_Struct_Missile::Location_5_43DAE19246E0327D204776B7C8EC36D4' has a wrong offset!");
static_assert(offsetof(FArmadillo_Struct_Missile, HitNormal_12_8F059C3B4D03BCDA2FF0FABF9A456427) == 0x000020, "Member 'FArmadillo_Struct_Missile::HitNormal_12_8F059C3B4D03BCDA2FF0FABF9A456427' has a wrong offset!");
static_assert(offsetof(FArmadillo_Struct_Missile, bIsShield_8_B9BD6CB545BAE0C60DCB149BF330B6C1) == 0x000038, "Member 'FArmadillo_Struct_Missile::bIsShield_8_B9BD6CB545BAE0C60DCB149BF330B6C1' has a wrong offset!");
static_assert(offsetof(FArmadillo_Struct_Missile, LockedOn_15_F42896EF488370E3494C4187F1F3E355) == 0x000039, "Member 'FArmadillo_Struct_Missile::LockedOn_15_F42896EF488370E3494C4187F1F3E355' has a wrong offset!");
static_assert(offsetof(FArmadillo_Struct_Missile, IsDebrisShip_17_04BC715741BA3C7EE7CF2BAACCC87229) == 0x00003A, "Member 'FArmadillo_Struct_Missile::IsDebrisShip_17_04BC715741BA3C7EE7CF2BAACCC87229' has a wrong offset!");

}

