#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArmadilloReticleBPBase

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function ArmadilloReticleBPBase.ArmadilloReticleBPBase_C.BP_OnDesiredVisibilityChanged
// 0x0010 (0x0010 - 0x0000)
struct ArmadilloReticleBPBase_C_BP_OnDesiredVisibilityChanged final
{
public:
	class USpecialEventCursorPawnComponent*       InCursorPawnComponent;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CursorModeTag;                                     // 0x0008(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldBeVisible;                                  // 0x000C(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArmadilloReticleBPBase_C_BP_OnDesiredVisibilityChanged) == 0x000008, "Wrong alignment on ArmadilloReticleBPBase_C_BP_OnDesiredVisibilityChanged");
static_assert(sizeof(ArmadilloReticleBPBase_C_BP_OnDesiredVisibilityChanged) == 0x000010, "Wrong size on ArmadilloReticleBPBase_C_BP_OnDesiredVisibilityChanged");
static_assert(offsetof(ArmadilloReticleBPBase_C_BP_OnDesiredVisibilityChanged, InCursorPawnComponent) == 0x000000, "Member 'ArmadilloReticleBPBase_C_BP_OnDesiredVisibilityChanged::InCursorPawnComponent' has a wrong offset!");
static_assert(offsetof(ArmadilloReticleBPBase_C_BP_OnDesiredVisibilityChanged, CursorModeTag) == 0x000008, "Member 'ArmadilloReticleBPBase_C_BP_OnDesiredVisibilityChanged::CursorModeTag' has a wrong offset!");
static_assert(offsetof(ArmadilloReticleBPBase_C_BP_OnDesiredVisibilityChanged, bShouldBeVisible) == 0x00000C, "Member 'ArmadilloReticleBPBase_C_BP_OnDesiredVisibilityChanged::bShouldBeVisible' has a wrong offset!");

// Function ArmadilloReticleBPBase.ArmadilloReticleBPBase_C.CheckIfAssault
// 0x0020 (0x0020 - 0x0000)
struct ArmadilloReticleBPBase_C_CheckIfAssault final
{
public:
	const class AFortWeaponRanged*                Object;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isAR;                                              // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArmadilloReticleBPBase_C_CheckIfAssault) == 0x000008, "Wrong alignment on ArmadilloReticleBPBase_C_CheckIfAssault");
static_assert(sizeof(ArmadilloReticleBPBase_C_CheckIfAssault) == 0x000020, "Wrong size on ArmadilloReticleBPBase_C_CheckIfAssault");
static_assert(offsetof(ArmadilloReticleBPBase_C_CheckIfAssault, Object) == 0x000000, "Member 'ArmadilloReticleBPBase_C_CheckIfAssault::Object' has a wrong offset!");
static_assert(offsetof(ArmadilloReticleBPBase_C_CheckIfAssault, isAR) == 0x000008, "Member 'ArmadilloReticleBPBase_C_CheckIfAssault::isAR' has a wrong offset!");
static_assert(offsetof(ArmadilloReticleBPBase_C_CheckIfAssault, CallFunc_GetObjectClass_ReturnValue) == 0x000010, "Member 'ArmadilloReticleBPBase_C_CheckIfAssault::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloReticleBPBase_C_CheckIfAssault, CallFunc_Array_Find_ReturnValue) == 0x000018, "Member 'ArmadilloReticleBPBase_C_CheckIfAssault::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloReticleBPBase_C_CheckIfAssault, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00001C, "Member 'ArmadilloReticleBPBase_C_CheckIfAssault::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function ArmadilloReticleBPBase.ArmadilloReticleBPBase_C.ExecuteUbergraph_ArmadilloReticleBPBase
// 0x00D0 (0x00D0 - 0x0000)
struct ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckIfAssault_isAR;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWeaponRanged*                      K2Node_CustomEvent_InRangedWeapon;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetPlayerPawn_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_ReloadTime;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortWeaponReloadType                         K2Node_CustomEvent_ReloadType;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWeapon*                            K2Node_CustomEvent_Weapon;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USpecialEventCursorPawnComponent*       K2Node_Event_InCursorPawnComponent;                // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_CursorModeTag;                        // 0x0040(0x0004)(ConstParm, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShouldBeVisible;                     // 0x0044(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWeapon*                            CallFunc_GetCurrentWeapon_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortWeaponRanged*                      K2Node_DynamicCast_AsFort_Weapon_Ranged;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0074(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float ReloadTime, EFortWeaponReloadType ReloadType)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0080(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AFortWeapon* Weapon)>    K2Node_CreateDelegate_OutputDelegate_2;            // 0x008C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AFortWeapon* Weapon)>    K2Node_CreateDelegate_OutputDelegate_3;            // 0x0098(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float ReloadTime, EFortWeaponReloadType ReloadType)> K2Node_CreateDelegate_OutputDelegate_4; // 0x00A4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x00B0(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase) == 0x000008, "Wrong alignment on ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase");
static_assert(sizeof(ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase) == 0x0000D0, "Wrong size on ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase");
static_assert(offsetof(ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase, EntryPoint) == 0x000000, "Member 'ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase, CallFunc_CheckIfAssault_isAR) == 0x000004, "Member 'ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase::CallFunc_CheckIfAssault_isAR' has a wrong offset!");
static_assert(offsetof(ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase, K2Node_CustomEvent_InRangedWeapon) == 0x000008, "Member 'ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase::K2Node_CustomEvent_InRangedWeapon' has a wrong offset!");
static_assert(offsetof(ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase, CallFunc_GetFirstLocalFortPlayerController_ReturnValue) == 0x000010, "Member 'ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase::CallFunc_GetFirstLocalFortPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase, CallFunc_GetPlayerPawn_ReturnValue) == 0x000018, "Member 'ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase, K2Node_CustomEvent_ReloadTime) == 0x000024, "Member 'ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase::K2Node_CustomEvent_ReloadTime' has a wrong offset!");
static_assert(offsetof(ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase, K2Node_CustomEvent_ReloadType) == 0x000028, "Member 'ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase::K2Node_CustomEvent_ReloadType' has a wrong offset!");
static_assert(offsetof(ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase, K2Node_CustomEvent_Weapon) == 0x000030, "Member 'ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase::K2Node_CustomEvent_Weapon' has a wrong offset!");
static_assert(offsetof(ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase, K2Node_Event_InCursorPawnComponent) == 0x000038, "Member 'ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase::K2Node_Event_InCursorPawnComponent' has a wrong offset!");
static_assert(offsetof(ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase, K2Node_Event_CursorModeTag) == 0x000040, "Member 'ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase::K2Node_Event_CursorModeTag' has a wrong offset!");
static_assert(offsetof(ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase, K2Node_Event_bShouldBeVisible) == 0x000044, "Member 'ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase::K2Node_Event_bShouldBeVisible' has a wrong offset!");
static_assert(offsetof(ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000045, "Member 'ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase, CallFunc_GetOwner_ReturnValue) == 0x000048, "Member 'ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000050, "Member 'ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000059, "Member 'ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase, CallFunc_GetCurrentWeapon_ReturnValue) == 0x000060, "Member 'ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase::CallFunc_GetCurrentWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase, K2Node_DynamicCast_AsFort_Weapon_Ranged) == 0x000068, "Member 'ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase::K2Node_DynamicCast_AsFort_Weapon_Ranged' has a wrong offset!");
static_assert(offsetof(ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase, K2Node_CreateDelegate_OutputDelegate) == 0x000074, "Member 'ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase, K2Node_CreateDelegate_OutputDelegate_1) == 0x000080, "Member 'ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase, K2Node_CreateDelegate_OutputDelegate_2) == 0x00008C, "Member 'ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase, K2Node_CreateDelegate_OutputDelegate_3) == 0x000098, "Member 'ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000A4, "Member 'ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000B0, "Member 'ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase, CallFunc_IsValid_ReturnValue_1) == 0x0000BC, "Member 'ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase, Temp_float_Variable) == 0x0000C0, "Member 'ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase, Temp_float_Variable_1) == 0x0000C4, "Member 'ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase, Temp_bool_Variable) == 0x0000C8, "Member 'ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase, K2Node_Select_Default) == 0x0000CC, "Member 'ArmadilloReticleBPBase_C_ExecuteUbergraph_ArmadilloReticleBPBase::K2Node_Select_Default' has a wrong offset!");

// Function ArmadilloReticleBPBase.ArmadilloReticleBPBase_C.InitializeForRangedWeapon
// 0x0008 (0x0008 - 0x0000)
struct ArmadilloReticleBPBase_C_InitializeForRangedWeapon final
{
public:
	class AFortWeaponRanged*                      InRangedWeapon;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArmadilloReticleBPBase_C_InitializeForRangedWeapon) == 0x000008, "Wrong alignment on ArmadilloReticleBPBase_C_InitializeForRangedWeapon");
static_assert(sizeof(ArmadilloReticleBPBase_C_InitializeForRangedWeapon) == 0x000008, "Wrong size on ArmadilloReticleBPBase_C_InitializeForRangedWeapon");
static_assert(offsetof(ArmadilloReticleBPBase_C_InitializeForRangedWeapon, InRangedWeapon) == 0x000000, "Member 'ArmadilloReticleBPBase_C_InitializeForRangedWeapon::InRangedWeapon' has a wrong offset!");

// Function ArmadilloReticleBPBase.ArmadilloReticleBPBase_C.OnLocalReloadStarted
// 0x0008 (0x0008 - 0x0000)
struct ArmadilloReticleBPBase_C_OnLocalReloadStarted final
{
public:
	float                                         ReloadTime;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortWeaponReloadType                         ReloadType;                                        // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArmadilloReticleBPBase_C_OnLocalReloadStarted) == 0x000004, "Wrong alignment on ArmadilloReticleBPBase_C_OnLocalReloadStarted");
static_assert(sizeof(ArmadilloReticleBPBase_C_OnLocalReloadStarted) == 0x000008, "Wrong size on ArmadilloReticleBPBase_C_OnLocalReloadStarted");
static_assert(offsetof(ArmadilloReticleBPBase_C_OnLocalReloadStarted, ReloadTime) == 0x000000, "Member 'ArmadilloReticleBPBase_C_OnLocalReloadStarted::ReloadTime' has a wrong offset!");
static_assert(offsetof(ArmadilloReticleBPBase_C_OnLocalReloadStarted, ReloadType) == 0x000004, "Member 'ArmadilloReticleBPBase_C_OnLocalReloadStarted::ReloadType' has a wrong offset!");

// Function ArmadilloReticleBPBase.ArmadilloReticleBPBase_C.OnWeaponFireVisuals
// 0x0008 (0x0008 - 0x0000)
struct ArmadilloReticleBPBase_C_OnWeaponFireVisuals final
{
public:
	class AFortWeapon*                            Weapon;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArmadilloReticleBPBase_C_OnWeaponFireVisuals) == 0x000008, "Wrong alignment on ArmadilloReticleBPBase_C_OnWeaponFireVisuals");
static_assert(sizeof(ArmadilloReticleBPBase_C_OnWeaponFireVisuals) == 0x000008, "Wrong size on ArmadilloReticleBPBase_C_OnWeaponFireVisuals");
static_assert(offsetof(ArmadilloReticleBPBase_C_OnWeaponFireVisuals, Weapon) == 0x000000, "Member 'ArmadilloReticleBPBase_C_OnWeaponFireVisuals::Weapon' has a wrong offset!");

}

