#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArmadilloReticleBPBase

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "SpecialEventGameplayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ArmadilloReticleBPBase.ArmadilloReticleBPBase_C
// 0x0028 (0x02C0 - 0x0298)
class UArmadilloReticleBPBase_C : public USpecialEventCursorWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bIsLocalPlayerReticle;                             // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWeaponRanged*                      RangedWeapon;                                      // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         AssaultArray;                                      // 0x02B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BP_OnDesiredVisibilityChanged(class USpecialEventCursorPawnComponent* InCursorPawnComponent, const struct FGameplayTag& CursorModeTag, const bool bShouldBeVisible);
	void CheckIfAssault(const class AFortWeaponRanged* Object, bool* isAR);
	void ExecuteUbergraph_ArmadilloReticleBPBase(int32 EntryPoint);
	void InitializeForRangedWeapon(class AFortWeaponRanged* InRangedWeapon);
	void OnLocalReloadCancelled();
	void OnLocalReloadStarted(float ReloadTime, EFortWeaponReloadType ReloadType);
	void OnWeaponFireVisuals(class AFortWeapon* Weapon);
	void UpdateLocalPlayerStyling();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ArmadilloReticleBPBase_C">();
	}
	static class UArmadilloReticleBPBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArmadilloReticleBPBase_C>();
	}
};
static_assert(alignof(UArmadilloReticleBPBase_C) == 0x000008, "Wrong alignment on UArmadilloReticleBPBase_C");
static_assert(sizeof(UArmadilloReticleBPBase_C) == 0x0002C0, "Wrong size on UArmadilloReticleBPBase_C");
static_assert(offsetof(UArmadilloReticleBPBase_C, UberGraphFrame) == 0x000298, "Member 'UArmadilloReticleBPBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UArmadilloReticleBPBase_C, bIsLocalPlayerReticle) == 0x0002A0, "Member 'UArmadilloReticleBPBase_C::bIsLocalPlayerReticle' has a wrong offset!");
static_assert(offsetof(UArmadilloReticleBPBase_C, RangedWeapon) == 0x0002A8, "Member 'UArmadilloReticleBPBase_C::RangedWeapon' has a wrong offset!");
static_assert(offsetof(UArmadilloReticleBPBase_C, AssaultArray) == 0x0002B0, "Member 'UArmadilloReticleBPBase_C::AssaultArray' has a wrong offset!");

}

