#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Armadillo_Game_Preshow_Countdown

#include "Basic.hpp"


namespace SDK::Params
{

// Function Armadillo_Game_Preshow_Countdown.Armadillo_Game_Preshow_Countdown (Director BP)_C.BP_Armadillo_PreEventManager_Event_0
// 0x0008 (0x0008 - 0x0000)
struct Armadillo_Game_Preshow_Countdown__Director_BP__C_BP_Armadillo_PreEventManager_Event_0 final
{
public:
	class ABP_Armadillo_PreEventManager_C*        BP_Armadillo_PreEventManager;                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Armadillo_Game_Preshow_Countdown__Director_BP__C_BP_Armadillo_PreEventManager_Event_0) == 0x000008, "Wrong alignment on Armadillo_Game_Preshow_Countdown__Director_BP__C_BP_Armadillo_PreEventManager_Event_0");
static_assert(sizeof(Armadillo_Game_Preshow_Countdown__Director_BP__C_BP_Armadillo_PreEventManager_Event_0) == 0x000008, "Wrong size on Armadillo_Game_Preshow_Countdown__Director_BP__C_BP_Armadillo_PreEventManager_Event_0");
static_assert(offsetof(Armadillo_Game_Preshow_Countdown__Director_BP__C_BP_Armadillo_PreEventManager_Event_0, BP_Armadillo_PreEventManager) == 0x000000, "Member 'Armadillo_Game_Preshow_Countdown__Director_BP__C_BP_Armadillo_PreEventManager_Event_0::BP_Armadillo_PreEventManager' has a wrong offset!");

// Function Armadillo_Game_Preshow_Countdown.Armadillo_Game_Preshow_Countdown (Director BP)_C.ExecuteUbergraph_Armadillo_Game_Preshow_Countdown (Director BP)
// 0x0010 (0x0010 - 0x0000)
struct Armadillo_Game_Preshow_Countdown__Director_BP__C_ExecuteUbergraph_Armadillo_Game_Preshow_Countdown__Director_BP_ final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Armadillo_PreEventManager_C*        K2Node_CustomEvent_BP_Armadillo_PreEventManager;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Armadillo_Game_Preshow_Countdown__Director_BP__C_ExecuteUbergraph_Armadillo_Game_Preshow_Countdown__Director_BP_) == 0x000008, "Wrong alignment on Armadillo_Game_Preshow_Countdown__Director_BP__C_ExecuteUbergraph_Armadillo_Game_Preshow_Countdown__Director_BP_");
static_assert(sizeof(Armadillo_Game_Preshow_Countdown__Director_BP__C_ExecuteUbergraph_Armadillo_Game_Preshow_Countdown__Director_BP_) == 0x000010, "Wrong size on Armadillo_Game_Preshow_Countdown__Director_BP__C_ExecuteUbergraph_Armadillo_Game_Preshow_Countdown__Director_BP_");
static_assert(offsetof(Armadillo_Game_Preshow_Countdown__Director_BP__C_ExecuteUbergraph_Armadillo_Game_Preshow_Countdown__Director_BP_, EntryPoint) == 0x000000, "Member 'Armadillo_Game_Preshow_Countdown__Director_BP__C_ExecuteUbergraph_Armadillo_Game_Preshow_Countdown__Director_BP_::EntryPoint' has a wrong offset!");
static_assert(offsetof(Armadillo_Game_Preshow_Countdown__Director_BP__C_ExecuteUbergraph_Armadillo_Game_Preshow_Countdown__Director_BP_, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'Armadillo_Game_Preshow_Countdown__Director_BP__C_ExecuteUbergraph_Armadillo_Game_Preshow_Countdown__Director_BP_::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Armadillo_Game_Preshow_Countdown__Director_BP__C_ExecuteUbergraph_Armadillo_Game_Preshow_Countdown__Director_BP_, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'Armadillo_Game_Preshow_Countdown__Director_BP__C_ExecuteUbergraph_Armadillo_Game_Preshow_Countdown__Director_BP_::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Armadillo_Game_Preshow_Countdown__Director_BP__C_ExecuteUbergraph_Armadillo_Game_Preshow_Countdown__Director_BP_, K2Node_CustomEvent_BP_Armadillo_PreEventManager) == 0x000008, "Member 'Armadillo_Game_Preshow_Countdown__Director_BP__C_ExecuteUbergraph_Armadillo_Game_Preshow_Countdown__Director_BP_::K2Node_CustomEvent_BP_Armadillo_PreEventManager' has a wrong offset!");

// Function Armadillo_Game_Preshow_Countdown.Armadillo_Game_Preshow_Countdown (Director BP)_C.SequenceEvent__ENTRYPOINTArmadillo_Game_Preshow_Countdown (Director BP)_0
// 0x0008 (0x0008 - 0x0000)
struct Armadillo_Game_Preshow_Countdown__Director_BP__C_SequenceEvent__ENTRYPOINTArmadillo_Game_Preshow_Countdown__Director_BP__0 final
{
public:
	class ABP_Armadillo_PreEventManager_C*        BP_Armadillo_PreEventManager;                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Armadillo_Game_Preshow_Countdown__Director_BP__C_SequenceEvent__ENTRYPOINTArmadillo_Game_Preshow_Countdown__Director_BP__0) == 0x000008, "Wrong alignment on Armadillo_Game_Preshow_Countdown__Director_BP__C_SequenceEvent__ENTRYPOINTArmadillo_Game_Preshow_Countdown__Director_BP__0");
static_assert(sizeof(Armadillo_Game_Preshow_Countdown__Director_BP__C_SequenceEvent__ENTRYPOINTArmadillo_Game_Preshow_Countdown__Director_BP__0) == 0x000008, "Wrong size on Armadillo_Game_Preshow_Countdown__Director_BP__C_SequenceEvent__ENTRYPOINTArmadillo_Game_Preshow_Countdown__Director_BP__0");
static_assert(offsetof(Armadillo_Game_Preshow_Countdown__Director_BP__C_SequenceEvent__ENTRYPOINTArmadillo_Game_Preshow_Countdown__Director_BP__0, BP_Armadillo_PreEventManager) == 0x000000, "Member 'Armadillo_Game_Preshow_Countdown__Director_BP__C_SequenceEvent__ENTRYPOINTArmadillo_Game_Preshow_Countdown__Director_BP__0::BP_Armadillo_PreEventManager' has a wrong offset!");

}

