#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Armadillo_AnimComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function Armadillo_AnimComponent.Armadillo_AnimComponent_C.ExecuteUbergraph_Armadillo_AnimComponent
// 0x0090 (0x0090 - 0x0000)
struct Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0034(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0044(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0054(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 K2Node_CustomEvent_Mesh;                           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_CustomEvent_Montage;                        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_ON;                             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent) == 0x000008, "Wrong alignment on Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent");
static_assert(sizeof(Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent) == 0x000090, "Wrong size on Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent");
static_assert(offsetof(Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent, EntryPoint) == 0x000000, "Member 'Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent, K2Node_CustomEvent_NotifyName_4) == 0x000010, "Member 'Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent, K2Node_CustomEvent_NotifyName_3) == 0x000020, "Member 'Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent, K2Node_CustomEvent_NotifyName_2) == 0x000030, "Member 'Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent, K2Node_CreateDelegate_OutputDelegate_2) == 0x000034, "Member 'Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent, K2Node_CustomEvent_NotifyName_1) == 0x000040, "Member 'Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent, K2Node_CreateDelegate_OutputDelegate_3) == 0x000044, "Member 'Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent, K2Node_CustomEvent_NotifyName) == 0x000050, "Member 'Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent, K2Node_CreateDelegate_OutputDelegate_4) == 0x000054, "Member 'Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent, Temp_name_Variable) == 0x000060, "Member 'Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent, K2Node_CustomEvent_Mesh) == 0x000068, "Member 'Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent::K2Node_CustomEvent_Mesh' has a wrong offset!");
static_assert(offsetof(Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent, K2Node_CustomEvent_Montage) == 0x000070, "Member 'Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent::K2Node_CustomEvent_Montage' has a wrong offset!");
static_assert(offsetof(Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent, K2Node_CustomEvent_ON) == 0x000078, "Member 'Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent::K2Node_CustomEvent_ON' has a wrong offset!");
static_assert(offsetof(Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000080, "Member 'Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'Armadillo_AnimComponent_C_ExecuteUbergraph_Armadillo_AnimComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Armadillo_AnimComponent.Armadillo_AnimComponent_C.OnBlendOut_ABFD1FD04C68D253804BB3A3C38AEA7B
// 0x0004 (0x0004 - 0x0000)
struct Armadillo_AnimComponent_C_OnBlendOut_ABFD1FD04C68D253804BB3A3C38AEA7B final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Armadillo_AnimComponent_C_OnBlendOut_ABFD1FD04C68D253804BB3A3C38AEA7B) == 0x000004, "Wrong alignment on Armadillo_AnimComponent_C_OnBlendOut_ABFD1FD04C68D253804BB3A3C38AEA7B");
static_assert(sizeof(Armadillo_AnimComponent_C_OnBlendOut_ABFD1FD04C68D253804BB3A3C38AEA7B) == 0x000004, "Wrong size on Armadillo_AnimComponent_C_OnBlendOut_ABFD1FD04C68D253804BB3A3C38AEA7B");
static_assert(offsetof(Armadillo_AnimComponent_C_OnBlendOut_ABFD1FD04C68D253804BB3A3C38AEA7B, NotifyName) == 0x000000, "Member 'Armadillo_AnimComponent_C_OnBlendOut_ABFD1FD04C68D253804BB3A3C38AEA7B::NotifyName' has a wrong offset!");

// Function Armadillo_AnimComponent.Armadillo_AnimComponent_C.OnCompleted_ABFD1FD04C68D253804BB3A3C38AEA7B
// 0x0004 (0x0004 - 0x0000)
struct Armadillo_AnimComponent_C_OnCompleted_ABFD1FD04C68D253804BB3A3C38AEA7B final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Armadillo_AnimComponent_C_OnCompleted_ABFD1FD04C68D253804BB3A3C38AEA7B) == 0x000004, "Wrong alignment on Armadillo_AnimComponent_C_OnCompleted_ABFD1FD04C68D253804BB3A3C38AEA7B");
static_assert(sizeof(Armadillo_AnimComponent_C_OnCompleted_ABFD1FD04C68D253804BB3A3C38AEA7B) == 0x000004, "Wrong size on Armadillo_AnimComponent_C_OnCompleted_ABFD1FD04C68D253804BB3A3C38AEA7B");
static_assert(offsetof(Armadillo_AnimComponent_C_OnCompleted_ABFD1FD04C68D253804BB3A3C38AEA7B, NotifyName) == 0x000000, "Member 'Armadillo_AnimComponent_C_OnCompleted_ABFD1FD04C68D253804BB3A3C38AEA7B::NotifyName' has a wrong offset!");

// Function Armadillo_AnimComponent.Armadillo_AnimComponent_C.OnInterrupted_ABFD1FD04C68D253804BB3A3C38AEA7B
// 0x0004 (0x0004 - 0x0000)
struct Armadillo_AnimComponent_C_OnInterrupted_ABFD1FD04C68D253804BB3A3C38AEA7B final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Armadillo_AnimComponent_C_OnInterrupted_ABFD1FD04C68D253804BB3A3C38AEA7B) == 0x000004, "Wrong alignment on Armadillo_AnimComponent_C_OnInterrupted_ABFD1FD04C68D253804BB3A3C38AEA7B");
static_assert(sizeof(Armadillo_AnimComponent_C_OnInterrupted_ABFD1FD04C68D253804BB3A3C38AEA7B) == 0x000004, "Wrong size on Armadillo_AnimComponent_C_OnInterrupted_ABFD1FD04C68D253804BB3A3C38AEA7B");
static_assert(offsetof(Armadillo_AnimComponent_C_OnInterrupted_ABFD1FD04C68D253804BB3A3C38AEA7B, NotifyName) == 0x000000, "Member 'Armadillo_AnimComponent_C_OnInterrupted_ABFD1FD04C68D253804BB3A3C38AEA7B::NotifyName' has a wrong offset!");

// Function Armadillo_AnimComponent.Armadillo_AnimComponent_C.OnNotifyBegin_ABFD1FD04C68D253804BB3A3C38AEA7B
// 0x0004 (0x0004 - 0x0000)
struct Armadillo_AnimComponent_C_OnNotifyBegin_ABFD1FD04C68D253804BB3A3C38AEA7B final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Armadillo_AnimComponent_C_OnNotifyBegin_ABFD1FD04C68D253804BB3A3C38AEA7B) == 0x000004, "Wrong alignment on Armadillo_AnimComponent_C_OnNotifyBegin_ABFD1FD04C68D253804BB3A3C38AEA7B");
static_assert(sizeof(Armadillo_AnimComponent_C_OnNotifyBegin_ABFD1FD04C68D253804BB3A3C38AEA7B) == 0x000004, "Wrong size on Armadillo_AnimComponent_C_OnNotifyBegin_ABFD1FD04C68D253804BB3A3C38AEA7B");
static_assert(offsetof(Armadillo_AnimComponent_C_OnNotifyBegin_ABFD1FD04C68D253804BB3A3C38AEA7B, NotifyName) == 0x000000, "Member 'Armadillo_AnimComponent_C_OnNotifyBegin_ABFD1FD04C68D253804BB3A3C38AEA7B::NotifyName' has a wrong offset!");

// Function Armadillo_AnimComponent.Armadillo_AnimComponent_C.OnNotifyEnd_ABFD1FD04C68D253804BB3A3C38AEA7B
// 0x0004 (0x0004 - 0x0000)
struct Armadillo_AnimComponent_C_OnNotifyEnd_ABFD1FD04C68D253804BB3A3C38AEA7B final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Armadillo_AnimComponent_C_OnNotifyEnd_ABFD1FD04C68D253804BB3A3C38AEA7B) == 0x000004, "Wrong alignment on Armadillo_AnimComponent_C_OnNotifyEnd_ABFD1FD04C68D253804BB3A3C38AEA7B");
static_assert(sizeof(Armadillo_AnimComponent_C_OnNotifyEnd_ABFD1FD04C68D253804BB3A3C38AEA7B) == 0x000004, "Wrong size on Armadillo_AnimComponent_C_OnNotifyEnd_ABFD1FD04C68D253804BB3A3C38AEA7B");
static_assert(offsetof(Armadillo_AnimComponent_C_OnNotifyEnd_ABFD1FD04C68D253804BB3A3C38AEA7B, NotifyName) == 0x000000, "Member 'Armadillo_AnimComponent_C_OnNotifyEnd_ABFD1FD04C68D253804BB3A3C38AEA7B::NotifyName' has a wrong offset!");

// Function Armadillo_AnimComponent.Armadillo_AnimComponent_C.PlayAnimation
// 0x0018 (0x0018 - 0x0000)
struct Armadillo_AnimComponent_C_PlayAnimation final
{
public:
	class USkeletalMeshComponent*                 Mesh;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Montage;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          On;                                                // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Armadillo_AnimComponent_C_PlayAnimation) == 0x000008, "Wrong alignment on Armadillo_AnimComponent_C_PlayAnimation");
static_assert(sizeof(Armadillo_AnimComponent_C_PlayAnimation) == 0x000018, "Wrong size on Armadillo_AnimComponent_C_PlayAnimation");
static_assert(offsetof(Armadillo_AnimComponent_C_PlayAnimation, Mesh) == 0x000000, "Member 'Armadillo_AnimComponent_C_PlayAnimation::Mesh' has a wrong offset!");
static_assert(offsetof(Armadillo_AnimComponent_C_PlayAnimation, Montage) == 0x000008, "Member 'Armadillo_AnimComponent_C_PlayAnimation::Montage' has a wrong offset!");
static_assert(offsetof(Armadillo_AnimComponent_C_PlayAnimation, On) == 0x000010, "Member 'Armadillo_AnimComponent_C_PlayAnimation::On' has a wrong offset!");

}

