#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArmadilloSystemWarning

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ArmadilloSystemWarning.ArmadilloSystemWarning_C
// 0x0060 (0x02D8 - 0x0278)
class UArmadilloSystemWarning_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SystemsCritical_Outro;                             // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Overcharged;                                       // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SystemsCritical;                                   // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Backing_LargeSoft;                                 // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_55;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressBar;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_Message;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_ArmadilloSystemWarning(int32 EntryPoint);
	void OnMainEventStarted(bool MainEventStarted);
	void OnOvercharged();
	void OnSystemsCriticalChanged(bool bIsCritical);
	void TestSysW();
	void TryGrabPlayerState();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ArmadilloSystemWarning_C">();
	}
	static class UArmadilloSystemWarning_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArmadilloSystemWarning_C>();
	}
};
static_assert(alignof(UArmadilloSystemWarning_C) == 0x000008, "Wrong alignment on UArmadilloSystemWarning_C");
static_assert(sizeof(UArmadilloSystemWarning_C) == 0x0002D8, "Wrong size on UArmadilloSystemWarning_C");
static_assert(offsetof(UArmadilloSystemWarning_C, UberGraphFrame) == 0x000278, "Member 'UArmadilloSystemWarning_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UArmadilloSystemWarning_C, SystemsCritical_Outro) == 0x000280, "Member 'UArmadilloSystemWarning_C::SystemsCritical_Outro' has a wrong offset!");
static_assert(offsetof(UArmadilloSystemWarning_C, Overcharged) == 0x000288, "Member 'UArmadilloSystemWarning_C::Overcharged' has a wrong offset!");
static_assert(offsetof(UArmadilloSystemWarning_C, SystemsCritical) == 0x000290, "Member 'UArmadilloSystemWarning_C::SystemsCritical' has a wrong offset!");
static_assert(offsetof(UArmadilloSystemWarning_C, Intro) == 0x000298, "Member 'UArmadilloSystemWarning_C::Intro' has a wrong offset!");
static_assert(offsetof(UArmadilloSystemWarning_C, Backing_LargeSoft) == 0x0002A0, "Member 'UArmadilloSystemWarning_C::Backing_LargeSoft' has a wrong offset!");
static_assert(offsetof(UArmadilloSystemWarning_C, Image) == 0x0002A8, "Member 'UArmadilloSystemWarning_C::Image' has a wrong offset!");
static_assert(offsetof(UArmadilloSystemWarning_C, Image_2) == 0x0002B0, "Member 'UArmadilloSystemWarning_C::Image_2' has a wrong offset!");
static_assert(offsetof(UArmadilloSystemWarning_C, Image_3) == 0x0002B8, "Member 'UArmadilloSystemWarning_C::Image_3' has a wrong offset!");
static_assert(offsetof(UArmadilloSystemWarning_C, Image_55) == 0x0002C0, "Member 'UArmadilloSystemWarning_C::Image_55' has a wrong offset!");
static_assert(offsetof(UArmadilloSystemWarning_C, ProgressBar) == 0x0002C8, "Member 'UArmadilloSystemWarning_C::ProgressBar' has a wrong offset!");
static_assert(offsetof(UArmadilloSystemWarning_C, Switcher_Message) == 0x0002D0, "Member 'UArmadilloSystemWarning_C::Switcher_Message' has a wrong offset!");

}

