#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArmadilloFunctionLibrary

#include "Basic.hpp"


namespace SDK::Params
{

// Function ArmadilloFunctionLibrary.ArmadilloFunctionLibrary_C.Armadillo on Play Weapon Fire FX Forward to Widget
// 0x0050 (0x0050 - 0x0000)
struct ArmadilloFunctionLibrary_C_Armadillo_on_Play_Weapon_Fire_FX_Forward_to_Widget final
{
public:
	class AFortWeapon*                            Weapon;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USpecialEventCursorPawnComponent*       CallFunc_GetSpecialEventCursorPawnComponentForWeapon_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetCurrentWidget_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UArmadilloReticlesCombined_C*           K2Node_DynamicCast_AsArmadillo_Reticles_Combined;  // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArmadilloFunctionLibrary_C_Armadillo_on_Play_Weapon_Fire_FX_Forward_to_Widget) == 0x000008, "Wrong alignment on ArmadilloFunctionLibrary_C_Armadillo_on_Play_Weapon_Fire_FX_Forward_to_Widget");
static_assert(sizeof(ArmadilloFunctionLibrary_C_Armadillo_on_Play_Weapon_Fire_FX_Forward_to_Widget) == 0x000050, "Wrong size on ArmadilloFunctionLibrary_C_Armadillo_on_Play_Weapon_Fire_FX_Forward_to_Widget");
static_assert(offsetof(ArmadilloFunctionLibrary_C_Armadillo_on_Play_Weapon_Fire_FX_Forward_to_Widget, Weapon) == 0x000000, "Member 'ArmadilloFunctionLibrary_C_Armadillo_on_Play_Weapon_Fire_FX_Forward_to_Widget::Weapon' has a wrong offset!");
static_assert(offsetof(ArmadilloFunctionLibrary_C_Armadillo_on_Play_Weapon_Fire_FX_Forward_to_Widget, __WorldContext) == 0x000008, "Member 'ArmadilloFunctionLibrary_C_Armadillo_on_Play_Weapon_Fire_FX_Forward_to_Widget::__WorldContext' has a wrong offset!");
static_assert(offsetof(ArmadilloFunctionLibrary_C_Armadillo_on_Play_Weapon_Fire_FX_Forward_to_Widget, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'ArmadilloFunctionLibrary_C_Armadillo_on_Play_Weapon_Fire_FX_Forward_to_Widget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloFunctionLibrary_C_Armadillo_on_Play_Weapon_Fire_FX_Forward_to_Widget, CallFunc_IsDedicatedServer_ReturnValue) == 0x000011, "Member 'ArmadilloFunctionLibrary_C_Armadillo_on_Play_Weapon_Fire_FX_Forward_to_Widget::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloFunctionLibrary_C_Armadillo_on_Play_Weapon_Fire_FX_Forward_to_Widget, CallFunc_GetSpecialEventCursorPawnComponentForWeapon_ReturnValue) == 0x000018, "Member 'ArmadilloFunctionLibrary_C_Armadillo_on_Play_Weapon_Fire_FX_Forward_to_Widget::CallFunc_GetSpecialEventCursorPawnComponentForWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloFunctionLibrary_C_Armadillo_on_Play_Weapon_Fire_FX_Forward_to_Widget, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'ArmadilloFunctionLibrary_C_Armadillo_on_Play_Weapon_Fire_FX_Forward_to_Widget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ArmadilloFunctionLibrary_C_Armadillo_on_Play_Weapon_Fire_FX_Forward_to_Widget, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000028, "Member 'ArmadilloFunctionLibrary_C_Armadillo_on_Play_Weapon_Fire_FX_Forward_to_Widget::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(ArmadilloFunctionLibrary_C_Armadillo_on_Play_Weapon_Fire_FX_Forward_to_Widget, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'ArmadilloFunctionLibrary_C_Armadillo_on_Play_Weapon_Fire_FX_Forward_to_Widget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ArmadilloFunctionLibrary_C_Armadillo_on_Play_Weapon_Fire_FX_Forward_to_Widget, CallFunc_IsLocallyControlled_ReturnValue) == 0x000031, "Member 'ArmadilloFunctionLibrary_C_Armadillo_on_Play_Weapon_Fire_FX_Forward_to_Widget::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloFunctionLibrary_C_Armadillo_on_Play_Weapon_Fire_FX_Forward_to_Widget, CallFunc_GetCurrentWidget_ReturnValue) == 0x000038, "Member 'ArmadilloFunctionLibrary_C_Armadillo_on_Play_Weapon_Fire_FX_Forward_to_Widget::CallFunc_GetCurrentWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmadilloFunctionLibrary_C_Armadillo_on_Play_Weapon_Fire_FX_Forward_to_Widget, K2Node_DynamicCast_AsArmadillo_Reticles_Combined) == 0x000040, "Member 'ArmadilloFunctionLibrary_C_Armadillo_on_Play_Weapon_Fire_FX_Forward_to_Widget::K2Node_DynamicCast_AsArmadillo_Reticles_Combined' has a wrong offset!");
static_assert(offsetof(ArmadilloFunctionLibrary_C_Armadillo_on_Play_Weapon_Fire_FX_Forward_to_Widget, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'ArmadilloFunctionLibrary_C_Armadillo_on_Play_Weapon_Fire_FX_Forward_to_Widget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function ArmadilloFunctionLibrary.ArmadilloFunctionLibrary_C.Armadillo_DestroyRangedWeaponComponents
// 0x0018 (0x0018 - 0x0000)
struct ArmadilloFunctionLibrary_C_Armadillo_DestroyRangedWeaponComponents final
{
public:
	class AB_Ranged_Generic_C*                    RangedWeapon;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArmadilloFunctionLibrary_C_Armadillo_DestroyRangedWeaponComponents) == 0x000008, "Wrong alignment on ArmadilloFunctionLibrary_C_Armadillo_DestroyRangedWeaponComponents");
static_assert(sizeof(ArmadilloFunctionLibrary_C_Armadillo_DestroyRangedWeaponComponents) == 0x000018, "Wrong size on ArmadilloFunctionLibrary_C_Armadillo_DestroyRangedWeaponComponents");
static_assert(offsetof(ArmadilloFunctionLibrary_C_Armadillo_DestroyRangedWeaponComponents, RangedWeapon) == 0x000000, "Member 'ArmadilloFunctionLibrary_C_Armadillo_DestroyRangedWeaponComponents::RangedWeapon' has a wrong offset!");
static_assert(offsetof(ArmadilloFunctionLibrary_C_Armadillo_DestroyRangedWeaponComponents, __WorldContext) == 0x000008, "Member 'ArmadilloFunctionLibrary_C_Armadillo_DestroyRangedWeaponComponents::__WorldContext' has a wrong offset!");
static_assert(offsetof(ArmadilloFunctionLibrary_C_Armadillo_DestroyRangedWeaponComponents, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'ArmadilloFunctionLibrary_C_Armadillo_DestroyRangedWeaponComponents::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

