#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaBottomBarWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaBottomBarWidget.AthenaBottomBarWidget_C
// 0x0028 (0x02C8 - 0x02A0)
class UAthenaBottomBarWidget_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                BorderShell;                                       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBoundActionBar*                  CommonBoundActionBar_121;                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortHUDElementWrapper_C*               FortHUDElementWrapper;                             // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Display_Owner_Actions_Only;                        // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_AthenaBottomBarWidget(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaBottomBarWidget_C">();
	}
	static class UAthenaBottomBarWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaBottomBarWidget_C>();
	}
};
static_assert(alignof(UAthenaBottomBarWidget_C) == 0x000008, "Wrong alignment on UAthenaBottomBarWidget_C");
static_assert(sizeof(UAthenaBottomBarWidget_C) == 0x0002C8, "Wrong size on UAthenaBottomBarWidget_C");
static_assert(offsetof(UAthenaBottomBarWidget_C, UberGraphFrame) == 0x0002A0, "Member 'UAthenaBottomBarWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaBottomBarWidget_C, BorderShell) == 0x0002A8, "Member 'UAthenaBottomBarWidget_C::BorderShell' has a wrong offset!");
static_assert(offsetof(UAthenaBottomBarWidget_C, CommonBoundActionBar_121) == 0x0002B0, "Member 'UAthenaBottomBarWidget_C::CommonBoundActionBar_121' has a wrong offset!");
static_assert(offsetof(UAthenaBottomBarWidget_C, FortHUDElementWrapper) == 0x0002B8, "Member 'UAthenaBottomBarWidget_C::FortHUDElementWrapper' has a wrong offset!");
static_assert(offsetof(UAthenaBottomBarWidget_C, Display_Owner_Actions_Only) == 0x0002C0, "Member 'UAthenaBottomBarWidget_C::Display_Owner_Actions_Only' has a wrong offset!");

}

