#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMOTDTileMainPage

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function AthenaMOTDTileMainPage.AthenaMOTDTileMainPage_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaMOTDTileMainPage_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMOTDTileMainPage_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on AthenaMOTDTileMainPage_C_BP_OnItemSelectionChanged");
static_assert(sizeof(AthenaMOTDTileMainPage_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on AthenaMOTDTileMainPage_C_BP_OnItemSelectionChanged");
static_assert(offsetof(AthenaMOTDTileMainPage_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'AthenaMOTDTileMainPage_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function AthenaMOTDTileMainPage.AthenaMOTDTileMainPage_C.ExecuteUbergraph_AthenaMOTDTileMainPage
// 0x0640 (0x0640 - 0x0000)
struct AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0040)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0048(0x0090)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00D8(0x0090)(ConstParm)
	bool                                          CallFunc_IsListItemSelected_ReturnValue;           // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AB[0x1];                                      // 0x01AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x01AC(0x0014)()
	struct FAthenaMOTDBase                        K2Node_Event_NewsEntry;                            // 0x01C0(0x00D0)(ConstParm)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0290(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x02A4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B6[0x2];                                      // 0x02B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFontOutlineSettings                   K2Node_MakeStruct_FontOutlineSettings;             // 0x02B8(0x0020)(NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x02D8(0x0050)(HasGetValueTypeHash)
	uint8                                         Pad_328[0x8];                                      // 0x0328(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTextBlockStyle                        K2Node_MakeStruct_TextBlockStyle;                  // 0x0330(0x0310)()
};
static_assert(alignof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage) == 0x000010, "Wrong alignment on AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage");
static_assert(sizeof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage) == 0x000640, "Wrong size on AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, EntryPoint) == 0x000000, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, Temp_byte_Variable) == 0x000004, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, Temp_byte_Variable_1) == 0x000005, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, Temp_bool_Variable) == 0x000006, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, K2Node_Event_IsDesignTime) == 0x000007, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, K2Node_Event_MyGeometry) == 0x000008, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, K2Node_Event_MouseEvent_1) == 0x000048, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, K2Node_Event_MouseEvent) == 0x0000D8, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, CallFunc_IsListItemSelected_ReturnValue) == 0x000168, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::CallFunc_IsListItemSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000170, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, CallFunc_PlayAnimationForward_ReturnValue) == 0x000178, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000180, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000188, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, K2Node_Event_bIsSelected) == 0x000190, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000198, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0001A0, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, Temp_bool_Variable_1) == 0x0001A8, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, K2Node_Select_Default) == 0x0001A9, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, CallFunc_IsValid_ReturnValue) == 0x0001AA, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, K2Node_MakeStruct_SlateColor) == 0x0001AC, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, K2Node_Event_NewsEntry) == 0x0001C0, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::K2Node_Event_NewsEntry' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000290, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, CallFunc_GetSelected_ReturnValue) == 0x0002A0, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::CallFunc_GetSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, K2Node_Select_Default_1) == 0x0002A4, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, CallFunc_BooleanOR_ReturnValue) == 0x0002B4, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, CallFunc_Not_PreBool_ReturnValue) == 0x0002B5, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, K2Node_MakeStruct_FontOutlineSettings) == 0x0002B8, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::K2Node_MakeStruct_FontOutlineSettings' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, K2Node_MakeStruct_SlateFontInfo) == 0x0002D8, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage, K2Node_MakeStruct_TextBlockStyle) == 0x000330, "Member 'AthenaMOTDTileMainPage_C_ExecuteUbergraph_AthenaMOTDTileMainPage::K2Node_MakeStruct_TextBlockStyle' has a wrong offset!");

// Function AthenaMOTDTileMainPage.AthenaMOTDTileMainPage_C.OnMouseEnter
// 0x00D0 (0x00D0 - 0x0000)
struct AthenaMOTDTileMainPage_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0040(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaMOTDTileMainPage_C_OnMouseEnter) == 0x000008, "Wrong alignment on AthenaMOTDTileMainPage_C_OnMouseEnter");
static_assert(sizeof(AthenaMOTDTileMainPage_C_OnMouseEnter) == 0x0000D0, "Wrong size on AthenaMOTDTileMainPage_C_OnMouseEnter");
static_assert(offsetof(AthenaMOTDTileMainPage_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'AthenaMOTDTileMainPage_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_OnMouseEnter, MouseEvent) == 0x000040, "Member 'AthenaMOTDTileMainPage_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function AthenaMOTDTileMainPage.AthenaMOTDTileMainPage_C.OnMouseLeave
// 0x0090 (0x0090 - 0x0000)
struct AthenaMOTDTileMainPage_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaMOTDTileMainPage_C_OnMouseLeave) == 0x000008, "Wrong alignment on AthenaMOTDTileMainPage_C_OnMouseLeave");
static_assert(sizeof(AthenaMOTDTileMainPage_C_OnMouseLeave) == 0x000090, "Wrong size on AthenaMOTDTileMainPage_C_OnMouseLeave");
static_assert(offsetof(AthenaMOTDTileMainPage_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'AthenaMOTDTileMainPage_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function AthenaMOTDTileMainPage.AthenaMOTDTileMainPage_C.OnPopulateNews
// 0x00D0 (0x00D0 - 0x0000)
struct AthenaMOTDTileMainPage_C_OnPopulateNews final
{
public:
	struct FAthenaMOTDBase                        NewsEntry;                                         // 0x0000(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaMOTDTileMainPage_C_OnPopulateNews) == 0x000008, "Wrong alignment on AthenaMOTDTileMainPage_C_OnPopulateNews");
static_assert(sizeof(AthenaMOTDTileMainPage_C_OnPopulateNews) == 0x0000D0, "Wrong size on AthenaMOTDTileMainPage_C_OnPopulateNews");
static_assert(offsetof(AthenaMOTDTileMainPage_C_OnPopulateNews, NewsEntry) == 0x000000, "Member 'AthenaMOTDTileMainPage_C_OnPopulateNews::NewsEntry' has a wrong offset!");

// Function AthenaMOTDTileMainPage.AthenaMOTDTileMainPage_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct AthenaMOTDTileMainPage_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMOTDTileMainPage_C_PreConstruct) == 0x000001, "Wrong alignment on AthenaMOTDTileMainPage_C_PreConstruct");
static_assert(sizeof(AthenaMOTDTileMainPage_C_PreConstruct) == 0x000001, "Wrong size on AthenaMOTDTileMainPage_C_PreConstruct");
static_assert(offsetof(AthenaMOTDTileMainPage_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'AthenaMOTDTileMainPage_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function AthenaMOTDTileMainPage.AthenaMOTDTileMainPage_C.ShowImageOnly
// 0x0004 (0x0004 - 0x0000)
struct AthenaMOTDTileMainPage_C_ShowImageOnly final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMOTDTileMainPage_C_ShowImageOnly) == 0x000001, "Wrong alignment on AthenaMOTDTileMainPage_C_ShowImageOnly");
static_assert(sizeof(AthenaMOTDTileMainPage_C_ShowImageOnly) == 0x000004, "Wrong size on AthenaMOTDTileMainPage_C_ShowImageOnly");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ShowImageOnly, Temp_bool_Variable) == 0x000000, "Member 'AthenaMOTDTileMainPage_C_ShowImageOnly::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ShowImageOnly, Temp_byte_Variable) == 0x000001, "Member 'AthenaMOTDTileMainPage_C_ShowImageOnly::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ShowImageOnly, Temp_byte_Variable_1) == 0x000002, "Member 'AthenaMOTDTileMainPage_C_ShowImageOnly::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_ShowImageOnly, K2Node_Select_Default) == 0x000003, "Member 'AthenaMOTDTileMainPage_C_ShowImageOnly::K2Node_Select_Default' has a wrong offset!");

// Function AthenaMOTDTileMainPage.AthenaMOTDTileMainPage_C.UpdateDisplay
// 0x0004 (0x0004 - 0x0000)
struct AthenaMOTDTileMainPage_C_UpdateDisplay final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMOTDTileMainPage_C_UpdateDisplay) == 0x000001, "Wrong alignment on AthenaMOTDTileMainPage_C_UpdateDisplay");
static_assert(sizeof(AthenaMOTDTileMainPage_C_UpdateDisplay) == 0x000004, "Wrong size on AthenaMOTDTileMainPage_C_UpdateDisplay");
static_assert(offsetof(AthenaMOTDTileMainPage_C_UpdateDisplay, Temp_bool_Variable) == 0x000000, "Member 'AthenaMOTDTileMainPage_C_UpdateDisplay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_UpdateDisplay, Temp_byte_Variable) == 0x000001, "Member 'AthenaMOTDTileMainPage_C_UpdateDisplay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_UpdateDisplay, Temp_byte_Variable_1) == 0x000002, "Member 'AthenaMOTDTileMainPage_C_UpdateDisplay::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDTileMainPage_C_UpdateDisplay, K2Node_Select_Default) == 0x000003, "Member 'AthenaMOTDTileMainPage_C_UpdateDisplay::K2Node_Select_Default' has a wrong offset!");

}

