#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLeaderboardTabButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUILegacy_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaLeaderboardTabButton.AthenaLeaderboardTabButton_C
// 0x0140 (0x1130 - 0x0FF0)
class UAthenaLeaderboardTabButton_C final : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_FE8[0x8];                                      // 0x0FE8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0FF0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       CenterButtonTextWidget;                            // 0x0FF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ContentHB;                                         // 0x1000(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeftSideImage;                                     // 0x1008(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ButtonText;                                        // 0x1010(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	uint8                                         Pad_1028[0x8];                                     // 0x1028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            IconBrush;                                         // 0x1030(0x00C0)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          UseText;                                           // 0x10F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10F1[0x3];                                     // 0x10F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           SelectedIconTint;                                  // 0x10F4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DeselectedIconTint;                                // 0x1104(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HoveredIconTint;                                   // 0x1114(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnDeselected();
	void BP_OnHovered();
	void BP_OnSelected();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_AthenaLeaderboardTabButton(int32 EntryPoint);
	void OnCurrentTextStyleChanged();
	void PreConstruct(bool IsDesignTime);
	void Set_Icon(const struct FSlateBrush& IconBrush_0);
	void Set_Text(const class FText& ButtonText_0);
	void SetTabLabelInfo(const struct FFortTabButtonLabelInfo& TabLabelInfo);
	void ShowText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaLeaderboardTabButton_C">();
	}
	static class UAthenaLeaderboardTabButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaLeaderboardTabButton_C>();
	}
};
static_assert(alignof(UAthenaLeaderboardTabButton_C) == 0x000010, "Wrong alignment on UAthenaLeaderboardTabButton_C");
static_assert(sizeof(UAthenaLeaderboardTabButton_C) == 0x001130, "Wrong size on UAthenaLeaderboardTabButton_C");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, UberGraphFrame) == 0x000FF0, "Member 'UAthenaLeaderboardTabButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, CenterButtonTextWidget) == 0x000FF8, "Member 'UAthenaLeaderboardTabButton_C::CenterButtonTextWidget' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, ContentHB) == 0x001000, "Member 'UAthenaLeaderboardTabButton_C::ContentHB' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, LeftSideImage) == 0x001008, "Member 'UAthenaLeaderboardTabButton_C::LeftSideImage' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, ButtonText) == 0x001010, "Member 'UAthenaLeaderboardTabButton_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, IconBrush) == 0x001030, "Member 'UAthenaLeaderboardTabButton_C::IconBrush' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, UseText) == 0x0010F0, "Member 'UAthenaLeaderboardTabButton_C::UseText' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, SelectedIconTint) == 0x0010F4, "Member 'UAthenaLeaderboardTabButton_C::SelectedIconTint' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, DeselectedIconTint) == 0x001104, "Member 'UAthenaLeaderboardTabButton_C::DeselectedIconTint' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, HoveredIconTint) == 0x001114, "Member 'UAthenaLeaderboardTabButton_C::HoveredIconTint' has a wrong offset!");

}

