#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaVariantTileButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaVariantTileButton.AthenaVariantTileButton_C
// 0x0020 (0x1090 - 0x1070)
class UAthenaVariantTileButton_C final : public UFortVariantTileButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1070(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       WarningPulse;                                      // 0x1078(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Conflict;                                    // 0x1080(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnListItemObjectSet(class UObject* ListItemObject);
	void ExecuteUbergraph_AthenaVariantTileButton(int32 EntryPoint);
	void BP_OnClicked();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaVariantTileButton_C">();
	}
	static class UAthenaVariantTileButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaVariantTileButton_C>();
	}
};
static_assert(alignof(UAthenaVariantTileButton_C) == 0x000010, "Wrong alignment on UAthenaVariantTileButton_C");
static_assert(sizeof(UAthenaVariantTileButton_C) == 0x001090, "Wrong size on UAthenaVariantTileButton_C");
static_assert(offsetof(UAthenaVariantTileButton_C, UberGraphFrame) == 0x001070, "Member 'UAthenaVariantTileButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaVariantTileButton_C, WarningPulse) == 0x001078, "Member 'UAthenaVariantTileButton_C::WarningPulse' has a wrong offset!");
static_assert(offsetof(UAthenaVariantTileButton_C, Image_Conflict) == 0x001080, "Member 'UAthenaVariantTileButton_C::Image_Conflict' has a wrong offset!");

}

