#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaCustomizationPicker

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AthenaCustomizationPicker.AthenaCustomizationPicker_C.BndEvt__AthenaCustomizationPicker_Button_SortAndFilter_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaCustomizationPicker_C_BndEvt__AthenaCustomizationPicker_Button_SortAndFilter_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCustomizationPicker_C_BndEvt__AthenaCustomizationPicker_Button_SortAndFilter_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaCustomizationPicker_C_BndEvt__AthenaCustomizationPicker_Button_SortAndFilter_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaCustomizationPicker_C_BndEvt__AthenaCustomizationPicker_Button_SortAndFilter_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaCustomizationPicker_C_BndEvt__AthenaCustomizationPicker_Button_SortAndFilter_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaCustomizationPicker_C_BndEvt__AthenaCustomizationPicker_Button_SortAndFilter_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaCustomizationPicker_C_BndEvt__AthenaCustomizationPicker_Button_SortAndFilter_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaCustomizationPicker.AthenaCustomizationPicker_C.BndEvt__AthenaCustomizationPicker_Button_SortAndFilter_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaCustomizationPicker_C_BndEvt__AthenaCustomizationPicker_Button_SortAndFilter_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCustomizationPicker_C_BndEvt__AthenaCustomizationPicker_Button_SortAndFilter_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaCustomizationPicker_C_BndEvt__AthenaCustomizationPicker_Button_SortAndFilter_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaCustomizationPicker_C_BndEvt__AthenaCustomizationPicker_Button_SortAndFilter_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaCustomizationPicker_C_BndEvt__AthenaCustomizationPicker_Button_SortAndFilter_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaCustomizationPicker_C_BndEvt__AthenaCustomizationPicker_Button_SortAndFilter_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaCustomizationPicker_C_BndEvt__AthenaCustomizationPicker_Button_SortAndFilter_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaCustomizationPicker.AthenaCustomizationPicker_C.BndEvt__AthenaCustomizationPicker_Button_TextSearch_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaCustomizationPicker_C_BndEvt__AthenaCustomizationPicker_Button_TextSearch_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCustomizationPicker_C_BndEvt__AthenaCustomizationPicker_Button_TextSearch_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaCustomizationPicker_C_BndEvt__AthenaCustomizationPicker_Button_TextSearch_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaCustomizationPicker_C_BndEvt__AthenaCustomizationPicker_Button_TextSearch_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaCustomizationPicker_C_BndEvt__AthenaCustomizationPicker_Button_TextSearch_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaCustomizationPicker_C_BndEvt__AthenaCustomizationPicker_Button_TextSearch_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaCustomizationPicker_C_BndEvt__AthenaCustomizationPicker_Button_TextSearch_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaCustomizationPicker.AthenaCustomizationPicker_C.BndEvt__AthenaCustomizationPicker_Button_TextSearch_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaCustomizationPicker_C_BndEvt__AthenaCustomizationPicker_Button_TextSearch_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCustomizationPicker_C_BndEvt__AthenaCustomizationPicker_Button_TextSearch_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaCustomizationPicker_C_BndEvt__AthenaCustomizationPicker_Button_TextSearch_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaCustomizationPicker_C_BndEvt__AthenaCustomizationPicker_Button_TextSearch_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaCustomizationPicker_C_BndEvt__AthenaCustomizationPicker_Button_TextSearch_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaCustomizationPicker_C_BndEvt__AthenaCustomizationPicker_Button_TextSearch_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaCustomizationPicker_C_BndEvt__AthenaCustomizationPicker_Button_TextSearch_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaCustomizationPicker.AthenaCustomizationPicker_C.BndEvt__Button_TextSearch_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaCustomizationPicker_C_BndEvt__Button_TextSearch_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCustomizationPicker_C_BndEvt__Button_TextSearch_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaCustomizationPicker_C_BndEvt__Button_TextSearch_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaCustomizationPicker_C_BndEvt__Button_TextSearch_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaCustomizationPicker_C_BndEvt__Button_TextSearch_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaCustomizationPicker_C_BndEvt__Button_TextSearch_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaCustomizationPicker_C_BndEvt__Button_TextSearch_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaCustomizationPicker.AthenaCustomizationPicker_C.BndEvt__PickerTileView_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct AthenaCustomizationPicker_C_BndEvt__PickerTileView_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCustomizationPicker_C_BndEvt__PickerTileView_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on AthenaCustomizationPicker_C_BndEvt__PickerTileView_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(sizeof(AthenaCustomizationPicker_C_BndEvt__PickerTileView_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000010, "Wrong size on AthenaCustomizationPicker_C_BndEvt__PickerTileView_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(offsetof(AthenaCustomizationPicker_C_BndEvt__PickerTileView_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature, Item) == 0x000000, "Member 'AthenaCustomizationPicker_C_BndEvt__PickerTileView_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_BndEvt__PickerTileView_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature, bIsSelected) == 0x000008, "Member 'AthenaCustomizationPicker_C_BndEvt__PickerTileView_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature::bIsSelected' has a wrong offset!");

// Function AthenaCustomizationPicker.AthenaCustomizationPicker_C.ExecuteUbergraph_AthenaCustomizationPicker
// 0x0108 (0x0108 - 0x0000)
struct AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FText& Text)>      K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FText& Text, ETextCommit CommitMethod)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0010(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0038(0x0010)(NoDestructor)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_4;               // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_3;               // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle_1;            // 0x0058(0x0010)(NoDestructor)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_2;               // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0070(0x0008)(NoDestructor)
	class FText                                   K2Node_Event_EmptyDisplayText;                     // 0x0078(0x0018)(ConstParm)
	bool                                          K2Node_Event_bEnabled;                             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Text_1;                         // 0x0098(0x0018)(ConstParm)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_1;               // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button;                 // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Text;                           // 0x00C0(0x0018)(ConstParm)
	ETextCommit                                   K2Node_CustomEvent_CommitMethod;                   // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DB[0x5];                                       // 0x00DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasUserFocus_ReturnValue;                 // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_2;          // 0x00EC(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected;            // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBladeOpen_ReturnValue;                  // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0103(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker) == 0x000008, "Wrong alignment on AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker");
static_assert(sizeof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker) == 0x000108, "Wrong size on AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker");
static_assert(offsetof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker, EntryPoint) == 0x000000, "Member 'AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000020, "Member 'AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000028, "Member 'AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker, CallFunc_GetCurrentInputType_ReturnValue) == 0x000030, "Member 'AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker, K2Node_MakeStruct_DataTableRowHandle) == 0x000038, "Member 'AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker, K2Node_ComponentBoundEvent_Button_4) == 0x000048, "Member 'AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker::K2Node_ComponentBoundEvent_Button_4' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker, K2Node_ComponentBoundEvent_Button_3) == 0x000050, "Member 'AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker, K2Node_MakeStruct_DataTableRowHandle_1) == 0x000058, "Member 'AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker::K2Node_MakeStruct_DataTableRowHandle_1' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker, K2Node_ComponentBoundEvent_Button_2) == 0x000068, "Member 'AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker, K2Node_Event_InFocusEvent) == 0x000070, "Member 'AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker, K2Node_Event_EmptyDisplayText) == 0x000078, "Member 'AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker::K2Node_Event_EmptyDisplayText' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker, K2Node_Event_bEnabled) == 0x000090, "Member 'AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker::K2Node_Event_bEnabled' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker, K2Node_CustomEvent_Text_1) == 0x000098, "Member 'AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker::K2Node_CustomEvent_Text_1' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker, K2Node_ComponentBoundEvent_Button_1) == 0x0000B0, "Member 'AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker, K2Node_ComponentBoundEvent_Button) == 0x0000B8, "Member 'AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker, K2Node_CustomEvent_Text) == 0x0000C0, "Member 'AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker::K2Node_CustomEvent_Text' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker, K2Node_CustomEvent_CommitMethod) == 0x0000D8, "Member 'AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker::K2Node_CustomEvent_CommitMethod' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000D9, "Member 'AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker, Temp_byte_Variable) == 0x0000DA, "Member 'AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000E0, "Member 'AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker, CallFunc_HasUserFocus_ReturnValue) == 0x0000E8, "Member 'AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker::CallFunc_HasUserFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker, CallFunc_Not_PreBool_ReturnValue) == 0x0000E9, "Member 'AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker, CallFunc_BooleanAND_ReturnValue) == 0x0000EA, "Member 'AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker, Temp_byte_Variable_1) == 0x0000EB, "Member 'AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000EC, "Member 'AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker, K2Node_ComponentBoundEvent_Item) == 0x0000F8, "Member 'AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker::K2Node_ComponentBoundEvent_Item' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker, K2Node_ComponentBoundEvent_bIsSelected) == 0x000100, "Member 'AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker::K2Node_ComponentBoundEvent_bIsSelected' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker, CallFunc_IsBladeOpen_ReturnValue) == 0x000101, "Member 'AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker::CallFunc_IsBladeOpen_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker, CallFunc_Not_PreBool_ReturnValue_1) == 0x000102, "Member 'AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker, Temp_bool_Variable) == 0x000103, "Member 'AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker, CallFunc_BooleanAND_ReturnValue_1) == 0x000104, "Member 'AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker, K2Node_Select_Default) == 0x000105, "Member 'AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker::K2Node_Select_Default' has a wrong offset!");

// Function AthenaCustomizationPicker.AthenaCustomizationPicker_C.GetTextFilterSelectedState
// 0x0002 (0x0002 - 0x0000)
struct AthenaCustomizationPicker_C_GetTextFilterSelectedState final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCustomizationPicker_C_GetTextFilterSelectedState) == 0x000001, "Wrong alignment on AthenaCustomizationPicker_C_GetTextFilterSelectedState");
static_assert(sizeof(AthenaCustomizationPicker_C_GetTextFilterSelectedState) == 0x000002, "Wrong size on AthenaCustomizationPicker_C_GetTextFilterSelectedState");
static_assert(offsetof(AthenaCustomizationPicker_C_GetTextFilterSelectedState, bIsSelected) == 0x000000, "Member 'AthenaCustomizationPicker_C_GetTextFilterSelectedState::bIsSelected' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_GetTextFilterSelectedState, CallFunc_GetSelected_ReturnValue) == 0x000001, "Member 'AthenaCustomizationPicker_C_GetTextFilterSelectedState::CallFunc_GetSelected_ReturnValue' has a wrong offset!");

// Function AthenaCustomizationPicker.AthenaCustomizationPicker_C.HandleSearchTextFilterChanged
// 0x0070 (0x0070 - 0x0000)
struct AthenaCustomizationPicker_C_HandleSearchTextFilterChanged final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetCurrentText_Text;                      // 0x0020(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x0050(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCustomizationPicker_C_HandleSearchTextFilterChanged) == 0x000008, "Wrong alignment on AthenaCustomizationPicker_C_HandleSearchTextFilterChanged");
static_assert(sizeof(AthenaCustomizationPicker_C_HandleSearchTextFilterChanged) == 0x000070, "Wrong size on AthenaCustomizationPicker_C_HandleSearchTextFilterChanged");
static_assert(offsetof(AthenaCustomizationPicker_C_HandleSearchTextFilterChanged, Text) == 0x000000, "Member 'AthenaCustomizationPicker_C_HandleSearchTextFilterChanged::Text' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_HandleSearchTextFilterChanged, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x000018, "Member 'AthenaCustomizationPicker_C_HandleSearchTextFilterChanged::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_HandleSearchTextFilterChanged, CallFunc_GetCurrentText_Text) == 0x000020, "Member 'AthenaCustomizationPicker_C_HandleSearchTextFilterChanged::CallFunc_GetCurrentText_Text' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_HandleSearchTextFilterChanged, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'AthenaCustomizationPicker_C_HandleSearchTextFilterChanged::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_HandleSearchTextFilterChanged, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000048, "Member 'AthenaCustomizationPicker_C_HandleSearchTextFilterChanged::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_HandleSearchTextFilterChanged, CallFunc_GetEmptyText_ReturnValue) == 0x000050, "Member 'AthenaCustomizationPicker_C_HandleSearchTextFilterChanged::CallFunc_GetEmptyText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_HandleSearchTextFilterChanged, CallFunc_EqualEqual_TextText_ReturnValue) == 0x000068, "Member 'AthenaCustomizationPicker_C_HandleSearchTextFilterChanged::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");

// Function AthenaCustomizationPicker.AthenaCustomizationPicker_C.HandleTextChanged
// 0x0018 (0x0018 - 0x0000)
struct AthenaCustomizationPicker_C_HandleTextChanged final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaCustomizationPicker_C_HandleTextChanged) == 0x000008, "Wrong alignment on AthenaCustomizationPicker_C_HandleTextChanged");
static_assert(sizeof(AthenaCustomizationPicker_C_HandleTextChanged) == 0x000018, "Wrong size on AthenaCustomizationPicker_C_HandleTextChanged");
static_assert(offsetof(AthenaCustomizationPicker_C_HandleTextChanged, Text) == 0x000000, "Member 'AthenaCustomizationPicker_C_HandleTextChanged::Text' has a wrong offset!");

// Function AthenaCustomizationPicker.AthenaCustomizationPicker_C.HandleTextEntryTimer
// 0x0038 (0x0038 - 0x0000)
struct AthenaCustomizationPicker_C_HandleTextEntryTimer final
{
public:
	class FText                                   CallFunc_GetCurrentText_Text;                      // 0x0000(0x0018)()
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x0018(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCustomizationPicker_C_HandleTextEntryTimer) == 0x000008, "Wrong alignment on AthenaCustomizationPicker_C_HandleTextEntryTimer");
static_assert(sizeof(AthenaCustomizationPicker_C_HandleTextEntryTimer) == 0x000038, "Wrong size on AthenaCustomizationPicker_C_HandleTextEntryTimer");
static_assert(offsetof(AthenaCustomizationPicker_C_HandleTextEntryTimer, CallFunc_GetCurrentText_Text) == 0x000000, "Member 'AthenaCustomizationPicker_C_HandleTextEntryTimer::CallFunc_GetCurrentText_Text' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_HandleTextEntryTimer, CallFunc_GetEmptyText_ReturnValue) == 0x000018, "Member 'AthenaCustomizationPicker_C_HandleTextEntryTimer::CallFunc_GetEmptyText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_HandleTextEntryTimer, CallFunc_EqualEqual_TextText_ReturnValue) == 0x000030, "Member 'AthenaCustomizationPicker_C_HandleTextEntryTimer::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");

// Function AthenaCustomizationPicker.AthenaCustomizationPicker_C.NavigateDownFromSearch
// 0x0038 (0x0038 - 0x0000)
struct AthenaCustomizationPicker_C_NavigateDownFromSearch final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                NewParam;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIndexForItem_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCustomizationPicker_C_NavigateDownFromSearch) == 0x000008, "Wrong alignment on AthenaCustomizationPicker_C_NavigateDownFromSearch");
static_assert(sizeof(AthenaCustomizationPicker_C_NavigateDownFromSearch) == 0x000038, "Wrong size on AthenaCustomizationPicker_C_NavigateDownFromSearch");
static_assert(offsetof(AthenaCustomizationPicker_C_NavigateDownFromSearch, Navigation_0) == 0x000000, "Member 'AthenaCustomizationPicker_C_NavigateDownFromSearch::Navigation_0' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_NavigateDownFromSearch, NewParam) == 0x000008, "Member 'AthenaCustomizationPicker_C_NavigateDownFromSearch::NewParam' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_NavigateDownFromSearch, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'AthenaCustomizationPicker_C_NavigateDownFromSearch::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_NavigateDownFromSearch, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000014, "Member 'AthenaCustomizationPicker_C_NavigateDownFromSearch::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_NavigateDownFromSearch, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000018, "Member 'AthenaCustomizationPicker_C_NavigateDownFromSearch::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_NavigateDownFromSearch, CallFunc_BP_GetSelectedItem_ReturnValue) == 0x000020, "Member 'AthenaCustomizationPicker_C_NavigateDownFromSearch::CallFunc_BP_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_NavigateDownFromSearch, CallFunc_GetIndexForItem_ReturnValue) == 0x000028, "Member 'AthenaCustomizationPicker_C_NavigateDownFromSearch::CallFunc_GetIndexForItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_NavigateDownFromSearch, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00002C, "Member 'AthenaCustomizationPicker_C_NavigateDownFromSearch::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_NavigateDownFromSearch, CallFunc_SelectInt_ReturnValue) == 0x000030, "Member 'AthenaCustomizationPicker_C_NavigateDownFromSearch::CallFunc_SelectInt_ReturnValue' has a wrong offset!");

// Function AthenaCustomizationPicker.AthenaCustomizationPicker_C.NavigateDownFromSortAndFilter
// 0x0048 (0x0048 - 0x0000)
struct AthenaCustomizationPicker_C_NavigateDownFromSortAndFilter final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                NewParam;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIndexForItem_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumItems_ReturnValue;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEntryWidth_ReturnValue;                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_MathExpression_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCustomizationPicker_C_NavigateDownFromSortAndFilter) == 0x000008, "Wrong alignment on AthenaCustomizationPicker_C_NavigateDownFromSortAndFilter");
static_assert(sizeof(AthenaCustomizationPicker_C_NavigateDownFromSortAndFilter) == 0x000048, "Wrong size on AthenaCustomizationPicker_C_NavigateDownFromSortAndFilter");
static_assert(offsetof(AthenaCustomizationPicker_C_NavigateDownFromSortAndFilter, Navigation_0) == 0x000000, "Member 'AthenaCustomizationPicker_C_NavigateDownFromSortAndFilter::Navigation_0' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_NavigateDownFromSortAndFilter, NewParam) == 0x000008, "Member 'AthenaCustomizationPicker_C_NavigateDownFromSortAndFilter::NewParam' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_NavigateDownFromSortAndFilter, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'AthenaCustomizationPicker_C_NavigateDownFromSortAndFilter::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_NavigateDownFromSortAndFilter, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000014, "Member 'AthenaCustomizationPicker_C_NavigateDownFromSortAndFilter::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_NavigateDownFromSortAndFilter, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000018, "Member 'AthenaCustomizationPicker_C_NavigateDownFromSortAndFilter::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_NavigateDownFromSortAndFilter, CallFunc_BP_GetSelectedItem_ReturnValue) == 0x000020, "Member 'AthenaCustomizationPicker_C_NavigateDownFromSortAndFilter::CallFunc_BP_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_NavigateDownFromSortAndFilter, CallFunc_GetIndexForItem_ReturnValue) == 0x000028, "Member 'AthenaCustomizationPicker_C_NavigateDownFromSortAndFilter::CallFunc_GetIndexForItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_NavigateDownFromSortAndFilter, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'AthenaCustomizationPicker_C_NavigateDownFromSortAndFilter::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_NavigateDownFromSortAndFilter, CallFunc_GetNumItems_ReturnValue) == 0x000030, "Member 'AthenaCustomizationPicker_C_NavigateDownFromSortAndFilter::CallFunc_GetNumItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_NavigateDownFromSortAndFilter, CallFunc_Subtract_IntInt_ReturnValue) == 0x000034, "Member 'AthenaCustomizationPicker_C_NavigateDownFromSortAndFilter::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_NavigateDownFromSortAndFilter, CallFunc_GetEntryWidth_ReturnValue) == 0x000038, "Member 'AthenaCustomizationPicker_C_NavigateDownFromSortAndFilter::CallFunc_GetEntryWidth_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_NavigateDownFromSortAndFilter, K2Node_MathExpression_ReturnValue) == 0x00003C, "Member 'AthenaCustomizationPicker_C_NavigateDownFromSortAndFilter::K2Node_MathExpression_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_NavigateDownFromSortAndFilter, CallFunc_Min_ReturnValue) == 0x000040, "Member 'AthenaCustomizationPicker_C_NavigateDownFromSortAndFilter::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_NavigateDownFromSortAndFilter, CallFunc_SelectInt_ReturnValue) == 0x000044, "Member 'AthenaCustomizationPicker_C_NavigateDownFromSortAndFilter::CallFunc_SelectInt_ReturnValue' has a wrong offset!");

// Function AthenaCustomizationPicker.AthenaCustomizationPicker_C.NavigateUpFromPicker
// 0x0040 (0x0040 - 0x0000)
struct AthenaCustomizationPicker_C_NavigateUpFromPicker final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentHoverPercentage;                            // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEntryWidth_ReturnValue;                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIndexForItem_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MathExpression_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCustomizationPicker_C_NavigateUpFromPicker) == 0x000008, "Wrong alignment on AthenaCustomizationPicker_C_NavigateUpFromPicker");
static_assert(sizeof(AthenaCustomizationPicker_C_NavigateUpFromPicker) == 0x000040, "Wrong size on AthenaCustomizationPicker_C_NavigateUpFromPicker");
static_assert(offsetof(AthenaCustomizationPicker_C_NavigateUpFromPicker, Navigation_0) == 0x000000, "Member 'AthenaCustomizationPicker_C_NavigateUpFromPicker::Navigation_0' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_NavigateUpFromPicker, ReturnValue) == 0x000008, "Member 'AthenaCustomizationPicker_C_NavigateUpFromPicker::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_NavigateUpFromPicker, CurrentHoverPercentage) == 0x000010, "Member 'AthenaCustomizationPicker_C_NavigateUpFromPicker::CurrentHoverPercentage' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_NavigateUpFromPicker, Temp_bool_Variable) == 0x000014, "Member 'AthenaCustomizationPicker_C_NavigateUpFromPicker::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_NavigateUpFromPicker, K2Node_SwitchEnum_CmpSuccess) == 0x000015, "Member 'AthenaCustomizationPicker_C_NavigateUpFromPicker::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_NavigateUpFromPicker, CallFunc_Less_FloatFloat_ReturnValue) == 0x000016, "Member 'AthenaCustomizationPicker_C_NavigateUpFromPicker::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_NavigateUpFromPicker, CallFunc_GetEntryWidth_ReturnValue) == 0x000018, "Member 'AthenaCustomizationPicker_C_NavigateUpFromPicker::CallFunc_GetEntryWidth_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_NavigateUpFromPicker, CallFunc_BP_GetSelectedItem_ReturnValue) == 0x000020, "Member 'AthenaCustomizationPicker_C_NavigateUpFromPicker::CallFunc_BP_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_NavigateUpFromPicker, CallFunc_GetIndexForItem_ReturnValue) == 0x000028, "Member 'AthenaCustomizationPicker_C_NavigateUpFromPicker::CallFunc_GetIndexForItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_NavigateUpFromPicker, K2Node_Select_Default) == 0x000030, "Member 'AthenaCustomizationPicker_C_NavigateUpFromPicker::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_NavigateUpFromPicker, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000038, "Member 'AthenaCustomizationPicker_C_NavigateUpFromPicker::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_NavigateUpFromPicker, K2Node_MathExpression_ReturnValue) == 0x00003C, "Member 'AthenaCustomizationPicker_C_NavigateUpFromPicker::K2Node_MathExpression_ReturnValue' has a wrong offset!");

// Function AthenaCustomizationPicker.AthenaCustomizationPicker_C.On Text Committed
// 0x0020 (0x0020 - 0x0000)
struct AthenaCustomizationPicker_C_On_Text_Committed final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCustomizationPicker_C_On_Text_Committed) == 0x000008, "Wrong alignment on AthenaCustomizationPicker_C_On_Text_Committed");
static_assert(sizeof(AthenaCustomizationPicker_C_On_Text_Committed) == 0x000020, "Wrong size on AthenaCustomizationPicker_C_On_Text_Committed");
static_assert(offsetof(AthenaCustomizationPicker_C_On_Text_Committed, Text) == 0x000000, "Member 'AthenaCustomizationPicker_C_On_Text_Committed::Text' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_On_Text_Committed, CommitMethod) == 0x000018, "Member 'AthenaCustomizationPicker_C_On_Text_Committed::CommitMethod' has a wrong offset!");

// Function AthenaCustomizationPicker.AthenaCustomizationPicker_C.OnInputMethodChanged
// 0x0030 (0x0030 - 0x0000)
struct AthenaCustomizationPicker_C_OnInputMethodChanged final
{
public:
	ECommonInputType                              NewInputType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCommonButtonStyle>         Temp_class_Variable;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCommonButtonStyle>         Temp_class_Variable_1;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCommonButtonStyle>         Temp_class_Variable_2;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCommonButtonStyle>         Temp_class_Variable_3;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCommonButtonStyle>         K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCustomizationPicker_C_OnInputMethodChanged) == 0x000008, "Wrong alignment on AthenaCustomizationPicker_C_OnInputMethodChanged");
static_assert(sizeof(AthenaCustomizationPicker_C_OnInputMethodChanged) == 0x000030, "Wrong size on AthenaCustomizationPicker_C_OnInputMethodChanged");
static_assert(offsetof(AthenaCustomizationPicker_C_OnInputMethodChanged, NewInputType) == 0x000000, "Member 'AthenaCustomizationPicker_C_OnInputMethodChanged::NewInputType' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_OnInputMethodChanged, Temp_byte_Variable) == 0x000001, "Member 'AthenaCustomizationPicker_C_OnInputMethodChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_OnInputMethodChanged, Temp_class_Variable) == 0x000008, "Member 'AthenaCustomizationPicker_C_OnInputMethodChanged::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_OnInputMethodChanged, Temp_class_Variable_1) == 0x000010, "Member 'AthenaCustomizationPicker_C_OnInputMethodChanged::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_OnInputMethodChanged, Temp_class_Variable_2) == 0x000018, "Member 'AthenaCustomizationPicker_C_OnInputMethodChanged::Temp_class_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_OnInputMethodChanged, Temp_class_Variable_3) == 0x000020, "Member 'AthenaCustomizationPicker_C_OnInputMethodChanged::Temp_class_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_OnInputMethodChanged, K2Node_Select_Default) == 0x000028, "Member 'AthenaCustomizationPicker_C_OnInputMethodChanged::K2Node_Select_Default' has a wrong offset!");

// Function AthenaCustomizationPicker.AthenaCustomizationPicker_C.OnNoItemsAvailableInFilter
// 0x0018 (0x0018 - 0x0000)
struct AthenaCustomizationPicker_C_OnNoItemsAvailableInFilter final
{
public:
	class FText                                   EmptyDisplayText;                                  // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaCustomizationPicker_C_OnNoItemsAvailableInFilter) == 0x000008, "Wrong alignment on AthenaCustomizationPicker_C_OnNoItemsAvailableInFilter");
static_assert(sizeof(AthenaCustomizationPicker_C_OnNoItemsAvailableInFilter) == 0x000018, "Wrong size on AthenaCustomizationPicker_C_OnNoItemsAvailableInFilter");
static_assert(offsetof(AthenaCustomizationPicker_C_OnNoItemsAvailableInFilter, EmptyDisplayText) == 0x000000, "Member 'AthenaCustomizationPicker_C_OnNoItemsAvailableInFilter::EmptyDisplayText' has a wrong offset!");

// Function AthenaCustomizationPicker.AthenaCustomizationPicker_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct AthenaCustomizationPicker_C_OnRemovedFromFocusPath final
{
public:
