#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMatchmakingPlayButton

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaMatchmakingPlayButton.AthenaMatchmakingPlayButton_C
// 0x0040 (0x1050 - 0x1010)
class UAthenaMatchmakingPlayButton_C final : public UAthenaMatchmakingPlayButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1010(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Disabled;                                          // 0x1018(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PlayShine;                                         // 0x1020(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHovered;                                         // 0x1028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       CenterButtonTextWidget;                            // 0x1030(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ButtonTop;                                   // 0x1038(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Shadow;                                      // 0x1040(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMatchmakingInputIndicator_C*           MatchmakingInputIndicator;                         // 0x1048(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_AthenaMatchmakingPlayButton(int32 EntryPoint);
	void SetButtonText(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaMatchmakingPlayButton_C">();
	}
	static class UAthenaMatchmakingPlayButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMatchmakingPlayButton_C>();
	}
};
static_assert(alignof(UAthenaMatchmakingPlayButton_C) == 0x000010, "Wrong alignment on UAthenaMatchmakingPlayButton_C");
static_assert(sizeof(UAthenaMatchmakingPlayButton_C) == 0x001050, "Wrong size on UAthenaMatchmakingPlayButton_C");
static_assert(offsetof(UAthenaMatchmakingPlayButton_C, UberGraphFrame) == 0x001010, "Member 'UAthenaMatchmakingPlayButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayButton_C, Disabled) == 0x001018, "Member 'UAthenaMatchmakingPlayButton_C::Disabled' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayButton_C, PlayShine) == 0x001020, "Member 'UAthenaMatchmakingPlayButton_C::PlayShine' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayButton_C, OnHovered) == 0x001028, "Member 'UAthenaMatchmakingPlayButton_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayButton_C, CenterButtonTextWidget) == 0x001030, "Member 'UAthenaMatchmakingPlayButton_C::CenterButtonTextWidget' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayButton_C, Image_ButtonTop) == 0x001038, "Member 'UAthenaMatchmakingPlayButton_C::Image_ButtonTop' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayButton_C, Image_Shadow) == 0x001040, "Member 'UAthenaMatchmakingPlayButton_C::Image_Shadow' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayButton_C, MatchmakingInputIndicator) == 0x001048, "Member 'UAthenaMatchmakingPlayButton_C::MatchmakingInputIndicator' has a wrong offset!");

}

