#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Athena_Galileo_Lobster_Parent

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Athena_Galileo_Lobster_Parent.B_Athena_Galileo_Lobster_Parent_C
// 0x01D0 (0x1150 - 0x0F80)
class AB_Athena_Galileo_Lobster_Parent_C final : public AFortWeapon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_IdleFX;                                         // 0x0F88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_AnimTrail;                                      // 0x0F90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Galileo_Lobster_Blade_Masked_VisibleUnderwater_; // 0x0F98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Galileo_Lobster_Blade;                          // 0x0FA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        IdleAudio;                                         // 0x0FA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0FB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_Activation_A485AC534A744AA4695BBF8F84A8850F; // 0x0FB8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_A485AC534A744AA4695BBF8F84A8850F; // 0x0FBC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FBD[0x3];                                      // 0x0FBD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0FC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        PlayerCharacter;                                   // 0x0FC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BladeVisibility;                                   // 0x0FD0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FD1[0x7];                                      // 0x0FD1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     ImpactDecal;                                       // 0x0FD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpactTipLocation;                                 // 0x0FE0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SlashImpactColor;                                  // 0x0FF8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               MeleeImpact;                                       // 0x1010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             OpenSound;                                         // 0x1018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             CloseSound;                                        // 0x1020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BladeHueColorShift;                                // 0x1028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BladeRedBlueSwitch;                                // 0x102C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BladeEmissiveIntensity;                            // 0x1030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1034[0x4];                                     // 0x1034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BlockingImpactColor;                               // 0x1038(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortSkeletalAudioComponent*            SkeletalAudioComponent;                            // 0x1050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  T_MeleeAttackAbility;                              // 0x1058(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  T_HudElementToHide;                                // 0x1078(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           Timer_ShowReticleStatus;                           // 0x1098(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentPoise;                                      // 0x10A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A4[0x4];                                     // 0x10A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           Timer_BlockBreakWarning;                           // 0x10A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  TC_ActionsThatHideBlade;                           // 0x10B0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	TScriptInterface<class ICameraLensEffectInterface> LensEffectInterface_BlockBreakWarning;        // 0x10D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          InstantOn;                                         // 0x10E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10E1[0x7];                                     // 0x10E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             IdleSound;                                         // 0x10E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   IdleFXAttachSocket;                                // 0x10F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAttachmentRule                               IdleFX_Location_Rule;                              // 0x10F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAttachmentRule                               Idle_FX_Rotation_Rule;                             // 0x10F5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAttachmentRule                               Idle_FX_Scale_Rule;                                // 0x10F6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10F7[0x1];                                     // 0x10F7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        Swing_FX_Template;                                 // 0x10F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SwingFXSocket;                                     // 0x1100(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAttachmentRule                               SwingFX_Location_Rule;                             // 0x1104(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAttachmentRule                               Swing_FX_Rotation_Rule;                            // 0x1105(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAttachmentRule                               Swing_FX_Scale_Rule;                               // 0x1106(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseAnimTrails;                                     // 0x1107(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Anim_Trail_Template;                               // 0x1108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UParticleSystem*                        AnimTrailsParticles;                               // 0x1110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   FirstSocketName;                                   // 0x1118(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Second_Socket_Name;                                // 0x111C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Width;                                             // 0x1120(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   OverrideFirstSocketName;                           // 0x1124(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class FName                                   OverrideSecond_Socket_Name;                        // 0x1128(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FLinearColor                           Blade_Color_Hot;                                   // 0x112C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Blade_Color_Cool;                                  // 0x113C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimTrailNotifyBegin(bool bActive);
	void AnimTrailNotifyEnd();
	void Bind_Swing_and_Anim_Trail_Events();
	void BlockBreak();
	void CreateSkeletalAudioComp(class UFortSkeletalAudioComponent** Component);
	void CurrentPoiseChanged(float CurrentPoise_0);
	void DeactivateBlockBreakWarning();
	void DoBulletBlockEffect(const struct FVector& ImpactLocation);
	void ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent(int32 EntryPoint);
	void Holstered();
	void InstantOnFX();
	void K2_OnUnEquip();
	void OnPlayImpactFX(const struct FHitResult& HitResult, EPhysicalSurface ImpactPhysicalSurface, class UFXSystemComponent* SpawnedPSC);
	void OnPlayWeaponFireFX(bool bPersistentFire, bool bSecondaryFire);
	void OnRep_BladeVisibility();
	void OnWeaponAttached();
	void OnWeaponDetached();
	void OnWeaponVisibilityChanged(bool bVisible, bool bSetForLocalControllerOnly);
	void ReceiveBeginPlay();
	void ReticleStatusDisplay(bool Hide);
	void RPCUnequip();
	void SetBladeVisibility(bool Visible);
	void ShowReticleStatusDisplay();
	void Spawn_Impact_Particle_Effects(const struct FRotator& Rotation_from_Tip, const struct FVector& ImpactPoint, class AActor* Hit_Actor, const struct FVector& Trace_Start);
	void StartIdleFX();
	void Timeline_1__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void ToggleDodgePrompt(bool Visible);
	void ToggleDynamicAudio(bool CanPlayIdleAudio);
	void TurnOnLobster();
	void UnbindSwingAndAnimTrailEvents();
	void Unholstered();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Athena_Galileo_Lobster_Parent_C">();
	}
	static class AB_Athena_Galileo_Lobster_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Athena_Galileo_Lobster_Parent_C>();
	}
};
static_assert(alignof(AB_Athena_Galileo_Lobster_Parent_C) == 0x000008, "Wrong alignment on AB_Athena_Galileo_Lobster_Parent_C");
static_assert(sizeof(AB_Athena_Galileo_Lobster_Parent_C) == 0x001150, "Wrong size on AB_Athena_Galileo_Lobster_Parent_C");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, UberGraphFrame) == 0x000F80, "Member 'AB_Athena_Galileo_Lobster_Parent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, NS_IdleFX) == 0x000F88, "Member 'AB_Athena_Galileo_Lobster_Parent_C::NS_IdleFX' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, NS_AnimTrail) == 0x000F90, "Member 'AB_Athena_Galileo_Lobster_Parent_C::NS_AnimTrail' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, SM_Galileo_Lobster_Blade_Masked_VisibleUnderwater_) == 0x000F98, "Member 'AB_Athena_Galileo_Lobster_Parent_C::SM_Galileo_Lobster_Blade_Masked_VisibleUnderwater_' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, SM_Galileo_Lobster_Blade) == 0x000FA0, "Member 'AB_Athena_Galileo_Lobster_Parent_C::SM_Galileo_Lobster_Blade' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, IdleAudio) == 0x000FA8, "Member 'AB_Athena_Galileo_Lobster_Parent_C::IdleAudio' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, Scene) == 0x000FB0, "Member 'AB_Athena_Galileo_Lobster_Parent_C::Scene' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, Timeline_1_Activation_A485AC534A744AA4695BBF8F84A8850F) == 0x000FB8, "Member 'AB_Athena_Galileo_Lobster_Parent_C::Timeline_1_Activation_A485AC534A744AA4695BBF8F84A8850F' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, Timeline_1__Direction_A485AC534A744AA4695BBF8F84A8850F) == 0x000FBC, "Member 'AB_Athena_Galileo_Lobster_Parent_C::Timeline_1__Direction_A485AC534A744AA4695BBF8F84A8850F' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, Timeline_1) == 0x000FC0, "Member 'AB_Athena_Galileo_Lobster_Parent_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, PlayerCharacter) == 0x000FC8, "Member 'AB_Athena_Galileo_Lobster_Parent_C::PlayerCharacter' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, BladeVisibility) == 0x000FD0, "Member 'AB_Athena_Galileo_Lobster_Parent_C::BladeVisibility' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, ImpactDecal) == 0x000FD8, "Member 'AB_Athena_Galileo_Lobster_Parent_C::ImpactDecal' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, ImpactTipLocation) == 0x000FE0, "Member 'AB_Athena_Galileo_Lobster_Parent_C::ImpactTipLocation' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, SlashImpactColor) == 0x000FF8, "Member 'AB_Athena_Galileo_Lobster_Parent_C::SlashImpactColor' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, MeleeImpact) == 0x001010, "Member 'AB_Athena_Galileo_Lobster_Parent_C::MeleeImpact' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, OpenSound) == 0x001018, "Member 'AB_Athena_Galileo_Lobster_Parent_C::OpenSound' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, CloseSound) == 0x001020, "Member 'AB_Athena_Galileo_Lobster_Parent_C::CloseSound' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, BladeHueColorShift) == 0x001028, "Member 'AB_Athena_Galileo_Lobster_Parent_C::BladeHueColorShift' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, BladeRedBlueSwitch) == 0x00102C, "Member 'AB_Athena_Galileo_Lobster_Parent_C::BladeRedBlueSwitch' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, BladeEmissiveIntensity) == 0x001030, "Member 'AB_Athena_Galileo_Lobster_Parent_C::BladeEmissiveIntensity' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, BlockingImpactColor) == 0x001038, "Member 'AB_Athena_Galileo_Lobster_Parent_C::BlockingImpactColor' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, SkeletalAudioComponent) == 0x001050, "Member 'AB_Athena_Galileo_Lobster_Parent_C::SkeletalAudioComponent' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, T_MeleeAttackAbility) == 0x001058, "Member 'AB_Athena_Galileo_Lobster_Parent_C::T_MeleeAttackAbility' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, T_HudElementToHide) == 0x001078, "Member 'AB_Athena_Galileo_Lobster_Parent_C::T_HudElementToHide' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, Timer_ShowReticleStatus) == 0x001098, "Member 'AB_Athena_Galileo_Lobster_Parent_C::Timer_ShowReticleStatus' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, CurrentPoise) == 0x0010A0, "Member 'AB_Athena_Galileo_Lobster_Parent_C::CurrentPoise' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, Timer_BlockBreakWarning) == 0x0010A8, "Member 'AB_Athena_Galileo_Lobster_Parent_C::Timer_BlockBreakWarning' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, TC_ActionsThatHideBlade) == 0x0010B0, "Member 'AB_Athena_Galileo_Lobster_Parent_C::TC_ActionsThatHideBlade' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, LensEffectInterface_BlockBreakWarning) == 0x0010D0, "Member 'AB_Athena_Galileo_Lobster_Parent_C::LensEffectInterface_BlockBreakWarning' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, InstantOn) == 0x0010E0, "Member 'AB_Athena_Galileo_Lobster_Parent_C::InstantOn' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, IdleSound) == 0x0010E8, "Member 'AB_Athena_Galileo_Lobster_Parent_C::IdleSound' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, IdleFXAttachSocket) == 0x0010F0, "Member 'AB_Athena_Galileo_Lobster_Parent_C::IdleFXAttachSocket' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, IdleFX_Location_Rule) == 0x0010F4, "Member 'AB_Athena_Galileo_Lobster_Parent_C::IdleFX_Location_Rule' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, Idle_FX_Rotation_Rule) == 0x0010F5, "Member 'AB_Athena_Galileo_Lobster_Parent_C::Idle_FX_Rotation_Rule' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, Idle_FX_Scale_Rule) == 0x0010F6, "Member 'AB_Athena_Galileo_Lobster_Parent_C::Idle_FX_Scale_Rule' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, Swing_FX_Template) == 0x0010F8, "Member 'AB_Athena_Galileo_Lobster_Parent_C::Swing_FX_Template' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, SwingFXSocket) == 0x001100, "Member 'AB_Athena_Galileo_Lobster_Parent_C::SwingFXSocket' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, SwingFX_Location_Rule) == 0x001104, "Member 'AB_Athena_Galileo_Lobster_Parent_C::SwingFX_Location_Rule' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, Swing_FX_Rotation_Rule) == 0x001105, "Member 'AB_Athena_Galileo_Lobster_Parent_C::Swing_FX_Rotation_Rule' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, Swing_FX_Scale_Rule) == 0x001106, "Member 'AB_Athena_Galileo_Lobster_Parent_C::Swing_FX_Scale_Rule' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, UseAnimTrails) == 0x001107, "Member 'AB_Athena_Galileo_Lobster_Parent_C::UseAnimTrails' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, Anim_Trail_Template) == 0x001108, "Member 'AB_Athena_Galileo_Lobster_Parent_C::Anim_Trail_Template' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, AnimTrailsParticles) == 0x001110, "Member 'AB_Athena_Galileo_Lobster_Parent_C::AnimTrailsParticles' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, FirstSocketName) == 0x001118, "Member 'AB_Athena_Galileo_Lobster_Parent_C::FirstSocketName' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, Second_Socket_Name) == 0x00111C, "Member 'AB_Athena_Galileo_Lobster_Parent_C::Second_Socket_Name' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, Width) == 0x001120, "Member 'AB_Athena_Galileo_Lobster_Parent_C::Width' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, OverrideFirstSocketName) == 0x001124, "Member 'AB_Athena_Galileo_Lobster_Parent_C::OverrideFirstSocketName' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, OverrideSecond_Socket_Name) == 0x001128, "Member 'AB_Athena_Galileo_Lobster_Parent_C::OverrideSecond_Socket_Name' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, Blade_Color_Hot) == 0x00112C, "Member 'AB_Athena_Galileo_Lobster_Parent_C::Blade_Color_Hot' has a wrong offset!");
static_assert(offsetof(AB_Athena_Galileo_Lobster_Parent_C, Blade_Color_Cool) == 0x00113C, "Member 'AB_Athena_Galileo_Lobster_Parent_C::Blade_Color_Cool' has a wrong offset!");

}

