#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Laser_Armadillo_Upgraded

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK::Params
{

// Function B_Laser_Armadillo_Upgraded.B_Laser_Armadillo_Upgraded_C.ExecuteUbergraph_B_Laser_Armadillo_Upgraded
// 0x01A0 (0x01A0 - 0x0000)
struct B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetPlayerPawn_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         CallFunc_SetBeamNiagaraSystem_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         CallFunc_SetBeamNiagaraSystem_ReturnValue_1;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetInstigatorController_ReturnValue;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayerController_ReturnValue;      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_HitResult;                            // 0x0058(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	EPhysicalSurface                              K2Node_Event_ImpactPhysicalSurface;                // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     K2Node_Event_SpawnedPSC;                           // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float CurrentValue, float MaxValue, EFortWeaponOverheatState State, bool bIsInCooldown)> K2Node_CreateDelegate_OutputDelegate; // 0x0148(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPersistentFire;                      // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSecondaryFire;                       // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_156[0x2];                                      // 0x0156(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_1;              // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue_1; // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default_1;                           // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded) == 0x000008, "Wrong alignment on B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded");
static_assert(sizeof(B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded) == 0x0001A0, "Wrong size on B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded, EntryPoint) == 0x000000, "Member 'B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded, CallFunc_GetFirstLocalFortPlayerController_ReturnValue) == 0x000008, "Member 'B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded::CallFunc_GetFirstLocalFortPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded, CallFunc_GetInstigator_ReturnValue) == 0x000010, "Member 'B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded, CallFunc_GetPlayerPawn_ReturnValue) == 0x000020, "Member 'B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000028, "Member 'B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded, CallFunc_IsDedicatedServer_ReturnValue) == 0x000029, "Member 'B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded, Temp_bool_Variable) == 0x00002A, "Member 'B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded, K2Node_Select_Default) == 0x000030, "Member 'B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded, CallFunc_SetBeamNiagaraSystem_ReturnValue) == 0x000038, "Member 'B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded::CallFunc_SetBeamNiagaraSystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded, CallFunc_SetBeamNiagaraSystem_ReturnValue_1) == 0x000040, "Member 'B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded::CallFunc_SetBeamNiagaraSystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded, CallFunc_GetInstigatorController_ReturnValue) == 0x000048, "Member 'B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded::CallFunc_GetInstigatorController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded, CallFunc_IsLocalPlayerController_ReturnValue) == 0x000051, "Member 'B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded::CallFunc_IsLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded, K2Node_Event_HitResult) == 0x000058, "Member 'B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded::K2Node_Event_HitResult' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded, K2Node_Event_ImpactPhysicalSurface) == 0x000138, "Member 'B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded::K2Node_Event_ImpactPhysicalSurface' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded, K2Node_Event_SpawnedPSC) == 0x000140, "Member 'B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded::K2Node_Event_SpawnedPSC' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded, K2Node_CreateDelegate_OutputDelegate) == 0x000148, "Member 'B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded, K2Node_Event_bPersistentFire) == 0x000154, "Member 'B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded::K2Node_Event_bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded, K2Node_Event_bSecondaryFire) == 0x000155, "Member 'B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded::K2Node_Event_bSecondaryFire' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded, CallFunc_GetInstigator_ReturnValue_1) == 0x000158, "Member 'B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded::CallFunc_GetInstigator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000160, "Member 'B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded, Temp_bool_Variable_1) == 0x000168, "Member 'B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded, CallFunc_GetFirstLocalFortPlayerController_ReturnValue_1) == 0x000170, "Member 'B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded::CallFunc_GetFirstLocalFortPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded, CallFunc_IsValid_ReturnValue_2) == 0x000178, "Member 'B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x000180, "Member 'B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000188, "Member 'B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded, K2Node_Select_Default_1) == 0x000190, "Member 'B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000198, "Member 'B_Laser_Armadillo_Upgraded_C_ExecuteUbergraph_B_Laser_Armadillo_Upgraded::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");

// Function B_Laser_Armadillo_Upgraded.B_Laser_Armadillo_Upgraded_C.On Overheating Value
// 0x0038 (0x0038 - 0x0000)
struct B_Laser_Armadillo_Upgraded_C_On_Overheating_Value final
{
public:
	float                                         CurrentValue;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxValue;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortWeaponOverheatState                      State;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInCooldown;                                     // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetPlayerPawn_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Laser_Armadillo_Upgraded_C_On_Overheating_Value) == 0x000008, "Wrong alignment on B_Laser_Armadillo_Upgraded_C_On_Overheating_Value");
static_assert(sizeof(B_Laser_Armadillo_Upgraded_C_On_Overheating_Value) == 0x000038, "Wrong size on B_Laser_Armadillo_Upgraded_C_On_Overheating_Value");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_On_Overheating_Value, CurrentValue) == 0x000000, "Member 'B_Laser_Armadillo_Upgraded_C_On_Overheating_Value::CurrentValue' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_On_Overheating_Value, MaxValue) == 0x000004, "Member 'B_Laser_Armadillo_Upgraded_C_On_Overheating_Value::MaxValue' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_On_Overheating_Value, State) == 0x000008, "Member 'B_Laser_Armadillo_Upgraded_C_On_Overheating_Value::State' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_On_Overheating_Value, bIsInCooldown) == 0x000009, "Member 'B_Laser_Armadillo_Upgraded_C_On_Overheating_Value::bIsInCooldown' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_On_Overheating_Value, K2Node_SwitchEnum_CmpSuccess) == 0x00000A, "Member 'B_Laser_Armadillo_Upgraded_C_On_Overheating_Value::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_On_Overheating_Value, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00000C, "Member 'B_Laser_Armadillo_Upgraded_C_On_Overheating_Value::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_On_Overheating_Value, CallFunc_SelectFloat_ReturnValue) == 0x000010, "Member 'B_Laser_Armadillo_Upgraded_C_On_Overheating_Value::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_On_Overheating_Value, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'B_Laser_Armadillo_Upgraded_C_On_Overheating_Value::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_On_Overheating_Value, CallFunc_GetInstigator_ReturnValue) == 0x000018, "Member 'B_Laser_Armadillo_Upgraded_C_On_Overheating_Value::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_On_Overheating_Value, CallFunc_GetFirstLocalFortPlayerController_ReturnValue) == 0x000020, "Member 'B_Laser_Armadillo_Upgraded_C_On_Overheating_Value::CallFunc_GetFirstLocalFortPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_On_Overheating_Value, CallFunc_GetPlayerPawn_ReturnValue) == 0x000028, "Member 'B_Laser_Armadillo_Upgraded_C_On_Overheating_Value::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_On_Overheating_Value, CallFunc_IsValid_ReturnValue_1) == 0x000030, "Member 'B_Laser_Armadillo_Upgraded_C_On_Overheating_Value::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_On_Overheating_Value, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000031, "Member 'B_Laser_Armadillo_Upgraded_C_On_Overheating_Value::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function B_Laser_Armadillo_Upgraded.B_Laser_Armadillo_Upgraded_C.OnPlayImpactFX
// 0x00F0 (0x00F0 - 0x0000)
struct B_Laser_Armadillo_Upgraded_C_OnPlayImpactFX final
{
public:
	struct FHitResult                             HitResult;                                         // 0x0000(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	EPhysicalSurface                              ImpactPhysicalSurface;                             // 0x00E0(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     SpawnedPSC;                                        // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Laser_Armadillo_Upgraded_C_OnPlayImpactFX) == 0x000008, "Wrong alignment on B_Laser_Armadillo_Upgraded_C_OnPlayImpactFX");
static_assert(sizeof(B_Laser_Armadillo_Upgraded_C_OnPlayImpactFX) == 0x0000F0, "Wrong size on B_Laser_Armadillo_Upgraded_C_OnPlayImpactFX");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_OnPlayImpactFX, HitResult) == 0x000000, "Member 'B_Laser_Armadillo_Upgraded_C_OnPlayImpactFX::HitResult' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_OnPlayImpactFX, ImpactPhysicalSurface) == 0x0000E0, "Member 'B_Laser_Armadillo_Upgraded_C_OnPlayImpactFX::ImpactPhysicalSurface' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_OnPlayImpactFX, SpawnedPSC) == 0x0000E8, "Member 'B_Laser_Armadillo_Upgraded_C_OnPlayImpactFX::SpawnedPSC' has a wrong offset!");

// Function B_Laser_Armadillo_Upgraded.B_Laser_Armadillo_Upgraded_C.OnPlayWeaponFireFX
// 0x0002 (0x0002 - 0x0000)
struct B_Laser_Armadillo_Upgraded_C_OnPlayWeaponFireFX final
{
public:
	bool                                          bPersistentFire;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSecondaryFire;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Laser_Armadillo_Upgraded_C_OnPlayWeaponFireFX) == 0x000001, "Wrong alignment on B_Laser_Armadillo_Upgraded_C_OnPlayWeaponFireFX");
static_assert(sizeof(B_Laser_Armadillo_Upgraded_C_OnPlayWeaponFireFX) == 0x000002, "Wrong size on B_Laser_Armadillo_Upgraded_C_OnPlayWeaponFireFX");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_OnPlayWeaponFireFX, bPersistentFire) == 0x000000, "Member 'B_Laser_Armadillo_Upgraded_C_OnPlayWeaponFireFX::bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_Laser_Armadillo_Upgraded_C_OnPlayWeaponFireFX, bSecondaryFire) == 0x000001, "Member 'B_Laser_Armadillo_Upgraded_C_OnPlayWeaponFireFX::bSecondaryFire' has a wrong offset!");

}

