#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BacchusItemShopNavigationButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BacchusItemShopNavigationButton.BacchusItemShopNavigationButton_C
// 0x0050 (0x1050 - 0x1000)
class UBacchusItemShopNavigationButton_C final : public UAthenaItemShopNavigationButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1000(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutBacking;                                    // 0x1008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Translate_Bottom;                                  // 0x1010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Translate_Top;                                     // 0x1018(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       InitialState;                                      // 0x1020(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Backing;                                           // 0x1028(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BorderButton;                                      // 0x1030(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                GridBoundBorder;                                   // 0x1038(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Arrow;                                         // 0x1040(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bFlipArrow;                                        // 0x1048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bIsTop;                                            // 0x1049(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_BacchusItemShopNavigationButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BacchusItemShopNavigationButton_C">();
	}
	static class UBacchusItemShopNavigationButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBacchusItemShopNavigationButton_C>();
	}
};
static_assert(alignof(UBacchusItemShopNavigationButton_C) == 0x000010, "Wrong alignment on UBacchusItemShopNavigationButton_C");
static_assert(sizeof(UBacchusItemShopNavigationButton_C) == 0x001050, "Wrong size on UBacchusItemShopNavigationButton_C");
static_assert(offsetof(UBacchusItemShopNavigationButton_C, UberGraphFrame) == 0x001000, "Member 'UBacchusItemShopNavigationButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopNavigationButton_C, FadeOutBacking) == 0x001008, "Member 'UBacchusItemShopNavigationButton_C::FadeOutBacking' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopNavigationButton_C, Translate_Bottom) == 0x001010, "Member 'UBacchusItemShopNavigationButton_C::Translate_Bottom' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopNavigationButton_C, Translate_Top) == 0x001018, "Member 'UBacchusItemShopNavigationButton_C::Translate_Top' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopNavigationButton_C, InitialState) == 0x001020, "Member 'UBacchusItemShopNavigationButton_C::InitialState' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopNavigationButton_C, Backing) == 0x001028, "Member 'UBacchusItemShopNavigationButton_C::Backing' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopNavigationButton_C, BorderButton) == 0x001030, "Member 'UBacchusItemShopNavigationButton_C::BorderButton' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopNavigationButton_C, GridBoundBorder) == 0x001038, "Member 'UBacchusItemShopNavigationButton_C::GridBoundBorder' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopNavigationButton_C, IMG_Arrow) == 0x001040, "Member 'UBacchusItemShopNavigationButton_C::IMG_Arrow' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopNavigationButton_C, bFlipArrow) == 0x001048, "Member 'UBacchusItemShopNavigationButton_C::bFlipArrow' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopNavigationButton_C, bIsTop) == 0x001049, "Member 'UBacchusItemShopNavigationButton_C::bIsTop' has a wrong offset!");

}

