#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BacchusItemShopCreatorButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BacchusItemShopCreatorButton.BacchusItemShopCreatorButton_C
// 0x0030 (0x10B0 - 0x1080)
class UBacchusItemShopCreatorButton_C final : public UFortTextButton
{
public:
	uint8                                         Pad_1078[0x8];                                     // 0x1078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1080(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x1088(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Backing;                                           // 0x1090(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Arrow;                                         // 0x1098(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bFlipArrow;                                        // 0x10A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bIsTop;                                            // 0x10A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_BacchusItemShopCreatorButton(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BacchusItemShopCreatorButton_C">();
	}
	static class UBacchusItemShopCreatorButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBacchusItemShopCreatorButton_C>();
	}
};
static_assert(alignof(UBacchusItemShopCreatorButton_C) == 0x000010, "Wrong alignment on UBacchusItemShopCreatorButton_C");
static_assert(sizeof(UBacchusItemShopCreatorButton_C) == 0x0010B0, "Wrong size on UBacchusItemShopCreatorButton_C");
static_assert(offsetof(UBacchusItemShopCreatorButton_C, UberGraphFrame) == 0x001080, "Member 'UBacchusItemShopCreatorButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopCreatorButton_C, Hover) == 0x001088, "Member 'UBacchusItemShopCreatorButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopCreatorButton_C, Backing) == 0x001090, "Member 'UBacchusItemShopCreatorButton_C::Backing' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopCreatorButton_C, IMG_Arrow) == 0x001098, "Member 'UBacchusItemShopCreatorButton_C::IMG_Arrow' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopCreatorButton_C, bFlipArrow) == 0x0010A0, "Member 'UBacchusItemShopCreatorButton_C::bFlipArrow' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopCreatorButton_C, bIsTop) == 0x0010A1, "Member 'UBacchusItemShopCreatorButton_C::bIsTop' has a wrong offset!");

}

