#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BackButtonSmall

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BackButtonSmall.BackButtonSmall_C
// 0x0020 (0x0FC0 - 0x0FA0)
class UBackButtonSmall_C final : public UCommonButtonBase
{
public:
	uint8                                         Pad_F98[0x8];                                      // 0x0F98(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0FA0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonActionWidget*                    CommonActionWidget_65;                             // 0x0FA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_3;                                   // 0x0FB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       Image_Arrow;                                       // 0x0FB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BackButtonSmall(int32 EntryPoint);
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BackButtonSmall_C">();
	}
	static class UBackButtonSmall_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBackButtonSmall_C>();
	}
};
static_assert(alignof(UBackButtonSmall_C) == 0x000010, "Wrong alignment on UBackButtonSmall_C");
static_assert(sizeof(UBackButtonSmall_C) == 0x000FC0, "Wrong size on UBackButtonSmall_C");
static_assert(offsetof(UBackButtonSmall_C, UberGraphFrame) == 0x000FA0, "Member 'UBackButtonSmall_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBackButtonSmall_C, CommonActionWidget_65) == 0x000FA8, "Member 'UBackButtonSmall_C::CommonActionWidget_65' has a wrong offset!");
static_assert(offsetof(UBackButtonSmall_C, HorizontalBox_3) == 0x000FB0, "Member 'UBackButtonSmall_C::HorizontalBox_3' has a wrong offset!");
static_assert(offsetof(UBackButtonSmall_C, Image_Arrow) == 0x000FB8, "Member 'UBackButtonSmall_C::Image_Arrow' has a wrong offset!");

}

