#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePassS20UI

#include "Basic.hpp"

#include "BattlePassBase_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonInput_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// Class BattlePassS20UI.FortBattlePassTutorialTooltipS20
// 0x0010 (0x02B0 - 0x02A0)
class UFortBattlePassTutorialTooltipS20 : public UCommonUserWidget
{
public:
	class UCommonRichTextBlock*                   Text_Tooltip;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A8[0x8];                                      // 0x02A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HideTooltip();
	void SetText(const class FText& Text);
	void ShowTooltip();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBattlePassTutorialTooltipS20">();
	}
	static class UFortBattlePassTutorialTooltipS20* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassTutorialTooltipS20>();
	}
};
static_assert(alignof(UFortBattlePassTutorialTooltipS20) == 0x000008, "Wrong alignment on UFortBattlePassTutorialTooltipS20");
static_assert(sizeof(UFortBattlePassTutorialTooltipS20) == 0x0002B0, "Wrong size on UFortBattlePassTutorialTooltipS20");
static_assert(offsetof(UFortBattlePassTutorialTooltipS20, Text_Tooltip) == 0x0002A0, "Member 'UFortBattlePassTutorialTooltipS20::Text_Tooltip' has a wrong offset!");

// Class BattlePassS20UI.BattlePassLandingPageS20
// 0x0050 (0x0530 - 0x04E0)
class UBattlePassLandingPageS20 : public UBattlePassLandingPageBase
{
public:
	class UBattlePassLandingPageButton*           Button_Rewards;                                    // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBattlePassLandingPageButton*           Button_CharacterCustomizer;                        // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBattlePassLandingPageButton*           Button_BonusRewards;                               // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBattlePassLandingPageButton*           Button_Quests;                                     // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBattlePassLandingPageButton*           Button_BuyBattlePass;                              // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBattlePassLandingPageButton*           Button_JoinSubscription;                           // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBattlePassLandingPageButton*           Button_BuyResources;                               // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBattlePassLandingPageButton*           Button_GiftBattlePass;                             // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_520[0x8];                                      // 0x0520(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaSeasonItemData_BattleStar*       SeasonData_BattleStar;                             // 0x0528(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnBattlePassGiftingAllowed(const bool bGiftingAllowed);
	void OnBattlePassOwned();
	void OnBattlePassSubscriptionAllowed(const bool bSubscriptionAllowed);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BattlePassLandingPageS20">();
	}
	static class UBattlePassLandingPageS20* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassLandingPageS20>();
	}
};
static_assert(alignof(UBattlePassLandingPageS20) == 0x000008, "Wrong alignment on UBattlePassLandingPageS20");
static_assert(sizeof(UBattlePassLandingPageS20) == 0x000530, "Wrong size on UBattlePassLandingPageS20");
static_assert(offsetof(UBattlePassLandingPageS20, Button_Rewards) == 0x0004E0, "Member 'UBattlePassLandingPageS20::Button_Rewards' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageS20, Button_CharacterCustomizer) == 0x0004E8, "Member 'UBattlePassLandingPageS20::Button_CharacterCustomizer' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageS20, Button_BonusRewards) == 0x0004F0, "Member 'UBattlePassLandingPageS20::Button_BonusRewards' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageS20, Button_Quests) == 0x0004F8, "Member 'UBattlePassLandingPageS20::Button_Quests' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageS20, Button_BuyBattlePass) == 0x000500, "Member 'UBattlePassLandingPageS20::Button_BuyBattlePass' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageS20, Button_JoinSubscription) == 0x000508, "Member 'UBattlePassLandingPageS20::Button_JoinSubscription' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageS20, Button_BuyResources) == 0x000510, "Member 'UBattlePassLandingPageS20::Button_BuyResources' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageS20, Button_GiftBattlePass) == 0x000518, "Member 'UBattlePassLandingPageS20::Button_GiftBattlePass' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageS20, SeasonData_BattleStar) == 0x000528, "Member 'UBattlePassLandingPageS20::SeasonData_BattleStar' has a wrong offset!");

// Class BattlePassS20UI.BattlePassRewardPageS20
// 0x0098 (0x0548 - 0x04B0)
class UBattlePassRewardPageS20 : public UBattlePassRewardPageBase
{
public:
	TSubclassOf<class UFortBattlePassRewardGrid>  RewardsGridClass;                                  // 0x04B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortPageNavigator*                     PageNavigator;                                     // 0x04B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBattlePassTile*                    FocusedReward;                                     // 0x04C0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UFortBattlePassRewardGrid*>      GridPages;                                         // 0x04C8(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4D8[0x4];                                      // 0x04D8(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	ERewardPageType                               RewardPageType;                                    // 0x04DC(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4DD[0x3];                                      // 0x04DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HoldTileTooltip_ClaimedRewardsToHide;              // 0x04E0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         HoldTileTooltip_RequiredBattleStarsToShow;         // 0x04E4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 ClaimToonAFishTooltip_ClaimCheckTemplateId;        // 0x04E8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortBattlePassTutorialTooltipS20*      TutorialTooltip_SecondPageUnlock;                  // 0x04F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBattlePassTutorialTooltipS20*      TutorialTooltip_ClaimAllRewards;                   // 0x0500(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBattlePassTutorialTooltipS20*      TutorialTooltip_HoldTile;                          // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBattlePassTutorialTooltipS20*      TutorialTooltip_Fishtoon_ClaimToonAFish;           // 0x0510(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBattlePassTutorialTooltipS20*      TutorialTooltip_Fishtoon_ExploreToCollectInk;      // 0x0518(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBattlePassTutorialTooltipS20*      TutorialTooltip_Fishtoon_MustUnlockInkColor;       // 0x0520(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBattlePassTutorialTooltipS20*      TutorialTooltip_Fishtoon_MustCompleteObjective;    // 0x0528(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaSeasonItemData_BattleStar*       SeasonData_BattleStar;                             // 0x0530(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBattlePassBulkBuyInputData*            BulkBuyInputData;                                  // 0x0538(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_540[0x8];                                      // 0x0540(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnInitForPageType(const ERewardPageType InRewardPageType);
	void OnInputMethodChanged(const ECommonInputType InputType);
	void OnPageChanged(const int32 PageNumber);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BattlePassRewardPageS20">();
	}
	static class UBattlePassRewardPageS20* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassRewardPageS20>();
	}
};
static_assert(alignof(UBattlePassRewardPageS20) == 0x000008, "Wrong alignment on UBattlePassRewardPageS20");
static_assert(sizeof(UBattlePassRewardPageS20) == 0x000548, "Wrong size on UBattlePassRewardPageS20");
static_assert(offsetof(UBattlePassRewardPageS20, RewardsGridClass) == 0x0004B0, "Member 'UBattlePassRewardPageS20::RewardsGridClass' has a wrong offset!");
static_assert(offsetof(UBattlePassRewardPageS20, PageNavigator) == 0x0004B8, "Member 'UBattlePassRewardPageS20::PageNavigator' has a wrong offset!");
static_assert(offsetof(UBattlePassRewardPageS20, FocusedReward) == 0x0004C0, "Member 'UBattlePassRewardPageS20::FocusedReward' has a wrong offset!");
static_assert(offsetof(UBattlePassRewardPageS20, GridPages) == 0x0004C8, "Member 'UBattlePassRewardPageS20::GridPages' has a wrong offset!");
static_assert(offsetof(UBattlePassRewardPageS20, RewardPageType) == 0x0004DC, "Member 'UBattlePassRewardPageS20::RewardPageType' has a wrong offset!");
static_assert(offsetof(UBattlePassRewardPageS20, HoldTileTooltip_ClaimedRewardsToHide) == 0x0004E0, "Member 'UBattlePassRewardPageS20::HoldTileTooltip_ClaimedRewardsToHide' has a wrong offset!");
static_assert(offsetof(UBattlePassRewardPageS20, HoldTileTooltip_RequiredBattleStarsToShow) == 0x0004E4, "Member 'UBattlePassRewardPageS20::HoldTileTooltip_RequiredBattleStarsToShow' has a wrong offset!");
static_assert(offsetof(UBattlePassRewardPageS20, ClaimToonAFishTooltip_ClaimCheckTemplateId) == 0x0004E8, "Member 'UBattlePassRewardPageS20::ClaimToonAFishTooltip_ClaimCheckTemplateId' has a wrong offset!");
static_assert(offsetof(UBattlePassRewardPageS20, TutorialTooltip_SecondPageUnlock) == 0x0004F8, "Member 'UBattlePassRewardPageS20::TutorialTooltip_SecondPageUnlock' has a wrong offset!");
static_assert(offsetof(UBattlePassRewardPageS20, TutorialTooltip_ClaimAllRewards) == 0x000500, "Member 'UBattlePassRewardPageS20::TutorialTooltip_ClaimAllRewards' has a wrong offset!");
static_assert(offsetof(UBattlePassRewardPageS20, TutorialTooltip_HoldTile) == 0x000508, "Member 'UBattlePassRewardPageS20::TutorialTooltip_HoldTile' has a wrong offset!");
static_assert(offsetof(UBattlePassRewardPageS20, TutorialTooltip_Fishtoon_ClaimToonAFish) == 0x000510, "Member 'UBattlePassRewardPageS20::TutorialTooltip_Fishtoon_ClaimToonAFish' has a wrong offset!");
static_assert(offsetof(UBattlePassRewardPageS20, TutorialTooltip_Fishtoon_ExploreToCollectInk) == 0x000518, "Member 'UBattlePassRewardPageS20::TutorialTooltip_Fishtoon_ExploreToCollectInk' has a wrong offset!");
static_assert(offsetof(UBattlePassRewardPageS20, TutorialTooltip_Fishtoon_MustUnlockInkColor) == 0x000520, "Member 'UBattlePassRewardPageS20::TutorialTooltip_Fishtoon_MustUnlockInkColor' has a wrong offset!");
static_assert(offsetof(UBattlePassRewardPageS20, TutorialTooltip_Fishtoon_MustCompleteObjective) == 0x000528, "Member 'UBattlePassRewardPageS20::TutorialTooltip_Fishtoon_MustCompleteObjective' has a wrong offset!");
static_assert(offsetof(UBattlePassRewardPageS20, SeasonData_BattleStar) == 0x000530, "Member 'UBattlePassRewardPageS20::SeasonData_BattleStar' has a wrong offset!");
static_assert(offsetof(UBattlePassRewardPageS20, BulkBuyInputData) == 0x000538, "Member 'UBattlePassRewardPageS20::BulkBuyInputData' has a wrong offset!");

// Class BattlePassS20UI.BattlePassScreenS20
// 0x03C0 (0x0BF0 - 0x0830)
class UBattlePassScreenS20 : public UBattlePassScreenBase
{
public:
	TSubclassOf<class UFortBattlePassPurchaseResourcesWidget> ResourcePurchaseScreenClass;           // 0x0830(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_838[0x8];                                      // 0x0838(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    Button_Close;                                      // 0x0840(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonLegacy*                    Button_CloseMobile;                                // 0x0848(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_BulkBuyRewards;                             // 0x0850(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonLegacy*                    Button_ToggleViewDetails;                          // 0x0858(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_ToggleViewDetails_Mobile;                   // 0x0860(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonLegacy*                    Button_ReplayTrailer;                              // 0x0868(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_ReplayTrailer_Mobile;                       // 0x0870(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonLegacy*                    Button_ShowAbout;                                  // 0x0878(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_ShowAbout_Mobile;                           // 0x0880(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonLegacy*                    Button_ShowAboutCustomization;                     // 0x0888(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_ShowAboutCustomization_Mobile;              // 0x0890(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonVisibilitySwitcher*              MobileVisibilitySwitcher;                          // 0x0898(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortBattlePassResourcesWidgetBase*     BattlePassCurrencyPanel;                           // 0x08A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaExclusiveRewardBanner*           AthenaExclusiveRewardBanner;                       // 0x08A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_Description;                                  // 0x08B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_ItemName;                                     // 0x08B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaRewardItemTypeRarityTag*         ItemRewardTag;                                     // 0x08C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_SetDetails;                                   // 0x08C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonVisibilitySwitcher*              Switcher_ContextualButtons;                        // 0x08D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortHoldableButton*                    Button_BuyLevels;                                  // 0x08D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortHoldableButton*                    Button_BuyBattlePass;                              // 0x08E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortHoldableButton*                    Button_ClaimReward;                                // 0x08E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBorder*                                Tag_RequiresBP;                                    // 0x08F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBorder*                                Tag_PageLocked;                                    // 0x08F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBorder*                                Tag_BaseItem;                                      // 0x0900(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBorder*                                Tag_Prerequisite;                                  // 0x0908(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBorder*                                Tag_CompletePage;                                  // 0x0910(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBorder*                                Tag_NotEnough_Currency;                            // 0x0918(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBorder*                                Tag_Cost;                                          // 0x0920(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBorder*                                Tag_Owned;                                         // 0x0928(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBorder*                                Tag_Delayed;                                       // 0x0930(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_938[0x58];                                     // 0x0938(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaSeasonItemData_BattleStar*       SeasonData_BattleStar;                             // 0x0990(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaSeasonItemEntryBase*             CurrentSelectedEntry;                              // 0x0998(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<EBattlePassView>                       SwitcherSubPageTypes;                              // 0x09A0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	class UCommonVisibilitySwitcher*              SubPageSwitcher;                                   // 0x09B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9B8[0xC0];                                     // 0x09B8(0x00C0)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    SeasonalBaseCustomizationItem;                     // 0x0A78(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasSubscription;                                  // 0x0A80(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A81[0x3];                                      // 0x0A81(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BattleStarsTooltipHideLevel;                       // 0x0A84(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A88[0x8];                                      // 0x0A88(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortBattlePassTutorialTooltipS20*      TutorialTooltip_BattleStars;                       // 0x0A90(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBattlePassTutorialTooltipS20*      TutorialTooltip_StylePoints;                       // 0x0A98(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA0[0x150];                                    // 0x0AA0(0x0150)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleClaimRewardComplete(const bool bSuccess, const TArray<class FString>& OfferTemplateIdList);
	void HandleSwitcherVisibilityShown();
	void OnBattlePassOwned();
	void OnInsufficientFunds(const EBattlePassCurrencyType CurrencyType);
	void OnInsufficientResource(const class UFortPersistentResourceItemDefinition* PersistentResource);
	void OnItemDelayed(const struct FTimespan& Delay);
	void OnLevelChanged(const int32 Level);
	void OnSetClaimedRewardInfo(const int32 OwnedRewards, const int32 TotalRewards);
	void OnSetDynamicInput(const EBattlePassInputs InputType, const class UBattlePassInputData* InputData);
	void OnSetItemPrice(const int32 Cost, const EBattlePassCurrencyType CurrencyType);
	void OnSetPrerequisiteInfo(const class FText& Description, const int32 OwnedRewards, const int32 NeededRewards, const bool bShowPrerequisiteLock);
	void OnSetResourcePrice(const int32 Cost, const class UFortPersistentResourceItemDefinition* PersistentResource);
	void OnTransitionItemDetails(const bool bTransitionForward);
	void OverviewShowAnimationFinished();

	struct FTimespan GetQuestPageDelay() const;
	bool IsSeasonalCustomizationItemOwned() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BattlePassScreenS20">();
	}
	static class UBattlePassScreenS20* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassScreenS20>();
	}
};
static_assert(alignof(UBattlePassScreenS20) == 0x000008, "Wrong alignment on UBattlePassScreenS20");
static_assert(sizeof(UBattlePassScreenS20) == 0x000BF0, "Wrong size on UBattlePassScreenS20");
static_assert(offsetof(UBattlePassScreenS20, ResourcePurchaseScreenClass) == 0x000830, "Member 'UBattlePassScreenS20::ResourcePurchaseScreenClass' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, Button_Close) == 0x000840, "Member 'UBattlePassScreenS20::Button_Close' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, Button_CloseMobile) == 0x000848, "Member 'UBattlePassScreenS20::Button_CloseMobile' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, Button_BulkBuyRewards) == 0x000850, "Member 'UBattlePassScreenS20::Button_BulkBuyRewards' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, Button_ToggleViewDetails) == 0x000858, "Member 'UBattlePassScreenS20::Button_ToggleViewDetails' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, Button_ToggleViewDetails_Mobile) == 0x000860, "Member 'UBattlePassScreenS20::Button_ToggleViewDetails_Mobile' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, Button_ReplayTrailer) == 0x000868, "Member 'UBattlePassScreenS20::Button_ReplayTrailer' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, Button_ReplayTrailer_Mobile) == 0x000870, "Member 'UBattlePassScreenS20::Button_ReplayTrailer_Mobile' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, Button_ShowAbout) == 0x000878, "Member 'UBattlePassScreenS20::Button_ShowAbout' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, Button_ShowAbout_Mobile) == 0x000880, "Member 'UBattlePassScreenS20::Button_ShowAbout_Mobile' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, Button_ShowAboutCustomization) == 0x000888, "Member 'UBattlePassScreenS20::Button_ShowAboutCustomization' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, Button_ShowAboutCustomization_Mobile) == 0x000890, "Member 'UBattlePassScreenS20::Button_ShowAboutCustomization_Mobile' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, MobileVisibilitySwitcher) == 0x000898, "Member 'UBattlePassScreenS20::MobileVisibilitySwitcher' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, BattlePassCurrencyPanel) == 0x0008A0, "Member 'UBattlePassScreenS20::BattlePassCurrencyPanel' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, AthenaExclusiveRewardBanner) == 0x0008A8, "Member 'UBattlePassScreenS20::AthenaExclusiveRewardBanner' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, Text_Description) == 0x0008B0, "Member 'UBattlePassScreenS20::Text_Description' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, Text_ItemName) == 0x0008B8, "Member 'UBattlePassScreenS20::Text_ItemName' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, ItemRewardTag) == 0x0008C0, "Member 'UBattlePassScreenS20::ItemRewardTag' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, Text_SetDetails) == 0x0008C8, "Member 'UBattlePassScreenS20::Text_SetDetails' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, Switcher_ContextualButtons) == 0x0008D0, "Member 'UBattlePassScreenS20::Switcher_ContextualButtons' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, Button_BuyLevels) == 0x0008D8, "Member 'UBattlePassScreenS20::Button_BuyLevels' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, Button_BuyBattlePass) == 0x0008E0, "Member 'UBattlePassScreenS20::Button_BuyBattlePass' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, Button_ClaimReward) == 0x0008E8, "Member 'UBattlePassScreenS20::Button_ClaimReward' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, Tag_RequiresBP) == 0x0008F0, "Member 'UBattlePassScreenS20::Tag_RequiresBP' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, Tag_PageLocked) == 0x0008F8, "Member 'UBattlePassScreenS20::Tag_PageLocked' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, Tag_BaseItem) == 0x000900, "Member 'UBattlePassScreenS20::Tag_BaseItem' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, Tag_Prerequisite) == 0x000908, "Member 'UBattlePassScreenS20::Tag_Prerequisite' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, Tag_CompletePage) == 0x000910, "Member 'UBattlePassScreenS20::Tag_CompletePage' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, Tag_NotEnough_Currency) == 0x000918, "Member 'UBattlePassScreenS20::Tag_NotEnough_Currency' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, Tag_Cost) == 0x000920, "Member 'UBattlePassScreenS20::Tag_Cost' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, Tag_Owned) == 0x000928, "Member 'UBattlePassScreenS20::Tag_Owned' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, Tag_Delayed) == 0x000930, "Member 'UBattlePassScreenS20::Tag_Delayed' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, SeasonData_BattleStar) == 0x000990, "Member 'UBattlePassScreenS20::SeasonData_BattleStar' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, CurrentSelectedEntry) == 0x000998, "Member 'UBattlePassScreenS20::CurrentSelectedEntry' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, SwitcherSubPageTypes) == 0x0009A0, "Member 'UBattlePassScreenS20::SwitcherSubPageTypes' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, SubPageSwitcher) == 0x0009B0, "Member 'UBattlePassScreenS20::SubPageSwitcher' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, SeasonalBaseCustomizationItem) == 0x000A78, "Member 'UBattlePassScreenS20::SeasonalBaseCustomizationItem' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, bHasSubscription) == 0x000A80, "Member 'UBattlePassScreenS20::bHasSubscription' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, BattleStarsTooltipHideLevel) == 0x000A84, "Member 'UBattlePassScreenS20::BattleStarsTooltipHideLevel' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, TutorialTooltip_BattleStars) == 0x000A90, "Member 'UBattlePassScreenS20::TutorialTooltip_BattleStars' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenS20, TutorialTooltip_StylePoints) == 0x000A98, "Member 'UBattlePassScreenS20::TutorialTooltip_StylePoints' has a wrong offset!");

// Class BattlePassS20UI.FortBattlePassCustomSkinPageS20
// 0x0040 (0x0590 - 0x0550)
class UFortBattlePassCustomSkinPageS20 : public UFortBattlePassCustomSkinPageBase
{
public:
	class FString                                 ClaimBaseItemTooltip_ClaimCheckTemplateId;         // 0x0550(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_560[0x18];                                     // 0x0560(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortBattlePassTutorialTooltip*         TutorialTooltip_ClaimBaseItem;                     // 0x0578(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FGameplayTag>                   SwingPreviewChannelTags;                           // 0x0580(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBattlePassCustomSkinPageS20">();
	}
	static class UFortBattlePassCustomSkinPageS20* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassCustomSkinPageS20>();
	}
};
static_assert(alignof(UFortBattlePassCustomSkinPageS20) == 0x000008, "Wrong alignment on UFortBattlePassCustomSkinPageS20");
static_assert(sizeof(UFortBattlePassCustomSkinPageS20) == 0x000590, "Wrong size on UFortBattlePassCustomSkinPageS20");
static_assert(offsetof(UFortBattlePassCustomSkinPageS20, ClaimBaseItemTooltip_ClaimCheckTemplateId) == 0x000550, "Member 'UFortBattlePassCustomSkinPageS20::ClaimBaseItemTooltip_ClaimCheckTemplateId' has a wrong offset!");
static_assert(offsetof(UFortBattlePassCustomSkinPageS20, TutorialTooltip_ClaimBaseItem) == 0x000578, "Member 'UFortBattlePassCustomSkinPageS20::TutorialTooltip_ClaimBaseItem' has a wrong offset!");
static_assert(offsetof(UFortBattlePassCustomSkinPageS20, SwingPreviewChannelTags) == 0x000580, "Member 'UFortBattlePassCustomSkinPageS20::SwingPreviewChannelTags' has a wrong offset!");

// Class BattlePassS20UI.FortBattlePassResourcesWidgetS20
// 0x0020 (0x02D0 - 0x02B0)
class UFortBattlePassResourcesWidgetS20 final : public UFortBattlePassResourcesWidgetBase
{
public:
	class UCommonTextBlock*                       Text_BattleStarsAmount;                            // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_StylePointsAmount;                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBorder*                                Border_StylePointsRewardsTag;                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBorder*                                Border_BattleStarsRewardsTag;                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnBattleStarRewardsSet(const int32 Rewards);
	void OnStylePointsRewardsSet(const int32 Rewards);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBattlePassResourcesWidgetS20">();
	}
	static class UFortBattlePassResourcesWidgetS20* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassResourcesWidgetS20>();
	}
};
static_assert(alignof(UFortBattlePassResourcesWidgetS20) == 0x000008, "Wrong alignment on UFortBattlePassResourcesWidgetS20");
static_assert(sizeof(UFortBattlePassResourcesWidgetS20) == 0x0002D0, "Wrong size on UFortBattlePassResourcesWidgetS20");
static_assert(offsetof(UFortBattlePassResourcesWidgetS20, Text_BattleStarsAmount) == 0x0002B0, "Member 'UFortBattlePassResourcesWidgetS20::Text_BattleStarsAmount' has a wrong offset!");
