#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AudioScripting_Lobby

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AudioScripting_Lobby.BP_AudioScripting_Lobby_C
// 0x01E0 (0x0450 - 0x0270)
class ABP_AudioScripting_Lobby_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SequenceTime;                                      // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Initialized;                                       // 0x0284(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableAudioAnalysis_Default;                       // 0x0285(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableAudioAnalysis_VO_A;                          // 0x0286(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableAudioAnalysis_VO_B;                          // 0x0287(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableAudioAnalysis_VO_C;                          // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableAudioAnalysis_Master;                        // 0x0289(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28A[0x6];                                      // 0x028A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortSubmixAnalyzerData                AnalyzerData_VO_A;                                 // 0x0290(0x0068)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FFortSubmixAnalyzerData                AnalyzerData_VO_B;                                 // 0x02F8(0x0068)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          DisableMasterCompressor;                           // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USubmixEffectDynamicsProcessorPreset*   Compressor;                                        // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortSubmixAnalyzerData                AnalyzerData_VO_C;                                 // 0x0370(0x0068)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FFortSubmixAnalyzerData                AnalyzerData_VO_Master;                            // 0x03D8(0x0068)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          LobbyMix;                                          // 0x0440(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_441[0x7];                                      // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundMix*                              CurrentMix;                                        // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AudioScripting_Lobby(int32 EntryPoint);
	void OnInitializedChanged(bool Initialized_0);
	void SetDisableMasterCompressor(bool DisableMasterCompressor_0);
	void SetInitialized(bool Initialized_0);
	void SetLobbyMix(bool LobbyMix_0);
	void SetSequenceTime(float SequenceTime_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AudioScripting_Lobby_C">();
	}
	static class ABP_AudioScripting_Lobby_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AudioScripting_Lobby_C>();
	}
};
static_assert(alignof(ABP_AudioScripting_Lobby_C) == 0x000008, "Wrong alignment on ABP_AudioScripting_Lobby_C");
static_assert(sizeof(ABP_AudioScripting_Lobby_C) == 0x000450, "Wrong size on ABP_AudioScripting_Lobby_C");
static_assert(offsetof(ABP_AudioScripting_Lobby_C, UberGraphFrame) == 0x000270, "Member 'ABP_AudioScripting_Lobby_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Lobby_C, DefaultSceneRoot) == 0x000278, "Member 'ABP_AudioScripting_Lobby_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Lobby_C, SequenceTime) == 0x000280, "Member 'ABP_AudioScripting_Lobby_C::SequenceTime' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Lobby_C, Initialized) == 0x000284, "Member 'ABP_AudioScripting_Lobby_C::Initialized' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Lobby_C, EnableAudioAnalysis_Default) == 0x000285, "Member 'ABP_AudioScripting_Lobby_C::EnableAudioAnalysis_Default' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Lobby_C, EnableAudioAnalysis_VO_A) == 0x000286, "Member 'ABP_AudioScripting_Lobby_C::EnableAudioAnalysis_VO_A' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Lobby_C, EnableAudioAnalysis_VO_B) == 0x000287, "Member 'ABP_AudioScripting_Lobby_C::EnableAudioAnalysis_VO_B' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Lobby_C, EnableAudioAnalysis_VO_C) == 0x000288, "Member 'ABP_AudioScripting_Lobby_C::EnableAudioAnalysis_VO_C' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Lobby_C, EnableAudioAnalysis_Master) == 0x000289, "Member 'ABP_AudioScripting_Lobby_C::EnableAudioAnalysis_Master' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Lobby_C, AnalyzerData_VO_A) == 0x000290, "Member 'ABP_AudioScripting_Lobby_C::AnalyzerData_VO_A' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Lobby_C, AnalyzerData_VO_B) == 0x0002F8, "Member 'ABP_AudioScripting_Lobby_C::AnalyzerData_VO_B' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Lobby_C, DisableMasterCompressor) == 0x000360, "Member 'ABP_AudioScripting_Lobby_C::DisableMasterCompressor' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Lobby_C, Compressor) == 0x000368, "Member 'ABP_AudioScripting_Lobby_C::Compressor' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Lobby_C, AnalyzerData_VO_C) == 0x000370, "Member 'ABP_AudioScripting_Lobby_C::AnalyzerData_VO_C' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Lobby_C, AnalyzerData_VO_Master) == 0x0003D8, "Member 'ABP_AudioScripting_Lobby_C::AnalyzerData_VO_Master' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Lobby_C, LobbyMix) == 0x000440, "Member 'ABP_AudioScripting_Lobby_C::LobbyMix' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Lobby_C, CurrentMix) == 0x000448, "Member 'ABP_AudioScripting_Lobby_C::CurrentMix' has a wrong offset!");

}

