#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Armadillo_IrisDoor_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Armadillo_IrisDoor_01.BP_Armadillo_IrisDoor_01_C
// 0x0020 (0x0290 - 0x0270)
class ABP_Armadillo_IrisDoor_01_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_Armadillo_IrisDoor_Edge_01;                     // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SM_Armadillo_IrisDoor_01;                          // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Armadillo_IrisDoor_01(int32 EntryPoint);
	void MoonBaseIrisDoorAudio(bool IsClose);
	void PlayAudioSound(bool IsClose);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Armadillo_IrisDoor_01_C">();
	}
	static class ABP_Armadillo_IrisDoor_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Armadillo_IrisDoor_01_C>();
	}
};
static_assert(alignof(ABP_Armadillo_IrisDoor_01_C) == 0x000008, "Wrong alignment on ABP_Armadillo_IrisDoor_01_C");
static_assert(sizeof(ABP_Armadillo_IrisDoor_01_C) == 0x000290, "Wrong size on ABP_Armadillo_IrisDoor_01_C");
static_assert(offsetof(ABP_Armadillo_IrisDoor_01_C, UberGraphFrame) == 0x000270, "Member 'ABP_Armadillo_IrisDoor_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Armadillo_IrisDoor_01_C, SM_Armadillo_IrisDoor_Edge_01) == 0x000278, "Member 'ABP_Armadillo_IrisDoor_01_C::SM_Armadillo_IrisDoor_Edge_01' has a wrong offset!");
static_assert(offsetof(ABP_Armadillo_IrisDoor_01_C, SM_Armadillo_IrisDoor_01) == 0x000280, "Member 'ABP_Armadillo_IrisDoor_01_C::SM_Armadillo_IrisDoor_01' has a wrong offset!");
static_assert(offsetof(ABP_Armadillo_IrisDoor_01_C, DefaultSceneRoot) == 0x000288, "Member 'ABP_Armadillo_IrisDoor_01_C::DefaultSceneRoot' has a wrong offset!");

}

