#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AudioScripting_Armadillo_Preshow

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AudioScripting_Armadillo_Preshow.BP_AudioScripting_Armadillo_Preshow_C.Disable Previous Active Sound Mix
// 0x0028 (0x0028 - 0x0000)
struct BP_AudioScripting_Armadillo_Preshow_C_Disable_Previous_Active_Sound_Mix final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioScripting_Armadillo_Preshow_C_Disable_Previous_Active_Sound_Mix) == 0x000008, "Wrong alignment on BP_AudioScripting_Armadillo_Preshow_C_Disable_Previous_Active_Sound_Mix");
static_assert(sizeof(BP_AudioScripting_Armadillo_Preshow_C_Disable_Previous_Active_Sound_Mix) == 0x000028, "Wrong size on BP_AudioScripting_Armadillo_Preshow_C_Disable_Previous_Active_Sound_Mix");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_Disable_Previous_Active_Sound_Mix, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_AudioScripting_Armadillo_Preshow_C_Disable_Previous_Active_Sound_Mix::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_Disable_Previous_Active_Sound_Mix, CallFunc_GetDisplayName_ReturnValue) == 0x000008, "Member 'BP_AudioScripting_Armadillo_Preshow_C_Disable_Previous_Active_Sound_Mix::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_Disable_Previous_Active_Sound_Mix, CallFunc_Concat_StrStr_ReturnValue) == 0x000018, "Member 'BP_AudioScripting_Armadillo_Preshow_C_Disable_Previous_Active_Sound_Mix::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function BP_AudioScripting_Armadillo_Preshow.BP_AudioScripting_Armadillo_Preshow_C.Enable Active Sound mix
// 0x0010 (0x0010 - 0x0000)
struct BP_AudioScripting_Armadillo_Preshow_C_Enable_Active_Sound_mix final
{
public:
	class USoundMix*                              New_Sound_Mix;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioScripting_Armadillo_Preshow_C_Enable_Active_Sound_mix) == 0x000008, "Wrong alignment on BP_AudioScripting_Armadillo_Preshow_C_Enable_Active_Sound_mix");
static_assert(sizeof(BP_AudioScripting_Armadillo_Preshow_C_Enable_Active_Sound_mix) == 0x000010, "Wrong size on BP_AudioScripting_Armadillo_Preshow_C_Enable_Active_Sound_mix");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_Enable_Active_Sound_mix, New_Sound_Mix) == 0x000000, "Member 'BP_AudioScripting_Armadillo_Preshow_C_Enable_Active_Sound_mix::New_Sound_Mix' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_Enable_Active_Sound_mix, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_AudioScripting_Armadillo_Preshow_C_Enable_Active_Sound_mix::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_AudioScripting_Armadillo_Preshow.BP_AudioScripting_Armadillo_Preshow_C.ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow
// 0x0170 (0x0170 - 0x0000)
struct BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundMix*                              K2Node_CustomEvent_Sound_Mix;                      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USoundMix*>                      K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Crossfade_Time;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_wildcard_To_allow_the_previous_value_to_be_returned_Variable; // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortSplineAudioActor*                  K2Node_DynamicCast_AsFort_Spline_Audio_Actor;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundMix*                              Temp_wildcard_To_allow_the_previous_value_to_be_returned_Variable_1; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortSplineAudioActor*                  K2Node_DynamicCast_AsFort_Spline_Audio_Actor_1;    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Frontend_EventLevel_NavObject_MapTable_Fixed_C* K2Node_DynamicCast_AsBP_Frontend_Event_Level_Nav_Object_Map_Table_Fixed; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_3; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Frontend_EventLevel_NavObject_MapTable_Fixed_C* K2Node_DynamicCast_AsBP_Frontend_Event_Level_Nav_Object_Map_Table_Fixed_1; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_PlayMusic;                      // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  K2Node_MakeArray_Array_1;                          // 0x00B0(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_SecondsRemaining;               // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D3[0x1];                                       // 0x00D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 SecondsRemaining)>       K2Node_CreateDelegate_OutputDelegate;              // 0x00D8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class AAmbientSound>           CallFunc_Array_Get_Item;                           // 0x00E8(0x0028)(HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_4; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAmbientSound*                          K2Node_DynamicCast_AsAmbient_Sound;                // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12B[0x5];                                      // 0x012B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_5; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Generic_TimerManager_C*             K2Node_DynamicCast_AsBP_Generic_Timer_Manager;     // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAmbientAudioSubsystem*                 CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAmbientAudioSubsystem*                 CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAmbientAudioSubsystem*                 CallFunc_GetWorldSubsystem_ReturnValue_2;          // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAmbientAudioSubsystem*                 CallFunc_GetWorldSubsystem_ReturnValue_3;          // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow) == 0x000008, "Wrong alignment on BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow");
static_assert(sizeof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow) == 0x000170, "Wrong size on BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, EntryPoint) == 0x000000, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, Temp_bool_IsClosed_Variable) == 0x000008, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, Temp_bool_Has_Been_Initd_Variable) == 0x000009, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, K2Node_CustomEvent_Sound_Mix) == 0x000010, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::K2Node_CustomEvent_Sound_Mix' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, K2Node_MakeArray_Array) == 0x000018, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, CallFunc_Array_Contains_ReturnValue) == 0x000030, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, K2Node_Event_EndPlayReason) == 0x000031, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, K2Node_CustomEvent_Crossfade_Time) == 0x000034, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::K2Node_CustomEvent_Crossfade_Time' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, Temp_wildcard_To_allow_the_previous_value_to_be_returned_Variable) == 0x000038, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::Temp_wildcard_To_allow_the_previous_value_to_be_returned_Variable' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000040, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, K2Node_DynamicCast_AsFort_Spline_Audio_Actor) == 0x000048, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::K2Node_DynamicCast_AsFort_Spline_Audio_Actor' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, CallFunc_IsValid_ReturnValue) == 0x000051, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, CallFunc_IsValid_ReturnValue_1) == 0x000052, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, Temp_wildcard_To_allow_the_previous_value_to_be_returned_Variable_1) == 0x000058, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::Temp_wildcard_To_allow_the_previous_value_to_be_returned_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1) == 0x000060, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, K2Node_DynamicCast_AsFort_Spline_Audio_Actor_1) == 0x000068, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::K2Node_DynamicCast_AsFort_Spline_Audio_Actor_1' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2) == 0x000078, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, CallFunc_IsValid_ReturnValue_2) == 0x000080, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, K2Node_DynamicCast_AsBP_Frontend_Event_Level_Nav_Object_Map_Table_Fixed) == 0x000088, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::K2Node_DynamicCast_AsBP_Frontend_Event_Level_Nav_Object_Map_Table_Fixed' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, K2Node_DynamicCast_bSuccess_2) == 0x000090, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, CallFunc_IsValid_ReturnValue_3) == 0x000091, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_3) == 0x000098, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, K2Node_DynamicCast_AsBP_Frontend_Event_Level_Nav_Object_Map_Table_Fixed_1) == 0x0000A0, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::K2Node_DynamicCast_AsBP_Frontend_Event_Level_Nav_Object_Map_Table_Fixed_1' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, K2Node_DynamicCast_bSuccess_3) == 0x0000A8, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, CallFunc_IsValid_ReturnValue_4) == 0x0000A9, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, CallFunc_IsValid_ReturnValue_5) == 0x0000AA, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, K2Node_CustomEvent_PlayMusic) == 0x0000AB, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::K2Node_CustomEvent_PlayMusic' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, K2Node_MakeArray_Array_1) == 0x0000B0, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, CallFunc_Array_Contains_ReturnValue_1) == 0x0000C0, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, K2Node_CustomEvent_SecondsRemaining) == 0x0000C4, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::K2Node_CustomEvent_SecondsRemaining' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, CallFunc_SpawnSound2D_ReturnValue) == 0x0000C8, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000D0, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000D1, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, CallFunc_Less_IntInt_ReturnValue) == 0x0000D2, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, CallFunc_SelectFloat_ReturnValue) == 0x0000D4, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, K2Node_CreateDelegate_OutputDelegate) == 0x0000D8, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000E4, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, CallFunc_Array_Get_Item) == 0x0000E8, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_4) == 0x000110, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, CallFunc_Array_Length_ReturnValue) == 0x000118, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, K2Node_DynamicCast_AsAmbient_Sound) == 0x000120, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::K2Node_DynamicCast_AsAmbient_Sound' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, K2Node_DynamicCast_bSuccess_4) == 0x000128, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, CallFunc_Less_IntInt_ReturnValue_1) == 0x000129, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, CallFunc_IsValid_ReturnValue_6) == 0x00012A, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_5) == 0x000130, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, K2Node_DynamicCast_AsBP_Generic_Timer_Manager) == 0x000138, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::K2Node_DynamicCast_AsBP_Generic_Timer_Manager' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, K2Node_DynamicCast_bSuccess_5) == 0x000140, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, CallFunc_IsValid_ReturnValue_7) == 0x000141, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000148, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, CallFunc_GetWorldSubsystem_ReturnValue_1) == 0x000150, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::CallFunc_GetWorldSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, CallFunc_GetWorldSubsystem_ReturnValue_2) == 0x000158, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::CallFunc_GetWorldSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, CallFunc_GetWorldSubsystem_ReturnValue_3) == 0x000160, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::CallFunc_GetWorldSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow, CallFunc_IsValid_ReturnValue_8) == 0x000168, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ExecuteUbergraph_BP_AudioScripting_Armadillo_Preshow::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");

// Function BP_AudioScripting_Armadillo_Preshow.BP_AudioScripting_Armadillo_Preshow_C.Mix Mod Activated
// 0x0028 (0x0028 - 0x0000)
struct BP_AudioScripting_Armadillo_Preshow_C_Mix_Mod_Activated final
{
public:
	class USoundMix*                              InSoundMixModifier;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioScripting_Armadillo_Preshow_C_Mix_Mod_Activated) == 0x000008, "Wrong alignment on BP_AudioScripting_Armadillo_Preshow_C_Mix_Mod_Activated");
static_assert(sizeof(BP_AudioScripting_Armadillo_Preshow_C_Mix_Mod_Activated) == 0x000028, "Wrong size on BP_AudioScripting_Armadillo_Preshow_C_Mix_Mod_Activated");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_Mix_Mod_Activated, InSoundMixModifier) == 0x000000, "Member 'BP_AudioScripting_Armadillo_Preshow_C_Mix_Mod_Activated::InSoundMixModifier' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_Mix_Mod_Activated, CallFunc_GetDisplayName_ReturnValue) == 0x000008, "Member 'BP_AudioScripting_Armadillo_Preshow_C_Mix_Mod_Activated::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_Mix_Mod_Activated, CallFunc_Concat_StrStr_ReturnValue) == 0x000018, "Member 'BP_AudioScripting_Armadillo_Preshow_C_Mix_Mod_Activated::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function BP_AudioScripting_Armadillo_Preshow.BP_AudioScripting_Armadillo_Preshow_C.PlayBeepSound
// 0x0004 (0x0004 - 0x0000)
struct BP_AudioScripting_Armadillo_Preshow_C_PlayBeepSound final
{
public:
	int32                                         SecondsRemaining;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioScripting_Armadillo_Preshow_C_PlayBeepSound) == 0x000004, "Wrong alignment on BP_AudioScripting_Armadillo_Preshow_C_PlayBeepSound");
static_assert(sizeof(BP_AudioScripting_Armadillo_Preshow_C_PlayBeepSound) == 0x000004, "Wrong size on BP_AudioScripting_Armadillo_Preshow_C_PlayBeepSound");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_PlayBeepSound, SecondsRemaining) == 0x000000, "Member 'BP_AudioScripting_Armadillo_Preshow_C_PlayBeepSound::SecondsRemaining' has a wrong offset!");

// Function BP_AudioScripting_Armadillo_Preshow.BP_AudioScripting_Armadillo_Preshow_C.PlayPreEventAmbiance
// 0x0004 (0x0004 - 0x0000)
struct BP_AudioScripting_Armadillo_Preshow_C_PlayPreEventAmbiance final
{
public:
	float                                         Crossfade_Time;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioScripting_Armadillo_Preshow_C_PlayPreEventAmbiance) == 0x000004, "Wrong alignment on BP_AudioScripting_Armadillo_Preshow_C_PlayPreEventAmbiance");
static_assert(sizeof(BP_AudioScripting_Armadillo_Preshow_C_PlayPreEventAmbiance) == 0x000004, "Wrong size on BP_AudioScripting_Armadillo_Preshow_C_PlayPreEventAmbiance");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_PlayPreEventAmbiance, Crossfade_Time) == 0x000000, "Member 'BP_AudioScripting_Armadillo_Preshow_C_PlayPreEventAmbiance::Crossfade_Time' has a wrong offset!");

// Function BP_AudioScripting_Armadillo_Preshow.BP_AudioScripting_Armadillo_Preshow_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_AudioScripting_Armadillo_Preshow_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioScripting_Armadillo_Preshow_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_AudioScripting_Armadillo_Preshow_C_ReceiveEndPlay");
static_assert(sizeof(BP_AudioScripting_Armadillo_Preshow_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_AudioScripting_Armadillo_Preshow_C_ReceiveEndPlay");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_AudioScripting_Armadillo_Preshow_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_AudioScripting_Armadillo_Preshow.BP_AudioScripting_Armadillo_Preshow_C.SetAndEnableSoundMix
// 0x0008 (0x0008 - 0x0000)
struct BP_AudioScripting_Armadillo_Preshow_C_SetAndEnableSoundMix final
{
public:
	class USoundMix*                              Sound_Mix;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioScripting_Armadillo_Preshow_C_SetAndEnableSoundMix) == 0x000008, "Wrong alignment on BP_AudioScripting_Armadillo_Preshow_C_SetAndEnableSoundMix");
static_assert(sizeof(BP_AudioScripting_Armadillo_Preshow_C_SetAndEnableSoundMix) == 0x000008, "Wrong size on BP_AudioScripting_Armadillo_Preshow_C_SetAndEnableSoundMix");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_SetAndEnableSoundMix, Sound_Mix) == 0x000000, "Member 'BP_AudioScripting_Armadillo_Preshow_C_SetAndEnableSoundMix::Sound_Mix' has a wrong offset!");

// Function BP_AudioScripting_Armadillo_Preshow.BP_AudioScripting_Armadillo_Preshow_C.SetPlayMusic
// 0x0001 (0x0001 - 0x0000)
struct BP_AudioScripting_Armadillo_Preshow_C_SetPlayMusic final
{
public:
	bool                                          PlayMusic_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioScripting_Armadillo_Preshow_C_SetPlayMusic) == 0x000001, "Wrong alignment on BP_AudioScripting_Armadillo_Preshow_C_SetPlayMusic");
static_assert(sizeof(BP_AudioScripting_Armadillo_Preshow_C_SetPlayMusic) == 0x000001, "Wrong size on BP_AudioScripting_Armadillo_Preshow_C_SetPlayMusic");
static_assert(offsetof(BP_AudioScripting_Armadillo_Preshow_C_SetPlayMusic, PlayMusic_0) == 0x000000, "Member 'BP_AudioScripting_Armadillo_Preshow_C_SetPlayMusic::PlayMusic_0' has a wrong offset!");

}

