#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ArmadilloPlayerControllerComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ArmadilloPlayerControllerComponent.BP_ArmadilloPlayerControllerComponent_C.ExecuteUbergraph_BP_ArmadilloPlayerControllerComponent
// 0x0028 (0x0028 - 0x0000)
struct BP_ArmadilloPlayerControllerComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerControllerComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bEnable;                        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArmadilloPlayerControllerComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerControllerComponent) == 0x000008, "Wrong alignment on BP_ArmadilloPlayerControllerComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerControllerComponent");
static_assert(sizeof(BP_ArmadilloPlayerControllerComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerControllerComponent) == 0x000028, "Wrong size on BP_ArmadilloPlayerControllerComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerControllerComponent");
static_assert(offsetof(BP_ArmadilloPlayerControllerComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerControllerComponent, EntryPoint) == 0x000000, "Member 'BP_ArmadilloPlayerControllerComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerControllerComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerControllerComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerControllerComponent, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'BP_ArmadilloPlayerControllerComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerControllerComponent::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerControllerComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerControllerComponent, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000005, "Member 'BP_ArmadilloPlayerControllerComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerControllerComponent::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerControllerComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerControllerComponent, K2Node_Event_EndPlayReason) == 0x000006, "Member 'BP_ArmadilloPlayerControllerComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerControllerComponent::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerControllerComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerControllerComponent, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_ArmadilloPlayerControllerComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerControllerComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerControllerComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerControllerComponent, K2Node_CustomEvent_bEnable) == 0x000010, "Member 'BP_ArmadilloPlayerControllerComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerControllerComponent::K2Node_CustomEvent_bEnable' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerControllerComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerControllerComponent, K2Node_DynamicCast_AsPlayer_Controller) == 0x000018, "Member 'BP_ArmadilloPlayerControllerComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerControllerComponent::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerControllerComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerControllerComponent, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_ArmadilloPlayerControllerComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerControllerComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_ArmadilloPlayerControllerComponent.BP_ArmadilloPlayerControllerComponent_C.OnRep_bProxyPawnOptimizationEnabled
// 0x0018 (0x0018 - 0x0000)
struct BP_ArmadilloPlayerControllerComponent_C_OnRep_bProxyPawnOptimizationEnabled final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArmadilloPlayerControllerComponent_C_OnRep_bProxyPawnOptimizationEnabled) == 0x000008, "Wrong alignment on BP_ArmadilloPlayerControllerComponent_C_OnRep_bProxyPawnOptimizationEnabled");
static_assert(sizeof(BP_ArmadilloPlayerControllerComponent_C_OnRep_bProxyPawnOptimizationEnabled) == 0x000018, "Wrong size on BP_ArmadilloPlayerControllerComponent_C_OnRep_bProxyPawnOptimizationEnabled");
static_assert(offsetof(BP_ArmadilloPlayerControllerComponent_C_OnRep_bProxyPawnOptimizationEnabled, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'BP_ArmadilloPlayerControllerComponent_C_OnRep_bProxyPawnOptimizationEnabled::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerControllerComponent_C_OnRep_bProxyPawnOptimizationEnabled, K2Node_DynamicCast_AsPlayer_Controller) == 0x000008, "Member 'BP_ArmadilloPlayerControllerComponent_C_OnRep_bProxyPawnOptimizationEnabled::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerControllerComponent_C_OnRep_bProxyPawnOptimizationEnabled, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_ArmadilloPlayerControllerComponent_C_OnRep_bProxyPawnOptimizationEnabled::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerControllerComponent_C_OnRep_bProxyPawnOptimizationEnabled, CallFunc_IsDedicatedServer_ReturnValue) == 0x000011, "Member 'BP_ArmadilloPlayerControllerComponent_C_OnRep_bProxyPawnOptimizationEnabled::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

// Function BP_ArmadilloPlayerControllerComponent.BP_ArmadilloPlayerControllerComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_ArmadilloPlayerControllerComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArmadilloPlayerControllerComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_ArmadilloPlayerControllerComponent_C_ReceiveEndPlay");
static_assert(sizeof(BP_ArmadilloPlayerControllerComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_ArmadilloPlayerControllerComponent_C_ReceiveEndPlay");
static_assert(offsetof(BP_ArmadilloPlayerControllerComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_ArmadilloPlayerControllerComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_ArmadilloPlayerControllerComponent.BP_ArmadilloPlayerControllerComponent_C.SetEnableProxyPawnOptimizations
// 0x0001 (0x0001 - 0x0000)
struct BP_ArmadilloPlayerControllerComponent_C_SetEnableProxyPawnOptimizations final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArmadilloPlayerControllerComponent_C_SetEnableProxyPawnOptimizations) == 0x000001, "Wrong alignment on BP_ArmadilloPlayerControllerComponent_C_SetEnableProxyPawnOptimizations");
static_assert(sizeof(BP_ArmadilloPlayerControllerComponent_C_SetEnableProxyPawnOptimizations) == 0x000001, "Wrong size on BP_ArmadilloPlayerControllerComponent_C_SetEnableProxyPawnOptimizations");
static_assert(offsetof(BP_ArmadilloPlayerControllerComponent_C_SetEnableProxyPawnOptimizations, bEnable) == 0x000000, "Member 'BP_ArmadilloPlayerControllerComponent_C_SetEnableProxyPawnOptimizations::bEnable' has a wrong offset!");

}

