#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Armadillo_HeartacheViewport

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_Armadillo_HeartacheViewport.BP_Armadillo_HeartacheViewport_C.ApplyDamage
// 0x0010 (0x0010 - 0x0000)
struct BP_Armadillo_HeartacheViewport_C_ApplyDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 DamageCauser;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Armadillo_HeartacheViewport_C_ApplyDamage) == 0x000008, "Wrong alignment on BP_Armadillo_HeartacheViewport_C_ApplyDamage");
static_assert(sizeof(BP_Armadillo_HeartacheViewport_C_ApplyDamage) == 0x000010, "Wrong size on BP_Armadillo_HeartacheViewport_C_ApplyDamage");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ApplyDamage, Damage) == 0x000000, "Member 'BP_Armadillo_HeartacheViewport_C_ApplyDamage::Damage' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ApplyDamage, DamageCauser) == 0x000008, "Member 'BP_Armadillo_HeartacheViewport_C_ApplyDamage::DamageCauser' has a wrong offset!");

// Function BP_Armadillo_HeartacheViewport.BP_Armadillo_HeartacheViewport_C.CreateArmadilloHUD
// 0x0001 (0x0001 - 0x0000)
struct BP_Armadillo_HeartacheViewport_C_CreateArmadilloHUD final
{
public:
	bool                                          AddToViewport;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Armadillo_HeartacheViewport_C_CreateArmadilloHUD) == 0x000001, "Wrong alignment on BP_Armadillo_HeartacheViewport_C_CreateArmadilloHUD");
static_assert(sizeof(BP_Armadillo_HeartacheViewport_C_CreateArmadilloHUD) == 0x000001, "Wrong size on BP_Armadillo_HeartacheViewport_C_CreateArmadilloHUD");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_CreateArmadilloHUD, AddToViewport) == 0x000000, "Member 'BP_Armadillo_HeartacheViewport_C_CreateArmadilloHUD::AddToViewport' has a wrong offset!");

// Function BP_Armadillo_HeartacheViewport.BP_Armadillo_HeartacheViewport_C.DisableDoggusView
// 0x0001 (0x0001 - 0x0000)
struct BP_Armadillo_HeartacheViewport_C_DisableDoggusView final
{
public:
	bool                                          DestroyHUD;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Armadillo_HeartacheViewport_C_DisableDoggusView) == 0x000001, "Wrong alignment on BP_Armadillo_HeartacheViewport_C_DisableDoggusView");
static_assert(sizeof(BP_Armadillo_HeartacheViewport_C_DisableDoggusView) == 0x000001, "Wrong size on BP_Armadillo_HeartacheViewport_C_DisableDoggusView");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_DisableDoggusView, DestroyHUD) == 0x000000, "Member 'BP_Armadillo_HeartacheViewport_C_DisableDoggusView::DestroyHUD' has a wrong offset!");

// Function BP_Armadillo_HeartacheViewport.BP_Armadillo_HeartacheViewport_C.ExecuteUbergraph_BP_Armadillo_HeartacheViewport
// 0x0490 (0x0490 - 0x0000)
struct BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x0010(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0018(0x0020)(ConstParm)
	TDelegate<void(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate; // 0x0038(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0048(0x0020)()
	class UFortPlaylist*                          Temp_object_Variable;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   Temp_object_Variable_1;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUserWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_1;           // 0x0084(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_CustomEvent_UserWidget;                     // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Temp_object_Variable_2;                            // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_DestroyHUD_2;                   // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_CustomEvent_UserWidget_1;                   // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bEnable;                        // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_DestroyHUD_1;                   // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_DestroyHUD;                     // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B6[0x2];                                       // 0x00B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ReferenceParm, ContainsInstancedReference)
	TDelegate<void(class UUserWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_2;           // 0x00C8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_AddToViewport;                  // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x00D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00D7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaMutator_SpecialRelevancy*    CallFunc_GetSpecialRelevancyMutator_ReturnValue;   // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0100(0x0060)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_4;          // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01E0(0x0060)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0240(0x0060)(IsPlainOldData, NoDestructor)
	struct FSpecialActorSpawnData                 K2Node_MakeStruct_SpecialActorSpawnData;           // 0x02A0(0x0080)(NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0320(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_401[0x7];                                      // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_SpawnActorPerRelevancyGroup_SpawnedActors; // 0x0408(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Armadillo_DamageManager_C*          CallFunc_GetActorOfClass_ReturnValue;              // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortInitializeFromObjectInterface> K2Node_DynamicCast_AsFort_Initialize_from_Object_Interface; // 0x0430(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_441[0x7];                                      // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_5;          // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0451(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue_1;               // 0x0452(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0453(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_454[0x4];                                      // 0x0454(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue; // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CreateWidgetAsync*     CallFunc_CreateWidgetAsync_ReturnValue;            // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_6;          // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0469(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46A[0x6];                                      // 0x046A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_CreateWidgetAsync*     CallFunc_CreateWidgetAsync_ReturnValue_1;          // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479[0x7];                                      // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            Temp_object_Variable_3;                            // 0x0480(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport) == 0x000010, "Wrong alignment on BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport");
static_assert(sizeof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport) == 0x000490, "Wrong size on BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, EntryPoint) == 0x000000, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, K2Node_CustomEvent_GameState) == 0x000008, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, K2Node_CustomEvent_Playlist) == 0x000010, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, K2Node_CustomEvent_PlaylistContextTags) == 0x000018, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, Temp_struct_Variable) == 0x000048, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, Temp_object_Variable) == 0x000068, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, Temp_object_Variable_1) == 0x000070, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x000078, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, K2Node_CreateDelegate_OutputDelegate_1) == 0x000084, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, K2Node_CustomEvent_UserWidget) == 0x000090, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::K2Node_CustomEvent_UserWidget' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, Temp_object_Variable_2) == 0x000098, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, K2Node_Event_DeltaSeconds) == 0x0000A0, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, K2Node_CustomEvent_DestroyHUD_2) == 0x0000A4, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::K2Node_CustomEvent_DestroyHUD_2' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, K2Node_CustomEvent_UserWidget_1) == 0x0000A8, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::K2Node_CustomEvent_UserWidget_1' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, K2Node_CustomEvent_bEnable) == 0x0000B0, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::K2Node_CustomEvent_bEnable' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, K2Node_CustomEvent_DestroyHUD_1) == 0x0000B1, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::K2Node_CustomEvent_DestroyHUD_1' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, K2Node_CustomEvent_DestroyHUD) == 0x0000B2, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::K2Node_CustomEvent_DestroyHUD' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000B3, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x0000B4, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x0000B5, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, K2Node_MakeArray_Array) == 0x0000B8, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000C8, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_IsValid_ReturnValue_1) == 0x0000D4, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, K2Node_CustomEvent_AddToViewport) == 0x0000D5, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::K2Node_CustomEvent_AddToViewport' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_IsDedicatedServer_ReturnValue_3) == 0x0000D6, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_IsDedicatedServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_IsValid_ReturnValue_2) == 0x0000D7, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_IsInViewport_ReturnValue) == 0x0000D8, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_Not_PreBool_ReturnValue) == 0x0000D9, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_IsValid_ReturnValue_3) == 0x0000DA, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_BooleanAND_ReturnValue) == 0x0000DB, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_IsValid_ReturnValue_4) == 0x0000DC, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_GetSpecialRelevancyMutator_ReturnValue) == 0x0000E0, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_GetSpecialRelevancyMutator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, K2Node_CustomEvent_Damage) == 0x0000E8, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, K2Node_CustomEvent_DamageCauser) == 0x0000F0, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_IsValid_ReturnValue_5) == 0x0000F8, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_IsValid_ReturnValue_6) == 0x0000F9, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000100, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_BreakTransform_Location) == 0x000160, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_BreakTransform_Rotation) == 0x000178, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_BreakTransform_Scale) == 0x000190, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_IsDedicatedServer_ReturnValue_4) == 0x0001A8, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_IsDedicatedServer_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x0001B0, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_Add_VectorVector_ReturnValue) == 0x0001C8, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_MakeTransform_ReturnValue) == 0x0001E0, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_MakeTransform_ReturnValue_1) == 0x000240, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, K2Node_MakeStruct_SpecialActorSpawnData) == 0x0002A0, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::K2Node_MakeStruct_SpecialActorSpawnData' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000320, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_K2_SetActorTransform_ReturnValue) == 0x000400, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_SpawnActorPerRelevancyGroup_SpawnedActors) == 0x000408, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_SpawnActorPerRelevancyGroup_SpawnedActors' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_IsValid_ReturnValue_7) == 0x000418, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_GetActorOfClass_ReturnValue) == 0x000420, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000428, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, K2Node_DynamicCast_AsFort_Initialize_from_Object_Interface) == 0x000430, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::K2Node_DynamicCast_AsFort_Initialize_from_Object_Interface' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, K2Node_DynamicCast_bSuccess) == 0x000440, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000448, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_IsDedicatedServer_ReturnValue_5) == 0x000450, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_IsDedicatedServer_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_IsValid_ReturnValue_8) == 0x000451, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_IsInViewport_ReturnValue_1) == 0x000452, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_IsInViewport_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_Not_PreBool_ReturnValue_1) == 0x000453, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_GetFirstLocalFortPlayerController_ReturnValue) == 0x000458, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_GetFirstLocalFortPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_CreateWidgetAsync_ReturnValue) == 0x000460, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_CreateWidgetAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_IsDedicatedServer_ReturnValue_6) == 0x000468, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_IsDedicatedServer_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_IsValid_ReturnValue_9) == 0x000469, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_CreateWidgetAsync_ReturnValue_1) == 0x000470, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_CreateWidgetAsync_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, CallFunc_IsValid_ReturnValue_10) == 0x000478, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport, Temp_object_Variable_3) == 0x000480, "Member 'BP_Armadillo_HeartacheViewport_C_ExecuteUbergraph_BP_Armadillo_HeartacheViewport::Temp_object_Variable_3' has a wrong offset!");

// Function BP_Armadillo_HeartacheViewport.BP_Armadillo_HeartacheViewport_C.HandlePawnVisibility
// 0x0040 (0x0040 - 0x0000)
struct BP_Armadillo_HeartacheViewport_C_HandlePawnVisibility final
{
public:
	bool                                          SetPawnHidden;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerPawn*>                CallFunc_GetAllFortPlayerPawns_OutFortPlayerPawns; // 0x0018(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Armadillo_HeartacheViewport_C_HandlePawnVisibility) == 0x000008, "Wrong alignment on BP_Armadillo_HeartacheViewport_C_HandlePawnVisibility");
static_assert(sizeof(BP_Armadillo_HeartacheViewport_C_HandlePawnVisibility) == 0x000040, "Wrong size on BP_Armadillo_HeartacheViewport_C_HandlePawnVisibility");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_HandlePawnVisibility, SetPawnHidden) == 0x000000, "Member 'BP_Armadillo_HeartacheViewport_C_HandlePawnVisibility::SetPawnHidden' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_HandlePawnVisibility, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_Armadillo_HeartacheViewport_C_HandlePawnVisibility::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_HandlePawnVisibility, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_Armadillo_HeartacheViewport_C_HandlePawnVisibility::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_HandlePawnVisibility, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Armadillo_HeartacheViewport_C_HandlePawnVisibility::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_HandlePawnVisibility, CallFunc_IsDedicatedServer_ReturnValue) == 0x000010, "Member 'BP_Armadillo_HeartacheViewport_C_HandlePawnVisibility::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_HandlePawnVisibility, CallFunc_GetAllFortPlayerPawns_OutFortPlayerPawns) == 0x000018, "Member 'BP_Armadillo_HeartacheViewport_C_HandlePawnVisibility::CallFunc_GetAllFortPlayerPawns_OutFortPlayerPawns' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_HandlePawnVisibility, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_Armadillo_HeartacheViewport_C_HandlePawnVisibility::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_HandlePawnVisibility, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_Armadillo_HeartacheViewport_C_HandlePawnVisibility::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_HandlePawnVisibility, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'BP_Armadillo_HeartacheViewport_C_HandlePawnVisibility::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_HandlePawnVisibility, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'BP_Armadillo_HeartacheViewport_C_HandlePawnVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_Armadillo_HeartacheViewport.BP_Armadillo_HeartacheViewport_C.OnComplete_3E0B03E447F8FBBA97A0CC8BAF3B0662
// 0x0008 (0x0008 - 0x0000)
struct BP_Armadillo_HeartacheViewport_C_OnComplete_3E0B03E447F8FBBA97A0CC8BAF3B0662 final
{
public:
	class UUserWidget*                            UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Armadillo_HeartacheViewport_C_OnComplete_3E0B03E447F8FBBA97A0CC8BAF3B0662) == 0x000008, "Wrong alignment on BP_Armadillo_HeartacheViewport_C_OnComplete_3E0B03E447F8FBBA97A0CC8BAF3B0662");
static_assert(sizeof(BP_Armadillo_HeartacheViewport_C_OnComplete_3E0B03E447F8FBBA97A0CC8BAF3B0662) == 0x000008, "Wrong size on BP_Armadillo_HeartacheViewport_C_OnComplete_3E0B03E447F8FBBA97A0CC8BAF3B0662");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_OnComplete_3E0B03E447F8FBBA97A0CC8BAF3B0662, UserWidget) == 0x000000, "Member 'BP_Armadillo_HeartacheViewport_C_OnComplete_3E0B03E447F8FBBA97A0CC8BAF3B0662::UserWidget' has a wrong offset!");

// Function BP_Armadillo_HeartacheViewport.BP_Armadillo_HeartacheViewport_C.OnComplete_67F22BB14D221DBD7D3D7B933B253A90
// 0x0008 (0x0008 - 0x0000)
struct BP_Armadillo_HeartacheViewport_C_OnComplete_67F22BB14D221DBD7D3D7B933B253A90 final
{
public:
	class UUserWidget*                            UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Armadillo_HeartacheViewport_C_OnComplete_67F22BB14D221DBD7D3D7B933B253A90) == 0x000008, "Wrong alignment on BP_Armadillo_HeartacheViewport_C_OnComplete_67F22BB14D221DBD7D3D7B933B253A90");
static_assert(sizeof(BP_Armadillo_HeartacheViewport_C_OnComplete_67F22BB14D221DBD7D3D7B933B253A90) == 0x000008, "Wrong size on BP_Armadillo_HeartacheViewport_C_OnComplete_67F22BB14D221DBD7D3D7B933B253A90");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_OnComplete_67F22BB14D221DBD7D3D7B933B253A90, UserWidget) == 0x000000, "Member 'BP_Armadillo_HeartacheViewport_C_OnComplete_67F22BB14D221DBD7D3D7B933B253A90::UserWidget' has a wrong offset!");

// Function BP_Armadillo_HeartacheViewport.BP_Armadillo_HeartacheViewport_C.OnReady_B8ECD083466D3ACD3D5412A1525A2B09
// 0x0030 (0x0030 - 0x0000)
struct BP_Armadillo_HeartacheViewport_C_OnReady_B8ECD083466D3ACD3D5412A1525A2B09 final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_Armadillo_HeartacheViewport_C_OnReady_B8ECD083466D3ACD3D5412A1525A2B09) == 0x000008, "Wrong alignment on BP_Armadillo_HeartacheViewport_C_OnReady_B8ECD083466D3ACD3D5412A1525A2B09");
static_assert(sizeof(BP_Armadillo_HeartacheViewport_C_OnReady_B8ECD083466D3ACD3D5412A1525A2B09) == 0x000030, "Wrong size on BP_Armadillo_HeartacheViewport_C_OnReady_B8ECD083466D3ACD3D5412A1525A2B09");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_OnReady_B8ECD083466D3ACD3D5412A1525A2B09, GameState) == 0x000000, "Member 'BP_Armadillo_HeartacheViewport_C_OnReady_B8ECD083466D3ACD3D5412A1525A2B09::GameState' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_OnReady_B8ECD083466D3ACD3D5412A1525A2B09, Playlist) == 0x000008, "Member 'BP_Armadillo_HeartacheViewport_C_OnReady_B8ECD083466D3ACD3D5412A1525A2B09::Playlist' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_OnReady_B8ECD083466D3ACD3D5412A1525A2B09, PlaylistContextTags) == 0x000010, "Member 'BP_Armadillo_HeartacheViewport_C_OnReady_B8ECD083466D3ACD3D5412A1525A2B09::PlaylistContextTags' has a wrong offset!");

// Function BP_Armadillo_HeartacheViewport.BP_Armadillo_HeartacheViewport_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Armadillo_HeartacheViewport_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Armadillo_HeartacheViewport_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Armadillo_HeartacheViewport_C_ReceiveTick");
static_assert(sizeof(BP_Armadillo_HeartacheViewport_C_ReceiveTick) == 0x000004, "Wrong size on BP_Armadillo_HeartacheViewport_C_ReceiveTick");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Armadillo_HeartacheViewport_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Armadillo_HeartacheViewport.BP_Armadillo_HeartacheViewport_C.RemoveDoggusHUD
// 0x0001 (0x0001 - 0x0000)
struct BP_Armadillo_HeartacheViewport_C_RemoveDoggusHUD final
{
public:
	bool                                          DestroyHUD;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Armadillo_HeartacheViewport_C_RemoveDoggusHUD) == 0x000001, "Wrong alignment on BP_Armadillo_HeartacheViewport_C_RemoveDoggusHUD");
static_assert(sizeof(BP_Armadillo_HeartacheViewport_C_RemoveDoggusHUD) == 0x000001, "Wrong size on BP_Armadillo_HeartacheViewport_C_RemoveDoggusHUD");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_RemoveDoggusHUD, DestroyHUD) == 0x000000, "Member 'BP_Armadillo_HeartacheViewport_C_RemoveDoggusHUD::DestroyHUD' has a wrong offset!");

// Function BP_Armadillo_HeartacheViewport.BP_Armadillo_HeartacheViewport_C.RequestSetHUDVisibility
// 0x0020 (0x0020 - 0x0000)
struct BP_Armadillo_HeartacheViewport_C_RequestSetHUDVisibility final
{
public:
	bool                                          bShouldBeVisible;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldAnimateIntro;                               // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_ArmadilloPlayerStateComponent_C*    CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Armadillo_HeartacheViewport_C_RequestSetHUDVisibility) == 0x000008, "Wrong alignment on BP_Armadillo_HeartacheViewport_C_RequestSetHUDVisibility");
static_assert(sizeof(BP_Armadillo_HeartacheViewport_C_RequestSetHUDVisibility) == 0x000020, "Wrong size on BP_Armadillo_HeartacheViewport_C_RequestSetHUDVisibility");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_RequestSetHUDVisibility, bShouldBeVisible) == 0x000000, "Member 'BP_Armadillo_HeartacheViewport_C_RequestSetHUDVisibility::bShouldBeVisible' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_RequestSetHUDVisibility, bShouldAnimateIntro) == 0x000001, "Member 'BP_Armadillo_HeartacheViewport_C_RequestSetHUDVisibility::bShouldAnimateIntro' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_RequestSetHUDVisibility, CallFunc_IsDedicatedServer_ReturnValue) == 0x000002, "Member 'BP_Armadillo_HeartacheViewport_C_RequestSetHUDVisibility::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_RequestSetHUDVisibility, CallFunc_GetFirstLocalFortPlayerController_ReturnValue) == 0x000008, "Member 'BP_Armadillo_HeartacheViewport_C_RequestSetHUDVisibility::CallFunc_GetFirstLocalFortPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_RequestSetHUDVisibility, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'BP_Armadillo_HeartacheViewport_C_RequestSetHUDVisibility::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_RequestSetHUDVisibility, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_Armadillo_HeartacheViewport_C_RequestSetHUDVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Armadillo_HeartacheViewport_C_RequestSetHUDVisibility, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'BP_Armadillo_HeartacheViewport_C_RequestSetHUDVisibility::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_Armadillo_HeartacheViewport.BP_Armadillo_HeartacheViewport_C.ServerAttachPawnToHeadBP
// 0x0138 (0x0138 - 0x0000)
struct BP_Armadillo_HeartacheViewport_C_ServerAttachPawnToHeadBP final
{
public:
	TArray<class AFortPlayerPawn*>                FortPlayerPawn;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         AttachIndex;                                       // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0070(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
