#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AudioScripting_Parent

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AudioScripting_Parent.BP_AudioScripting_Parent_C
// 0x01F8 (0x0468 - 0x0270)
class ABP_AudioScripting_Parent_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SequenceTime;                                      // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Initialized;                                       // 0x0284(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableAudioAnalysis_Default;                       // 0x0285(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableAudioAnalysis_VO_A;                          // 0x0286(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableAudioAnalysis_VO_B;                          // 0x0287(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableAudioAnalysis_VO_C;                          // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableAudioAnalysis_Master;                        // 0x0289(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28A[0x6];                                      // 0x028A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortSubmixAnalyzerData                AnalyzerData_VO_A;                                 // 0x0290(0x0068)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FFortSubmixAnalyzerData                AnalyzerData_VO_B;                                 // 0x02F8(0x0068)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          DisableMasterCompressor;                           // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USubmixEffectDynamicsProcessorPreset*   Compressor;                                        // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundMix*                              CurrentMix;                                        // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	struct FFortSubmixAnalyzerData                AnalyzerData_VO_C;                                 // 0x0378(0x0068)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FFortSubmixAnalyzerData                AnalyzerData_VO_Master;                            // 0x03E0(0x0068)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UReverbEffect*                          ReverbEffect;                                      // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	class FName                                   ReverbTagName;                                     // 0x0450(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_454[0x4];                                      // 0x0454(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UReverbEffect*                          Updated_Variable;                                  // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReverbPriority;                                    // 0x0460(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetSequenceTime(float SequenceTime_0);
	void SetReverbEffect(class UReverbEffect* ReverbEffect_0);
	void SetInitialized(bool Initialized_0);
	void SetDisableMasterCompressor(bool DisableMasterCompressor_0);
	void SetCurrentMix(class USoundMix* SetMix);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void OnInitializedChanged(bool Initialized_0);
	void ExecuteUbergraph_BP_AudioScripting_Parent(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AudioScripting_Parent_C">();
	}
	static class ABP_AudioScripting_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AudioScripting_Parent_C>();
	}
};
static_assert(alignof(ABP_AudioScripting_Parent_C) == 0x000008, "Wrong alignment on ABP_AudioScripting_Parent_C");
static_assert(sizeof(ABP_AudioScripting_Parent_C) == 0x000468, "Wrong size on ABP_AudioScripting_Parent_C");
static_assert(offsetof(ABP_AudioScripting_Parent_C, UberGraphFrame) == 0x000270, "Member 'ABP_AudioScripting_Parent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Parent_C, DefaultSceneRoot) == 0x000278, "Member 'ABP_AudioScripting_Parent_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Parent_C, SequenceTime) == 0x000280, "Member 'ABP_AudioScripting_Parent_C::SequenceTime' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Parent_C, Initialized) == 0x000284, "Member 'ABP_AudioScripting_Parent_C::Initialized' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Parent_C, EnableAudioAnalysis_Default) == 0x000285, "Member 'ABP_AudioScripting_Parent_C::EnableAudioAnalysis_Default' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Parent_C, EnableAudioAnalysis_VO_A) == 0x000286, "Member 'ABP_AudioScripting_Parent_C::EnableAudioAnalysis_VO_A' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Parent_C, EnableAudioAnalysis_VO_B) == 0x000287, "Member 'ABP_AudioScripting_Parent_C::EnableAudioAnalysis_VO_B' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Parent_C, EnableAudioAnalysis_VO_C) == 0x000288, "Member 'ABP_AudioScripting_Parent_C::EnableAudioAnalysis_VO_C' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Parent_C, EnableAudioAnalysis_Master) == 0x000289, "Member 'ABP_AudioScripting_Parent_C::EnableAudioAnalysis_Master' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Parent_C, AnalyzerData_VO_A) == 0x000290, "Member 'ABP_AudioScripting_Parent_C::AnalyzerData_VO_A' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Parent_C, AnalyzerData_VO_B) == 0x0002F8, "Member 'ABP_AudioScripting_Parent_C::AnalyzerData_VO_B' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Parent_C, DisableMasterCompressor) == 0x000360, "Member 'ABP_AudioScripting_Parent_C::DisableMasterCompressor' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Parent_C, Compressor) == 0x000368, "Member 'ABP_AudioScripting_Parent_C::Compressor' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Parent_C, CurrentMix) == 0x000370, "Member 'ABP_AudioScripting_Parent_C::CurrentMix' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Parent_C, AnalyzerData_VO_C) == 0x000378, "Member 'ABP_AudioScripting_Parent_C::AnalyzerData_VO_C' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Parent_C, AnalyzerData_VO_Master) == 0x0003E0, "Member 'ABP_AudioScripting_Parent_C::AnalyzerData_VO_Master' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Parent_C, ReverbEffect) == 0x000448, "Member 'ABP_AudioScripting_Parent_C::ReverbEffect' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Parent_C, ReverbTagName) == 0x000450, "Member 'ABP_AudioScripting_Parent_C::ReverbTagName' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Parent_C, Updated_Variable) == 0x000458, "Member 'ABP_AudioScripting_Parent_C::Updated_Variable' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Parent_C, ReverbPriority) == 0x000460, "Member 'ABP_AudioScripting_Parent_C::ReverbPriority' has a wrong offset!");

}

