#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ArmadilloPlayerPawnComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ArmadilloPlayerPawnComponent.BP_ArmadilloPlayerPawnComponent_C
// 0x0018 (0x00B8 - 0x00A0)
class UBP_ArmadilloPlayerPawnComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          PausePlayerAnims;                                  // 0x00A8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           AnimDebugLogTimer;                                 // 0x00B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CheckSkeletalMeshComp();
	void ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent(int32 EntryPoint);
	void OnRep_PausePlayerAnims();
	void ReceiveBeginPlay();
	void Toggle_Player_Anims();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ArmadilloPlayerPawnComponent_C">();
	}
	static class UBP_ArmadilloPlayerPawnComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ArmadilloPlayerPawnComponent_C>();
	}
};
static_assert(alignof(UBP_ArmadilloPlayerPawnComponent_C) == 0x000008, "Wrong alignment on UBP_ArmadilloPlayerPawnComponent_C");
static_assert(sizeof(UBP_ArmadilloPlayerPawnComponent_C) == 0x0000B8, "Wrong size on UBP_ArmadilloPlayerPawnComponent_C");
static_assert(offsetof(UBP_ArmadilloPlayerPawnComponent_C, UberGraphFrame) == 0x0000A0, "Member 'UBP_ArmadilloPlayerPawnComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ArmadilloPlayerPawnComponent_C, PausePlayerAnims) == 0x0000A8, "Member 'UBP_ArmadilloPlayerPawnComponent_C::PausePlayerAnims' has a wrong offset!");
static_assert(offsetof(UBP_ArmadilloPlayerPawnComponent_C, AnimDebugLogTimer) == 0x0000B0, "Member 'UBP_ArmadilloPlayerPawnComponent_C::AnimDebugLogTimer' has a wrong offset!");

}

