#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ArmadilloPlayerStateComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_ArmadilloPlayerStateComponent.BP_ArmadilloPlayerStateComponent_C.ClientSetDamageDealt
// 0x0018 (0x0018 - 0x0000)
struct BP_ArmadilloPlayerStateComponent_C_ClientSetDamageDealt final
{
public:
	float                                         DamageDealt;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArmadilloPlayerStateComponent_C_ClientSetDamageDealt) == 0x000008, "Wrong alignment on BP_ArmadilloPlayerStateComponent_C_ClientSetDamageDealt");
static_assert(sizeof(BP_ArmadilloPlayerStateComponent_C_ClientSetDamageDealt) == 0x000018, "Wrong size on BP_ArmadilloPlayerStateComponent_C_ClientSetDamageDealt");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ClientSetDamageDealt, DamageDealt) == 0x000000, "Member 'BP_ArmadilloPlayerStateComponent_C_ClientSetDamageDealt::DamageDealt' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ClientSetDamageDealt, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_ArmadilloPlayerStateComponent_C_ClientSetDamageDealt::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ClientSetDamageDealt, CallFunc_HasAuthority_ReturnValue) == 0x000010, "Member 'BP_ArmadilloPlayerStateComponent_C_ClientSetDamageDealt::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function BP_ArmadilloPlayerStateComponent.BP_ArmadilloPlayerStateComponent_C.ExecuteUbergraph_BP_ArmadilloPlayerStateComponent
// 0x0328 (0x0328 - 0x0000)
struct BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InEditorOrPIE_ReturnValue;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x0018(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0020(0x0020)(ConstParm)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate; // 0x0044(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_4;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerStateAthena*                 K2Node_DynamicCast_AsFort_Player_State_Athena;     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class APlayerState* Player, class APawn* NewPawn, class APawn* OldPawn)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0074(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_5;          // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class APlayerState* Player, class APawn* NewPawn, class APawn* OldPawn)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0084(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           K2Node_CustomEvent_Player;                         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_NewPawn;                        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_OldPawn;                        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortAthenaLoadout                     CallFunc_GetPawnCosmeticLoadout_ReturnValue;       // 0x00B8(0x0160)(ConstParm)
	bool                                          K2Node_CustomEvent_bIsCritical;                    // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_6;          // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21A[0x2];                                      // 0x021A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Delay;                          // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsPlayerVisible;                // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_222[0x6];                                      // 0x0222(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue; // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_232[0x6];                                      // 0x0232(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_7;          // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_243[0x5];                                      // 0x0243(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Armadillo_PreEventManager_C*        K2Node_DynamicCast_AsBP_Armadillo_Pre_Event_Manager; // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AArmadillo_Mutator_SpecialEvent_C*      CallFunc_GetSpecialEventMutator_Mutator;           // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26A[0x6];                                      // 0x026A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AArmadillo_Mutator_SpecialEvent_C*      K2Node_CustomEvent_Mutator;                        // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AArmadillo_Mutator_SpecialEvent_C* Mutator)> K2Node_CreateDelegate_OutputDelegate_3; // 0x0278(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AArmadillo_Mutator_SpecialEvent_C* Mutator)> K2Node_CreateDelegate_OutputDelegate_4; // 0x0294(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class APlayerState* PlayerState)> K2Node_CreateDelegate_OutputDelegate_5;         // 0x02A4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           K2Node_CustomEvent_PlayerState;                    // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   Temp_object_Variable;                              // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPlaylist*                          Temp_object_Variable_1;                            // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetCurrentPawn_ReturnValue;               // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x02E8(0x0020)()
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AArmadillo_Mutator_SpecialEvent_C* Mutator)> K2Node_CreateDelegate_OutputDelegate_6; // 0x030C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APlayerState* PlayerState)> K2Node_CreateDelegate_OutputDelegate_7;         // 0x0318(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_8;          // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent) == 0x000008, "Wrong alignment on BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent");
static_assert(sizeof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent) == 0x000328, "Wrong size on BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, EntryPoint) == 0x000000, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, CallFunc_InEditorOrPIE_ReturnValue) == 0x000004, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::CallFunc_InEditorOrPIE_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, CallFunc_IsValid_ReturnValue_1) == 0x000006, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, CallFunc_IsDedicatedServer_ReturnValue) == 0x000007, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000008, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, K2Node_CustomEvent_GameState) == 0x000010, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, K2Node_CustomEvent_Playlist) == 0x000018, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, K2Node_CustomEvent_PlaylistContextTags) == 0x000020, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x000040, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000044, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, CallFunc_IsDedicatedServer_ReturnValue_3) == 0x000050, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::CallFunc_IsDedicatedServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, CallFunc_GetOwner_ReturnValue) == 0x000058, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, CallFunc_IsDedicatedServer_ReturnValue_4) == 0x000060, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::CallFunc_IsDedicatedServer_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, K2Node_DynamicCast_AsFort_Player_State_Athena) == 0x000068, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::K2Node_DynamicCast_AsFort_Player_State_Athena' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000074, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, K2Node_Event_EndPlayReason) == 0x000080, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, CallFunc_IsDedicatedServer_ReturnValue_5) == 0x000081, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::CallFunc_IsDedicatedServer_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, K2Node_CreateDelegate_OutputDelegate_2) == 0x000084, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, K2Node_CustomEvent_Player) == 0x000090, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::K2Node_CustomEvent_Player' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, K2Node_CustomEvent_NewPawn) == 0x000098, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::K2Node_CustomEvent_NewPawn' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, K2Node_CustomEvent_OldPawn) == 0x0000A0, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::K2Node_CustomEvent_OldPawn' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x0000A8, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, K2Node_DynamicCast_bSuccess_1) == 0x0000B0, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, CallFunc_GetPawnCosmeticLoadout_ReturnValue) == 0x0000B8, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::CallFunc_GetPawnCosmeticLoadout_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, K2Node_CustomEvent_bIsCritical) == 0x000218, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::K2Node_CustomEvent_bIsCritical' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, CallFunc_IsDedicatedServer_ReturnValue_6) == 0x000219, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::CallFunc_IsDedicatedServer_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, K2Node_CustomEvent_Delay) == 0x00021C, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::K2Node_CustomEvent_Delay' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, K2Node_CustomEvent_IsPlayerVisible) == 0x000220, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::K2Node_CustomEvent_IsPlayerVisible' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, CallFunc_IsValid_ReturnValue_2) == 0x000221, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, CallFunc_GetFirstLocalFortPlayerController_ReturnValue) == 0x000228, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::CallFunc_GetFirstLocalFortPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, CallFunc_IsValid_ReturnValue_3) == 0x000230, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, CallFunc_IsValid_ReturnValue_4) == 0x000231, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, CallFunc_GetOwner_ReturnValue_1) == 0x000238, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000240, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, CallFunc_IsValid_ReturnValue_5) == 0x000241, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, CallFunc_IsDedicatedServer_ReturnValue_7) == 0x000242, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::CallFunc_IsDedicatedServer_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000248, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, K2Node_DynamicCast_AsBP_Armadillo_Pre_Event_Manager) == 0x000250, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::K2Node_DynamicCast_AsBP_Armadillo_Pre_Event_Manager' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, K2Node_DynamicCast_bSuccess_2) == 0x000258, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, CallFunc_GetSpecialEventMutator_Mutator) == 0x000260, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::CallFunc_GetSpecialEventMutator_Mutator' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, CallFunc_IsValid_ReturnValue_6) == 0x000268, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, CallFunc_IsValid_ReturnValue_7) == 0x000269, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, K2Node_CustomEvent_Mutator) == 0x000270, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::K2Node_CustomEvent_Mutator' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, K2Node_CreateDelegate_OutputDelegate_3) == 0x000278, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x000288, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, CallFunc_IsValid_ReturnValue_8) == 0x000290, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, K2Node_CreateDelegate_OutputDelegate_4) == 0x000294, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, CallFunc_IsValid_ReturnValue_9) == 0x0002A0, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, K2Node_CreateDelegate_OutputDelegate_5) == 0x0002A4, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, K2Node_CustomEvent_PlayerState) == 0x0002B0, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::K2Node_CustomEvent_PlayerState' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, Temp_object_Variable) == 0x0002B8, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, CallFunc_GetOwner_ReturnValue_2) == 0x0002C0, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x0002C8, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, Temp_object_Variable_1) == 0x0002D0, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, CallFunc_IsValid_ReturnValue_10) == 0x0002D8, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, CallFunc_GetCurrentPawn_ReturnValue) == 0x0002E0, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::CallFunc_GetCurrentPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, Temp_struct_Variable) == 0x0002E8, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, CallFunc_IsValid_ReturnValue_11) == 0x000308, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, K2Node_CreateDelegate_OutputDelegate_6) == 0x00030C, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, K2Node_CreateDelegate_OutputDelegate_7) == 0x000318, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent, CallFunc_IsDedicatedServer_ReturnValue_8) == 0x000324, "Member 'BP_ArmadilloPlayerStateComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerStateComponent::CallFunc_IsDedicatedServer_ReturnValue_8' has a wrong offset!");

// Function BP_ArmadilloPlayerStateComponent.BP_ArmadilloPlayerStateComponent_C.GetIsInHUDGameplay
// 0x0001 (0x0001 - 0x0000)
struct BP_ArmadilloPlayerStateComponent_C_GetIsInHUDGameplay final
{
public:
	bool                                          bIsInHUDGameplay_0;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArmadilloPlayerStateComponent_C_GetIsInHUDGameplay) == 0x000001, "Wrong alignment on BP_ArmadilloPlayerStateComponent_C_GetIsInHUDGameplay");
static_assert(sizeof(BP_ArmadilloPlayerStateComponent_C_GetIsInHUDGameplay) == 0x000001, "Wrong size on BP_ArmadilloPlayerStateComponent_C_GetIsInHUDGameplay");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_GetIsInHUDGameplay, bIsInHUDGameplay_0) == 0x000000, "Member 'BP_ArmadilloPlayerStateComponent_C_GetIsInHUDGameplay::bIsInHUDGameplay_0' has a wrong offset!");

// Function BP_ArmadilloPlayerStateComponent.BP_ArmadilloPlayerStateComponent_C.HandlePawnSet
// 0x0018 (0x0018 - 0x0000)
struct BP_ArmadilloPlayerStateComponent_C_HandlePawnSet final
{
public:
	class APlayerState*                           Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  NewPawn;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  OldPawn;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArmadilloPlayerStateComponent_C_HandlePawnSet) == 0x000008, "Wrong alignment on BP_ArmadilloPlayerStateComponent_C_HandlePawnSet");
static_assert(sizeof(BP_ArmadilloPlayerStateComponent_C_HandlePawnSet) == 0x000018, "Wrong size on BP_ArmadilloPlayerStateComponent_C_HandlePawnSet");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_HandlePawnSet, Player) == 0x000000, "Member 'BP_ArmadilloPlayerStateComponent_C_HandlePawnSet::Player' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_HandlePawnSet, NewPawn) == 0x000008, "Member 'BP_ArmadilloPlayerStateComponent_C_HandlePawnSet::NewPawn' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_HandlePawnSet, OldPawn) == 0x000010, "Member 'BP_ArmadilloPlayerStateComponent_C_HandlePawnSet::OldPawn' has a wrong offset!");

// Function BP_ArmadilloPlayerStateComponent.BP_ArmadilloPlayerStateComponent_C.HandlePlayerStateLogout
// 0x0008 (0x0008 - 0x0000)
struct BP_ArmadilloPlayerStateComponent_C_HandlePlayerStateLogout final
{
public:
	class APlayerState*                           PlayerState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArmadilloPlayerStateComponent_C_HandlePlayerStateLogout) == 0x000008, "Wrong alignment on BP_ArmadilloPlayerStateComponent_C_HandlePlayerStateLogout");
static_assert(sizeof(BP_ArmadilloPlayerStateComponent_C_HandlePlayerStateLogout) == 0x000008, "Wrong size on BP_ArmadilloPlayerStateComponent_C_HandlePlayerStateLogout");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_HandlePlayerStateLogout, PlayerState) == 0x000000, "Member 'BP_ArmadilloPlayerStateComponent_C_HandlePlayerStateLogout::PlayerState' has a wrong offset!");

// Function BP_ArmadilloPlayerStateComponent.BP_ArmadilloPlayerStateComponent_C.HandleSpecialEventMutatorFound
// 0x0008 (0x0008 - 0x0000)
struct BP_ArmadilloPlayerStateComponent_C_HandleSpecialEventMutatorFound final
{
public:
	class AArmadillo_Mutator_SpecialEvent_C*      Mutator;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArmadilloPlayerStateComponent_C_HandleSpecialEventMutatorFound) == 0x000008, "Wrong alignment on BP_ArmadilloPlayerStateComponent_C_HandleSpecialEventMutatorFound");
static_assert(sizeof(BP_ArmadilloPlayerStateComponent_C_HandleSpecialEventMutatorFound) == 0x000008, "Wrong size on BP_ArmadilloPlayerStateComponent_C_HandleSpecialEventMutatorFound");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_HandleSpecialEventMutatorFound, Mutator) == 0x000000, "Member 'BP_ArmadilloPlayerStateComponent_C_HandleSpecialEventMutatorFound::Mutator' has a wrong offset!");

// Function BP_ArmadilloPlayerStateComponent.BP_ArmadilloPlayerStateComponent_C.InitializeHUDForQTM
// 0x0010 (0x0010 - 0x0000)
struct BP_ArmadilloPlayerStateComponent_C_InitializeHUDForQTM final
{
public:
	class ABP_QTM_Manager_C*                      InQTM;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArmadilloPlayerStateComponent_C_InitializeHUDForQTM) == 0x000008, "Wrong alignment on BP_ArmadilloPlayerStateComponent_C_InitializeHUDForQTM");
static_assert(sizeof(BP_ArmadilloPlayerStateComponent_C_InitializeHUDForQTM) == 0x000010, "Wrong size on BP_ArmadilloPlayerStateComponent_C_InitializeHUDForQTM");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_InitializeHUDForQTM, InQTM) == 0x000000, "Member 'BP_ArmadilloPlayerStateComponent_C_InitializeHUDForQTM::InQTM' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_InitializeHUDForQTM, CallFunc_IsDedicatedServer_ReturnValue) == 0x000008, "Member 'BP_ArmadilloPlayerStateComponent_C_InitializeHUDForQTM::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

// Function BP_ArmadilloPlayerStateComponent.BP_ArmadilloPlayerStateComponent_C.OnReady_2B33366D49358E38337606AF0BD2156B
// 0x0030 (0x0030 - 0x0000)
struct BP_ArmadilloPlayerStateComponent_C_OnReady_2B33366D49358E38337606AF0BD2156B final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_ArmadilloPlayerStateComponent_C_OnReady_2B33366D49358E38337606AF0BD2156B) == 0x000008, "Wrong alignment on BP_ArmadilloPlayerStateComponent_C_OnReady_2B33366D49358E38337606AF0BD2156B");
static_assert(sizeof(BP_ArmadilloPlayerStateComponent_C_OnReady_2B33366D49358E38337606AF0BD2156B) == 0x000030, "Wrong size on BP_ArmadilloPlayerStateComponent_C_OnReady_2B33366D49358E38337606AF0BD2156B");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_OnReady_2B33366D49358E38337606AF0BD2156B, GameState) == 0x000000, "Member 'BP_ArmadilloPlayerStateComponent_C_OnReady_2B33366D49358E38337606AF0BD2156B::GameState' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_OnReady_2B33366D49358E38337606AF0BD2156B, Playlist) == 0x000008, "Member 'BP_ArmadilloPlayerStateComponent_C_OnReady_2B33366D49358E38337606AF0BD2156B::Playlist' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_OnReady_2B33366D49358E38337606AF0BD2156B, PlaylistContextTags) == 0x000010, "Member 'BP_ArmadilloPlayerStateComponent_C_OnReady_2B33366D49358E38337606AF0BD2156B::PlaylistContextTags' has a wrong offset!");

// Function BP_ArmadilloPlayerStateComponent.BP_ArmadilloPlayerStateComponent_C.OnRep_bIsInHUDGameplay
// 0x0001 (0x0001 - 0x0000)
struct BP_ArmadilloPlayerStateComponent_C_OnRep_bIsInHUDGameplay final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArmadilloPlayerStateComponent_C_OnRep_bIsInHUDGameplay) == 0x000001, "Wrong alignment on BP_ArmadilloPlayerStateComponent_C_OnRep_bIsInHUDGameplay");
static_assert(sizeof(BP_ArmadilloPlayerStateComponent_C_OnRep_bIsInHUDGameplay) == 0x000001, "Wrong size on BP_ArmadilloPlayerStateComponent_C_OnRep_bIsInHUDGameplay");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_OnRep_bIsInHUDGameplay, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'BP_ArmadilloPlayerStateComponent_C_OnRep_bIsInHUDGameplay::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

// Function BP_ArmadilloPlayerStateComponent.BP_ArmadilloPlayerStateComponent_C.OnRep_bMainEventStarted
// 0x0001 (0x0001 - 0x0000)
struct BP_ArmadilloPlayerStateComponent_C_OnRep_bMainEventStarted final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArmadilloPlayerStateComponent_C_OnRep_bMainEventStarted) == 0x000001, "Wrong alignment on BP_ArmadilloPlayerStateComponent_C_OnRep_bMainEventStarted");
static_assert(sizeof(BP_ArmadilloPlayerStateComponent_C_OnRep_bMainEventStarted) == 0x000001, "Wrong size on BP_ArmadilloPlayerStateComponent_C_OnRep_bMainEventStarted");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_OnRep_bMainEventStarted, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'BP_ArmadilloPlayerStateComponent_C_OnRep_bMainEventStarted::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

// Function BP_ArmadilloPlayerStateComponent.BP_ArmadilloPlayerStateComponent_C.OnRep_CosmeticLoadout
// 0x0001 (0x0001 - 0x0000)
struct BP_ArmadilloPlayerStateComponent_C_OnRep_CosmeticLoadout final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArmadilloPlayerStateComponent_C_OnRep_CosmeticLoadout) == 0x000001, "Wrong alignment on BP_ArmadilloPlayerStateComponent_C_OnRep_CosmeticLoadout");
static_assert(sizeof(BP_ArmadilloPlayerStateComponent_C_OnRep_CosmeticLoadout) == 0x000001, "Wrong size on BP_ArmadilloPlayerStateComponent_C_OnRep_CosmeticLoadout");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_OnRep_CosmeticLoadout, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'BP_ArmadilloPlayerStateComponent_C_OnRep_CosmeticLoadout::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

// Function BP_ArmadilloPlayerStateComponent.BP_ArmadilloPlayerStateComponent_C.OnRep_EventRelevantPlayerStates
// 0x0001 (0x0001 - 0x0000)
struct BP_ArmadilloPlayerStateComponent_C_OnRep_EventRelevantPlayerStates final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArmadilloPlayerStateComponent_C_OnRep_EventRelevantPlayerStates) == 0x000001, "Wrong alignment on BP_ArmadilloPlayerStateComponent_C_OnRep_EventRelevantPlayerStates");
static_assert(sizeof(BP_ArmadilloPlayerStateComponent_C_OnRep_EventRelevantPlayerStates) == 0x000001, "Wrong size on BP_ArmadilloPlayerStateComponent_C_OnRep_EventRelevantPlayerStates");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_OnRep_EventRelevantPlayerStates, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'BP_ArmadilloPlayerStateComponent_C_OnRep_EventRelevantPlayerStates::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

// Function BP_ArmadilloPlayerStateComponent.BP_ArmadilloPlayerStateComponent_C.OnRep_PlayerIndex
// 0x0050 (0x0050 - 0x0000)
struct BP_ArmadilloPlayerStateComponent_C_OnRep_PlayerIndex final
{
public:
	class FString                                 CallFunc_GetOwningPlayerName_Name;                 // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArmadilloPlayerStateComponent_C_OnRep_PlayerIndex) == 0x000008, "Wrong alignment on BP_ArmadilloPlayerStateComponent_C_OnRep_PlayerIndex");
static_assert(sizeof(BP_ArmadilloPlayerStateComponent_C_OnRep_PlayerIndex) == 0x000050, "Wrong size on BP_ArmadilloPlayerStateComponent_C_OnRep_PlayerIndex");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_OnRep_PlayerIndex, CallFunc_GetOwningPlayerName_Name) == 0x000000, "Member 'BP_ArmadilloPlayerStateComponent_C_OnRep_PlayerIndex::CallFunc_GetOwningPlayerName_Name' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_OnRep_PlayerIndex, CallFunc_Concat_StrStr_ReturnValue) == 0x000010, "Member 'BP_ArmadilloPlayerStateComponent_C_OnRep_PlayerIndex::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_OnRep_PlayerIndex, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000020, "Member 'BP_ArmadilloPlayerStateComponent_C_OnRep_PlayerIndex::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_OnRep_PlayerIndex, CallFunc_Conv_IntToString_ReturnValue) == 0x000030, "Member 'BP_ArmadilloPlayerStateComponent_C_OnRep_PlayerIndex::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_OnRep_PlayerIndex, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000040, "Member 'BP_ArmadilloPlayerStateComponent_C_OnRep_PlayerIndex::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");

// Function BP_ArmadilloPlayerStateComponent.BP_ArmadilloPlayerStateComponent_C.OnRep_TogglePlayerVisibility
// 0x0020 (0x0020 - 0x0000)
struct BP_ArmadilloPlayerStateComponent_C_OnRep_TogglePlayerVisibility final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPawn_ReturnValue;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArmadilloPlayerStateComponent_C_OnRep_TogglePlayerVisibility) == 0x000008, "Wrong alignment on BP_ArmadilloPlayerStateComponent_C_OnRep_TogglePlayerVisibility");
static_assert(sizeof(BP_ArmadilloPlayerStateComponent_C_OnRep_TogglePlayerVisibility) == 0x000020, "Wrong size on BP_ArmadilloPlayerStateComponent_C_OnRep_TogglePlayerVisibility");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_OnRep_TogglePlayerVisibility, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'BP_ArmadilloPlayerStateComponent_C_OnRep_TogglePlayerVisibility::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_OnRep_TogglePlayerVisibility, CallFunc_GetPawn_ReturnValue) == 0x000008, "Member 'BP_ArmadilloPlayerStateComponent_C_OnRep_TogglePlayerVisibility::CallFunc_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_OnRep_TogglePlayerVisibility, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000010, "Member 'BP_ArmadilloPlayerStateComponent_C_OnRep_TogglePlayerVisibility::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_OnRep_TogglePlayerVisibility, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_ArmadilloPlayerStateComponent_C_OnRep_TogglePlayerVisibility::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_ArmadilloPlayerStateComponent.BP_ArmadilloPlayerStateComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_ArmadilloPlayerStateComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArmadilloPlayerStateComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_ArmadilloPlayerStateComponent_C_ReceiveEndPlay");
static_assert(sizeof(BP_ArmadilloPlayerStateComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_ArmadilloPlayerStateComponent_C_ReceiveEndPlay");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_ArmadilloPlayerStateComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_ArmadilloPlayerStateComponent.BP_ArmadilloPlayerStateComponent_C.RequestHUDVisibility
// 0x0003 (0x0003 - 0x0000)
struct BP_ArmadilloPlayerStateComponent_C_RequestHUDVisibility final
{
public:
	bool                                          bShouldBeVisible;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldAnimateIntro;                               // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArmadilloPlayerStateComponent_C_RequestHUDVisibility) == 0x000001, "Wrong alignment on BP_ArmadilloPlayerStateComponent_C_RequestHUDVisibility");
static_assert(sizeof(BP_ArmadilloPlayerStateComponent_C_RequestHUDVisibility) == 0x000003, "Wrong size on BP_ArmadilloPlayerStateComponent_C_RequestHUDVisibility");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_RequestHUDVisibility, bShouldBeVisible) == 0x000000, "Member 'BP_ArmadilloPlayerStateComponent_C_RequestHUDVisibility::bShouldBeVisible' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_RequestHUDVisibility, bShouldAnimateIntro) == 0x000001, "Member 'BP_ArmadilloPlayerStateComponent_C_RequestHUDVisibility::bShouldAnimateIntro' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_RequestHUDVisibility, CallFunc_IsDedicatedServer_ReturnValue) == 0x000002, "Member 'BP_ArmadilloPlayerStateComponent_C_RequestHUDVisibility::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

// Function BP_ArmadilloPlayerStateComponent.BP_ArmadilloPlayerStateComponent_C.RequestZoomTargetTransition
// 0x0001 (0x0001 - 0x0000)
struct BP_ArmadilloPlayerStateComponent_C_RequestZoomTargetTransition final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArmadilloPlayerStateComponent_C_RequestZoomTargetTransition) == 0x000001, "Wrong alignment on BP_ArmadilloPlayerStateComponent_C_RequestZoomTargetTransition");
static_assert(sizeof(BP_ArmadilloPlayerStateComponent_C_RequestZoomTargetTransition) == 0x000001, "Wrong size on BP_ArmadilloPlayerStateComponent_C_RequestZoomTargetTransition");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_RequestZoomTargetTransition, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'BP_ArmadilloPlayerStateComponent_C_RequestZoomTargetTransition::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

// Function BP_ArmadilloPlayerStateComponent.BP_ArmadilloPlayerStateComponent_C.ResetPlayerIndex
// 0x0001 (0x0001 - 0x0000)
struct BP_ArmadilloPlayerStateComponent_C_ResetPlayerIndex final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArmadilloPlayerStateComponent_C_ResetPlayerIndex) == 0x000001, "Wrong alignment on BP_ArmadilloPlayerStateComponent_C_ResetPlayerIndex");
static_assert(sizeof(BP_ArmadilloPlayerStateComponent_C_ResetPlayerIndex) == 0x000001, "Wrong size on BP_ArmadilloPlayerStateComponent_C_ResetPlayerIndex");
static_assert(offsetof(BP_ArmadilloPlayerStateComponent_C_ResetPlayerIndex, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'BP_ArmadilloPlayerStateComponent_C_ResetPlayerIndex::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

// Function BP_ArmadilloPlayerStateComponent.BP_ArmadilloPlayerStateComponent_C.ServerTogglePlayerVisibility
// 0x0002 (0x0002 - 0x0000)
struct BP_ArmadilloPlayerStateComponent_C_ServerTogglePlayerVisibility final
{
public:
