#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ArmadilloPlayerPawnComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ArmadilloPlayerPawnComponent.BP_ArmadilloPlayerPawnComponent_C.ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent
// 0x0108 (0x0108 - 0x0000)
struct BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerNameSafe_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSignificantForSpecialEventSequence_ReturnValue; // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         CallFunc_GetSkeletalMeshesForAllParts_ReturnValue; // 0x00A0(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B6[0x2];                                       // 0x00B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_1;           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_GetSkeletalMeshesForAllParts_ReturnValue_1; // 0x00D8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F6[0x2];                                       // 0x00F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent) == 0x000008, "Wrong alignment on BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent");
static_assert(sizeof(BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent) == 0x000108, "Wrong size on BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent, EntryPoint) == 0x000000, "Member 'BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent, CallFunc_IsDedicatedServer_ReturnValue) == 0x000008, "Member 'BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x000018, "Member 'BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent, CallFunc_GetPlayerNameSafe_ReturnValue) == 0x000028, "Member 'BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent::CallFunc_GetPlayerNameSafe_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent, CallFunc_IsSignificantForSpecialEventSequence_ReturnValue) == 0x000038, "Member 'BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent::CallFunc_IsSignificantForSpecialEventSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent, CallFunc_Not_PreBool_ReturnValue) == 0x000039, "Member 'BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent, CallFunc_Conv_BoolToString_ReturnValue) == 0x000040, "Member 'BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent, CallFunc_GetOwner_ReturnValue_1) == 0x000050, "Member 'BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent, CallFunc_Concat_StrStr_ReturnValue) == 0x000058, "Member 'BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000068, "Member 'BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000078, "Member 'BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000090, "Member 'BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent, CallFunc_GetSkeletalMeshesForAllParts_ReturnValue) == 0x0000A0, "Member 'BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent::CallFunc_GetSkeletalMeshesForAllParts_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent, CallFunc_Array_Length_ReturnValue) == 0x0000B0, "Member 'BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent, CallFunc_Greater_IntInt_ReturnValue) == 0x0000B4, "Member 'BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x0000B5, "Member 'BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent, CallFunc_GetOwner_ReturnValue_2) == 0x0000B8, "Member 'BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent, Temp_int_Loop_Counter_Variable) == 0x0000C0, "Member 'BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent, K2Node_DynamicCast_AsFort_Player_Pawn_1) == 0x0000C8, "Member 'BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent::K2Node_DynamicCast_AsFort_Player_Pawn_1' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent, K2Node_DynamicCast_bSuccess_2) == 0x0000D0, "Member 'BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent, CallFunc_IsValid_ReturnValue_1) == 0x0000D1, "Member 'BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent, CallFunc_GetSkeletalMeshesForAllParts_ReturnValue_1) == 0x0000D8, "Member 'BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent::CallFunc_GetSkeletalMeshesForAllParts_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent, CallFunc_Array_Get_Item) == 0x0000E8, "Member 'BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent, CallFunc_Array_Length_ReturnValue_1) == 0x0000F0, "Member 'BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent, CallFunc_Less_IntInt_ReturnValue) == 0x0000F4, "Member 'BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent, CallFunc_IsValid_ReturnValue_2) == 0x0000F5, "Member 'BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent, CallFunc_Array_Length_ReturnValue_2) == 0x0000F8, "Member 'BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0000FC, "Member 'BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent, CallFunc_Add_IntInt_ReturnValue) == 0x000100, "Member 'BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x000104, "Member 'BP_ArmadilloPlayerPawnComponent_C_ExecuteUbergraph_BP_ArmadilloPlayerPawnComponent::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");

// Function BP_ArmadilloPlayerPawnComponent.BP_ArmadilloPlayerPawnComponent_C.OnRep_PausePlayerAnims
// 0x0070 (0x0070 - 0x0000)
struct BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_GetSkeletalMeshesForAllParts_ReturnValue; // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims) == 0x000008, "Wrong alignment on BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims");
static_assert(sizeof(BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims) == 0x000070, "Wrong size on BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims, CallFunc_IsDedicatedServer_ReturnValue) == 0x000010, "Member 'BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000028, "Member 'BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims, CallFunc_GetSkeletalMeshesForAllParts_ReturnValue) == 0x000048, "Member 'BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims::CallFunc_GetSkeletalMeshesForAllParts_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims, CallFunc_Array_Get_Item) == 0x000058, "Member 'BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims, CallFunc_IsValid_ReturnValue_2) == 0x000065, "Member 'BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims, CallFunc_Array_Length_ReturnValue_1) == 0x000068, "Member 'BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims, CallFunc_Greater_IntInt_ReturnValue) == 0x00006C, "Member 'BP_ArmadilloPlayerPawnComponent_C_OnRep_PausePlayerAnims::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

}

