#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattleStarModal

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BattleStarModal.BP_BattleStarModal_C.ExecuteUbergraph_BP_BattleStarModal
// 0x0578 (0x0578 - 0x0000)
struct BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm)
	class UFortBattlePassContext*                 CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0020(0x0018)()
	class FText                                   CallFunc_GetLevelPurchaseDisclaimerText_ReturnValue; // 0x0038(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0050(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0068(0x0018)()
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0088(0x0018)()
	bool                                          Temp_bool_Variable_2;                              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_NewPrice;                             // 0x00A4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NewAmount;                            // 0x00A8(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_LevelsLeft;                           // 0x00AC(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00C8(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0118(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0168(0x0010)(ReferenceParm)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0180(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_2;            // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01B8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x01D0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0220(0x0010)(ReferenceParm)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0238(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_3;             // 0x0258(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_4;             // 0x0270(0x0018)()
	int32                                         Temp_int_Variable;                                 // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x02A0(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x02B8(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x02D0(0x0018)()
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x02F0(0x0050)(HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0348(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x0358(0x0018)()
	bool                                          Temp_bool_Variable_3;                              // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0372(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0373(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0375(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_376[0x2];                                      // 0x0376(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_3;            // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0380(0x0050)(HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_4;                          // 0x03D8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_4;                     // 0x03E8(0x0018)()
	int32                                         K2Node_CustomEvent_LevelsPurchase;                 // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0404(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_405[0x3];                                      // 0x0405(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_2;                           // 0x0410(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0430(0x0050)(HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_484[0x4];                                      // 0x0484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_5;                          // 0x0488(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_5;             // 0x0498(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_5;                     // 0x04B0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x04C8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_6;                          // 0x0518(0x0010)(ReferenceParm)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_529[0x7];                                      // 0x0529(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_6;                     // 0x0530(0x0018)()
	bool                                          CallFunc_InRange_IntInt_ReturnValue;               // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0549(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x054A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x054B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsReloadMtxEnabled_ReturnValue;           // 0x054C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54D[0x3];                                      // 0x054D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0554(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_6;             // 0x0558(0x0018)()
	int32                                         K2Node_Select_Default_5;                           // 0x0570(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal) == 0x000008, "Wrong alignment on BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal");
static_assert(sizeof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal) == 0x000578, "Wrong size on BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, EntryPoint) == 0x000000, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, Temp_bool_Variable) == 0x000004, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, Temp_bool_Variable_1) == 0x000005, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, Temp_byte_Variable) == 0x000006, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, Temp_byte_Variable_1) == 0x000007, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_MakeArray_Array) == 0x000008, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Format_ReturnValue) == 0x000020, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_GetLevelPurchaseDisclaimerText_ReturnValue) == 0x000038, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_GetLevelPurchaseDisclaimerText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Conv_IntToText_ReturnValue) == 0x000050, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000068, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, Temp_byte_Variable_2) == 0x000080, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, Temp_byte_Variable_3) == 0x000081, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Add_IntInt_ReturnValue) == 0x000084, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Conv_IntToText_ReturnValue_2) == 0x000088, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, Temp_bool_Variable_2) == 0x0000A0, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_Event_NewPrice) == 0x0000A4, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_Event_NewPrice' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_Event_NewAmount) == 0x0000A8, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_Event_NewAmount' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_Event_LevelsLeft) == 0x0000AC, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_Event_LevelsLeft' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Greater_IntInt_ReturnValue) == 0x0000B0, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Conv_IntToInt64_ReturnValue) == 0x0000B8, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x0000C0, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_MakeStruct_FormatArgumentData) == 0x0000C8, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_MakeStruct_FormatArgumentData_1) == 0x000118, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_MakeArray_Array_1) == 0x000168, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000178, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Format_ReturnValue_1) == 0x000180, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Add_IntInt_ReturnValue_1) == 0x000198, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Multiply_IntInt_ReturnValue) == 0x00019C, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Conv_IntToString_ReturnValue) == 0x0001A0, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Conv_IntToInt64_ReturnValue_2) == 0x0001B0, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Conv_IntToInt64_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Conv_StringToText_ReturnValue) == 0x0001B8, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_MakeStruct_FormatArgumentData_2) == 0x0001D0, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_MakeArray_Array_2) == 0x000220, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000230, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Format_ReturnValue_2) == 0x000238, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Add_IntInt_ReturnValue_2) == 0x000250, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Conv_IntToText_ReturnValue_3) == 0x000258, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Conv_IntToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Conv_IntToText_ReturnValue_4) == 0x000270, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Conv_IntToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, Temp_int_Variable) == 0x000288, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_PlayAnimationForward_ReturnValue) == 0x000290, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_Event_IsDesignTime) == 0x000298, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_MakeLiteralText_ReturnValue) == 0x0002A0, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_MakeLiteralText_ReturnValue_1) == 0x0002B8, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_Select_Default) == 0x0002D0, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Multiply_IntInt_ReturnValue_1) == 0x0002E8, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Multiply_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_MakeStruct_FormatArgumentData_3) == 0x0002F0, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Subtract_IntInt_ReturnValue) == 0x000340, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_MakeArray_Array_3) == 0x000348, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Format_ReturnValue_3) == 0x000358, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Format_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, Temp_bool_Variable_3) == 0x000370, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Less_IntInt_ReturnValue) == 0x000371, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, Temp_byte_Variable_4) == 0x000372, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000373, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, Temp_byte_Variable_5) == 0x000374, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, Temp_bool_Variable_4) == 0x000375, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Conv_IntToInt64_ReturnValue_3) == 0x000378, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Conv_IntToInt64_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_MakeStruct_FormatArgumentData_4) == 0x000380, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_Select_Default_1) == 0x0003D0, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_MakeArray_Array_4) == 0x0003D8, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Format_ReturnValue_4) == 0x0003E8, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Format_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_CustomEvent_LevelsPurchase) == 0x000400, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_CustomEvent_LevelsPurchase' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, Temp_bool_Variable_5) == 0x000404, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Add_IntInt_ReturnValue_3) == 0x000408, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Divide_IntInt_ReturnValue) == 0x00040C, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_Select_Default_2) == 0x000410, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Add_IntInt_ReturnValue_4) == 0x000428, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_MakeStruct_FormatArgumentData_5) == 0x000430, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Clamp_ReturnValue) == 0x000480, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_MakeArray_Array_5) == 0x000488, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_MakeArray_Array_5' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Conv_IntToText_ReturnValue_5) == 0x000498, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Conv_IntToText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Format_ReturnValue_5) == 0x0004B0, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Format_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_MakeStruct_FormatArgumentData_6) == 0x0004C8, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_MakeStruct_FormatArgumentData_6' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_MakeArray_Array_6) == 0x000518, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_MakeArray_Array_6' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000528, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Format_ReturnValue_6) == 0x000530, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Format_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_InRange_IntInt_ReturnValue) == 0x000548, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_InRange_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_Select_Default_3) == 0x000549, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Less_IntInt_ReturnValue_1) == 0x00054A, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_Select_Default_4) == 0x00054B, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_IsReloadMtxEnabled_ReturnValue) == 0x00054C, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_IsReloadMtxEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Add_IntInt_ReturnValue_5) == 0x000550, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_SelectInt_ReturnValue) == 0x000554, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, CallFunc_Conv_IntToText_ReturnValue_6) == 0x000558, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::CallFunc_Conv_IntToText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal, K2Node_Select_Default_5) == 0x000570, "Member 'BP_BattleStarModal_C_ExecuteUbergraph_BP_BattleStarModal::K2Node_Select_Default_5' has a wrong offset!");

// Function BP_BattleStarModal.BP_BattleStarModal_C.OnPurchaseAmountChanged
// 0x0008 (0x0008 - 0x0000)
struct BP_BattleStarModal_C_OnPurchaseAmountChanged final
{
public:
	int32                                         NewAmount;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LevelsLeft;                                        // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleStarModal_C_OnPurchaseAmountChanged) == 0x000004, "Wrong alignment on BP_BattleStarModal_C_OnPurchaseAmountChanged");
static_assert(sizeof(BP_BattleStarModal_C_OnPurchaseAmountChanged) == 0x000008, "Wrong size on BP_BattleStarModal_C_OnPurchaseAmountChanged");
static_assert(offsetof(BP_BattleStarModal_C_OnPurchaseAmountChanged, NewAmount) == 0x000000, "Member 'BP_BattleStarModal_C_OnPurchaseAmountChanged::NewAmount' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_OnPurchaseAmountChanged, LevelsLeft) == 0x000004, "Member 'BP_BattleStarModal_C_OnPurchaseAmountChanged::LevelsLeft' has a wrong offset!");

// Function BP_BattleStarModal.BP_BattleStarModal_C.OnTotalPriceChanged
// 0x0004 (0x0004 - 0x0000)
struct BP_BattleStarModal_C_OnTotalPriceChanged final
{
public:
	int32                                         NewPrice;                                          // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleStarModal_C_OnTotalPriceChanged) == 0x000004, "Wrong alignment on BP_BattleStarModal_C_OnTotalPriceChanged");
static_assert(sizeof(BP_BattleStarModal_C_OnTotalPriceChanged) == 0x000004, "Wrong size on BP_BattleStarModal_C_OnTotalPriceChanged");
static_assert(offsetof(BP_BattleStarModal_C_OnTotalPriceChanged, NewPrice) == 0x000000, "Member 'BP_BattleStarModal_C_OnTotalPriceChanged::NewPrice' has a wrong offset!");

// Function BP_BattleStarModal.BP_BattleStarModal_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_BattleStarModal_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleStarModal_C_PreConstruct) == 0x000001, "Wrong alignment on BP_BattleStarModal_C_PreConstruct");
static_assert(sizeof(BP_BattleStarModal_C_PreConstruct) == 0x000001, "Wrong size on BP_BattleStarModal_C_PreConstruct");
static_assert(offsetof(BP_BattleStarModal_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_BattleStarModal_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_BattleStarModal.BP_BattleStarModal_C.Randomize stars hovering
// 0x0028 (0x0028 - 0x0000)
struct BP_BattleStarModal_C_Randomize_stars_hovering final
{
public:
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleStarModal_C_Randomize_stars_hovering) == 0x000008, "Wrong alignment on BP_BattleStarModal_C_Randomize_stars_hovering");
static_assert(sizeof(BP_BattleStarModal_C_Randomize_stars_hovering) == 0x000028, "Wrong size on BP_BattleStarModal_C_Randomize_stars_hovering");
static_assert(offsetof(BP_BattleStarModal_C_Randomize_stars_hovering, CallFunc_RandomFloatInRange_ReturnValue) == 0x000000, "Member 'BP_BattleStarModal_C_Randomize_stars_hovering::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_Randomize_stars_hovering, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000004, "Member 'BP_BattleStarModal_C_Randomize_stars_hovering::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_Randomize_stars_hovering, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'BP_BattleStarModal_C_Randomize_stars_hovering::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_Randomize_stars_hovering, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000010, "Member 'BP_BattleStarModal_C_Randomize_stars_hovering::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_Randomize_stars_hovering, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000018, "Member 'BP_BattleStarModal_C_Randomize_stars_hovering::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BattleStarModal_C_Randomize_stars_hovering, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000020, "Member 'BP_BattleStarModal_C_Randomize_stars_hovering::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");

// Function BP_BattleStarModal.BP_BattleStarModal_C.UpdatePageUnlockText
// 0x0004 (0x0004 - 0x0000)
struct BP_BattleStarModal_C_UpdatePageUnlockText final
{
public:
	int32                                         LevelsPurchase;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleStarModal_C_UpdatePageUnlockText) == 0x000004, "Wrong alignment on BP_BattleStarModal_C_UpdatePageUnlockText");
static_assert(sizeof(BP_BattleStarModal_C_UpdatePageUnlockText) == 0x000004, "Wrong size on BP_BattleStarModal_C_UpdatePageUnlockText");
static_assert(offsetof(BP_BattleStarModal_C_UpdatePageUnlockText, LevelsPurchase) == 0x000000, "Member 'BP_BattleStarModal_C_UpdatePageUnlockText::LevelsPurchase' has a wrong offset!");

}

