#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Frontend_EventLevel_NavObject_MapTable_Fixed

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Frontend_EventLevel_NavObject_MapTable_Fixed.BP_Frontend_EventLevel_NavObject_MapTable_Fixed_C
// 0x0048 (0x02B8 - 0x0270)
class ABP_Frontend_EventLevel_NavObject_MapTable_Fixed_C final : public AActor
{
public:
	class UAudioComponent*                        Armadillo_Bridge_Holo_Loop_Cue;                    // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh3;                                       // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   sm_spybase_table_holo_ring_fx;                     // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Cylinder_Floor_Pad_Glow;                        // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   sm_spybase_table_holo_ring_lights_meshsprites_fx;  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Frontend_EventLevel_NavObject_MapTable_Fixed_C">();
	}
	static class ABP_Frontend_EventLevel_NavObject_MapTable_Fixed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Frontend_EventLevel_NavObject_MapTable_Fixed_C>();
	}
};
static_assert(alignof(ABP_Frontend_EventLevel_NavObject_MapTable_Fixed_C) == 0x000008, "Wrong alignment on ABP_Frontend_EventLevel_NavObject_MapTable_Fixed_C");
static_assert(sizeof(ABP_Frontend_EventLevel_NavObject_MapTable_Fixed_C) == 0x0002B8, "Wrong size on ABP_Frontend_EventLevel_NavObject_MapTable_Fixed_C");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_MapTable_Fixed_C, Armadillo_Bridge_Holo_Loop_Cue) == 0x000270, "Member 'ABP_Frontend_EventLevel_NavObject_MapTable_Fixed_C::Armadillo_Bridge_Holo_Loop_Cue' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_MapTable_Fixed_C, StaticMesh3) == 0x000278, "Member 'ABP_Frontend_EventLevel_NavObject_MapTable_Fixed_C::StaticMesh3' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_MapTable_Fixed_C, StaticMesh2) == 0x000280, "Member 'ABP_Frontend_EventLevel_NavObject_MapTable_Fixed_C::StaticMesh2' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_MapTable_Fixed_C, sm_spybase_table_holo_ring_fx) == 0x000288, "Member 'ABP_Frontend_EventLevel_NavObject_MapTable_Fixed_C::sm_spybase_table_holo_ring_fx' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_MapTable_Fixed_C, StaticMesh1) == 0x000290, "Member 'ABP_Frontend_EventLevel_NavObject_MapTable_Fixed_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_MapTable_Fixed_C, StaticMesh) == 0x000298, "Member 'ABP_Frontend_EventLevel_NavObject_MapTable_Fixed_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_MapTable_Fixed_C, SM_Cylinder_Floor_Pad_Glow) == 0x0002A0, "Member 'ABP_Frontend_EventLevel_NavObject_MapTable_Fixed_C::SM_Cylinder_Floor_Pad_Glow' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_MapTable_Fixed_C, sm_spybase_table_holo_ring_lights_meshsprites_fx) == 0x0002A8, "Member 'ABP_Frontend_EventLevel_NavObject_MapTable_Fixed_C::sm_spybase_table_holo_ring_lights_meshsprites_fx' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_MapTable_Fixed_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABP_Frontend_EventLevel_NavObject_MapTable_Fixed_C::DefaultSceneRoot' has a wrong offset!");

}

