#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Generic_TimerManager

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Generic_TimerManager.BP_Generic_TimerManager_C
// 0x00C8 (0x0338 - 0x0270)
class ABP_Generic_TimerManager_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ServerWorldSecondsAtEvent;                         // 0x0280(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	int32                                         TimeOffsetSeconds;                                 // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CountDownTimerAccuracyfix;                         // 0x0288(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              TimeUntilCountdownEnd;                             // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         SecondsRemaining;                                  // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              TimespanRemaining;                                 // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FString                                 CalendarEventName;                                 // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FTimerHandle                           CountdownTimerHandle;                              // 0x02B8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Phase3VisualDuration;                              // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(int32 SecondsRemaining)> OnSecondsRemainingUpdated;                // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              FadeOut;                                           // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(int32 NewTimerState)> OnTimerStateChange;                          // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         CurrentState;                                      // 0x02F8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 TimerStatesSecondsRemaining;                       // 0x0300(0x0010)(Edit, BlueprintVisible)
	TMulticastInlineDelegate<void()>              OnTimerActive;                                     // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnTimerFinished;                                   // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bTimerActive;                                      // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bTimerFinished;                                    // 0x0331(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFrontend;                                       // 0x0332(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FakeTimer;                                         // 0x0333(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FakeTimerOffset;                                   // 0x0334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void VisualUpdateEverySecond();
	void UseFakeTimer(float CountdownTime);
	void UpdateStage();
	void TimerFinished();
	void StartFinalAccuracyadjustment();
	void Set_Fake_Timer_Offset();
	void ReceiveBeginPlay();
	void OnRep_ServerWorldSecondsAtEvent();
	void OnRep_CurrentState();
	void OnRep_bTimerFinished();
	void OnRep_bIsActive();
	void OnReady_B337321A443C013690B7869DF30E5BCC(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void OnReady_5CD17C734C5C64794A8D0BA05D00B72C();
	void OnEventUpdated_60E8057840996C096DE192A0F298D20C(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio);
	void OnEventEnded_60E8057840996C096DE192A0F298D20C(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio);
	void OnEventActive_60E8057840996C096DE192A0F298D20C(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio);
	void ExecuteUbergraph_BP_Generic_TimerManager(int32 EntryPoint);
	void ErrorCorrection();
	void DebugCountdown(float Server_Seconds);
	void CountdownTimer_New();
	void CountDownTimer_AccuracyFix();
	void ContinueClockCountdown();
	void ClearTimerVisuals();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Generic_TimerManager_C">();
	}
	static class ABP_Generic_TimerManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Generic_TimerManager_C>();
	}
};
static_assert(alignof(ABP_Generic_TimerManager_C) == 0x000008, "Wrong alignment on ABP_Generic_TimerManager_C");
static_assert(sizeof(ABP_Generic_TimerManager_C) == 0x000338, "Wrong size on ABP_Generic_TimerManager_C");
static_assert(offsetof(ABP_Generic_TimerManager_C, UberGraphFrame) == 0x000270, "Member 'ABP_Generic_TimerManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Generic_TimerManager_C, DefaultSceneRoot) == 0x000278, "Member 'ABP_Generic_TimerManager_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Generic_TimerManager_C, ServerWorldSecondsAtEvent) == 0x000280, "Member 'ABP_Generic_TimerManager_C::ServerWorldSecondsAtEvent' has a wrong offset!");
static_assert(offsetof(ABP_Generic_TimerManager_C, TimeOffsetSeconds) == 0x000284, "Member 'ABP_Generic_TimerManager_C::TimeOffsetSeconds' has a wrong offset!");
static_assert(offsetof(ABP_Generic_TimerManager_C, CountDownTimerAccuracyfix) == 0x000288, "Member 'ABP_Generic_TimerManager_C::CountDownTimerAccuracyfix' has a wrong offset!");
static_assert(offsetof(ABP_Generic_TimerManager_C, TimeUntilCountdownEnd) == 0x000290, "Member 'ABP_Generic_TimerManager_C::TimeUntilCountdownEnd' has a wrong offset!");
static_assert(offsetof(ABP_Generic_TimerManager_C, SecondsRemaining) == 0x000298, "Member 'ABP_Generic_TimerManager_C::SecondsRemaining' has a wrong offset!");
static_assert(offsetof(ABP_Generic_TimerManager_C, TimespanRemaining) == 0x0002A0, "Member 'ABP_Generic_TimerManager_C::TimespanRemaining' has a wrong offset!");
static_assert(offsetof(ABP_Generic_TimerManager_C, CalendarEventName) == 0x0002A8, "Member 'ABP_Generic_TimerManager_C::CalendarEventName' has a wrong offset!");
static_assert(offsetof(ABP_Generic_TimerManager_C, CountdownTimerHandle) == 0x0002B8, "Member 'ABP_Generic_TimerManager_C::CountdownTimerHandle' has a wrong offset!");
static_assert(offsetof(ABP_Generic_TimerManager_C, Phase3VisualDuration) == 0x0002C0, "Member 'ABP_Generic_TimerManager_C::Phase3VisualDuration' has a wrong offset!");
static_assert(offsetof(ABP_Generic_TimerManager_C, OnSecondsRemainingUpdated) == 0x0002C8, "Member 'ABP_Generic_TimerManager_C::OnSecondsRemainingUpdated' has a wrong offset!");
static_assert(offsetof(ABP_Generic_TimerManager_C, FadeOut) == 0x0002D8, "Member 'ABP_Generic_TimerManager_C::FadeOut' has a wrong offset!");
static_assert(offsetof(ABP_Generic_TimerManager_C, OnTimerStateChange) == 0x0002E8, "Member 'ABP_Generic_TimerManager_C::OnTimerStateChange' has a wrong offset!");
static_assert(offsetof(ABP_Generic_TimerManager_C, CurrentState) == 0x0002F8, "Member 'ABP_Generic_TimerManager_C::CurrentState' has a wrong offset!");
static_assert(offsetof(ABP_Generic_TimerManager_C, TimerStatesSecondsRemaining) == 0x000300, "Member 'ABP_Generic_TimerManager_C::TimerStatesSecondsRemaining' has a wrong offset!");
static_assert(offsetof(ABP_Generic_TimerManager_C, OnTimerActive) == 0x000310, "Member 'ABP_Generic_TimerManager_C::OnTimerActive' has a wrong offset!");
static_assert(offsetof(ABP_Generic_TimerManager_C, OnTimerFinished) == 0x000320, "Member 'ABP_Generic_TimerManager_C::OnTimerFinished' has a wrong offset!");
static_assert(offsetof(ABP_Generic_TimerManager_C, bTimerActive) == 0x000330, "Member 'ABP_Generic_TimerManager_C::bTimerActive' has a wrong offset!");
static_assert(offsetof(ABP_Generic_TimerManager_C, bTimerFinished) == 0x000331, "Member 'ABP_Generic_TimerManager_C::bTimerFinished' has a wrong offset!");
static_assert(offsetof(ABP_Generic_TimerManager_C, bIsFrontend) == 0x000332, "Member 'ABP_Generic_TimerManager_C::bIsFrontend' has a wrong offset!");
static_assert(offsetof(ABP_Generic_TimerManager_C, FakeTimer) == 0x000333, "Member 'ABP_Generic_TimerManager_C::FakeTimer' has a wrong offset!");
static_assert(offsetof(ABP_Generic_TimerManager_C, FakeTimerOffset) == 0x000334, "Member 'ABP_Generic_TimerManager_C::FakeTimerOffset' has a wrong offset!");

}

