#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HoldableButton_BuyLevel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_HoldableButton_BuyLevel.BP_HoldableButton_BuyLevel_C
// 0x00A0 (0x10C0 - 0x1020)
class UBP_HoldableButton_BuyLevel_C final : public UFortHoldableButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1020(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoldCompleted;                                     // 0x1028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoldProgress;                                      // 0x1030(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x1038(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       Button_text;                                       // 0x1040(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_material;                                    // 0x1048(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x1050(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Subtitle;                                     // 0x1058(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    UnbindedInputActionWidget;                         // 0x1060(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   In_Text;                                           // 0x1068(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	float                                         In_Width_Override;                                 // 0x1080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_1084[0x4];                                     // 0x1084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Material;                                          // 0x1088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               HoldProgressDMI;                                   // 0x1090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Size;                                              // 0x1098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         In_Height_Override;                                // 0x109C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UAudioComponent*                        FillingSoundAudioComponent;                        // 0x10A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             FillingSoundOverride;                              // 0x10A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             FillCompleteSoundOverride;                         // 0x10B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHoldCompleted();
	void BP_OnHoldDecreased(const float HoldPercentage);
	void BP_OnHoldEnded(const float HoldPercentage, const bool bInUseSecondaryHoldAnimation);
	void BP_OnHoldIncreased(const float HoldPercentage);
	void BP_OnHoldReset();
	void BP_OnHoldStarted(const float HoldPercentage, const bool bInUseSecondaryHoldAnimation);
	void BP_OnHovered();
	void BP_OnPressed();
	void BP_OnUnhovered();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_BP_HoldableButton_BuyLevel(int32 EntryPoint);
	void FillComplete();
	void PlayFillSound();
	void PreConstruct(bool IsDesignTime);
	void StopFillSound();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HoldableButton_BuyLevel_C">();
	}
	static class UBP_HoldableButton_BuyLevel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_HoldableButton_BuyLevel_C>();
	}
};
static_assert(alignof(UBP_HoldableButton_BuyLevel_C) == 0x000010, "Wrong alignment on UBP_HoldableButton_BuyLevel_C");
static_assert(sizeof(UBP_HoldableButton_BuyLevel_C) == 0x0010C0, "Wrong size on UBP_HoldableButton_BuyLevel_C");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, UberGraphFrame) == 0x001020, "Member 'UBP_HoldableButton_BuyLevel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, HoldCompleted) == 0x001028, "Member 'UBP_HoldableButton_BuyLevel_C::HoldCompleted' has a wrong offset!");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, HoldProgress) == 0x001030, "Member 'UBP_HoldableButton_BuyLevel_C::HoldProgress' has a wrong offset!");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, Hover) == 0x001038, "Member 'UBP_HoldableButton_BuyLevel_C::Hover' has a wrong offset!");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, Button_text) == 0x001040, "Member 'UBP_HoldableButton_BuyLevel_C::Button_text' has a wrong offset!");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, Image_material) == 0x001048, "Member 'UBP_HoldableButton_BuyLevel_C::Image_material' has a wrong offset!");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, SizeBox_0) == 0x001050, "Member 'UBP_HoldableButton_BuyLevel_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, Text_Subtitle) == 0x001058, "Member 'UBP_HoldableButton_BuyLevel_C::Text_Subtitle' has a wrong offset!");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, UnbindedInputActionWidget) == 0x001060, "Member 'UBP_HoldableButton_BuyLevel_C::UnbindedInputActionWidget' has a wrong offset!");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, In_Text) == 0x001068, "Member 'UBP_HoldableButton_BuyLevel_C::In_Text' has a wrong offset!");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, In_Width_Override) == 0x001080, "Member 'UBP_HoldableButton_BuyLevel_C::In_Width_Override' has a wrong offset!");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, Material) == 0x001088, "Member 'UBP_HoldableButton_BuyLevel_C::Material' has a wrong offset!");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, HoldProgressDMI) == 0x001090, "Member 'UBP_HoldableButton_BuyLevel_C::HoldProgressDMI' has a wrong offset!");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, Size) == 0x001098, "Member 'UBP_HoldableButton_BuyLevel_C::Size' has a wrong offset!");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, In_Height_Override) == 0x00109C, "Member 'UBP_HoldableButton_BuyLevel_C::In_Height_Override' has a wrong offset!");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, FillingSoundAudioComponent) == 0x0010A0, "Member 'UBP_HoldableButton_BuyLevel_C::FillingSoundAudioComponent' has a wrong offset!");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, FillingSoundOverride) == 0x0010A8, "Member 'UBP_HoldableButton_BuyLevel_C::FillingSoundOverride' has a wrong offset!");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, FillCompleteSoundOverride) == 0x0010B0, "Member 'UBP_HoldableButton_BuyLevel_C::FillCompleteSoundOverride' has a wrong offset!");

}

