#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_QTM_Manager

#include "Basic.hpp"

#include "QTM_PlayerInputStruct_structs.hpp"
#include "SpecialEventGameplayRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_QTM_Manager.BP_QTM_Manager_C.UpdateInputForPawn
// 0x0060 (0x0060 - 0x0000)
struct BP_QTM_Manager_C_UpdateInputForPawn final
{
public:
	class APlayerState*                           PlayerState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQTM_PlayerInputStruct                 K2Node_MakeStruct_QTM_PlayerInputStruct;           // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQTM_PlayerInputStruct                 CallFunc_Array_Get_Item;                           // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQTM_PlayerInputStruct                 K2Node_MakeStruct_QTM_PlayerInputStruct_1;         // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QTM_Manager_C_UpdateInputForPawn) == 0x000008, "Wrong alignment on BP_QTM_Manager_C_UpdateInputForPawn");
static_assert(sizeof(BP_QTM_Manager_C_UpdateInputForPawn) == 0x000060, "Wrong size on BP_QTM_Manager_C_UpdateInputForPawn");
static_assert(offsetof(BP_QTM_Manager_C_UpdateInputForPawn, PlayerState) == 0x000000, "Member 'BP_QTM_Manager_C_UpdateInputForPawn::PlayerState' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_UpdateInputForPawn, K2Node_MakeStruct_QTM_PlayerInputStruct) == 0x000008, "Member 'BP_QTM_Manager_C_UpdateInputForPawn::K2Node_MakeStruct_QTM_PlayerInputStruct' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_UpdateInputForPawn, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_QTM_Manager_C_UpdateInputForPawn::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_UpdateInputForPawn, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'BP_QTM_Manager_C_UpdateInputForPawn::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_UpdateInputForPawn, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'BP_QTM_Manager_C_UpdateInputForPawn::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_UpdateInputForPawn, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BP_QTM_Manager_C_UpdateInputForPawn::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_UpdateInputForPawn, CallFunc_Array_Add_ReturnValue) == 0x000028, "Member 'BP_QTM_Manager_C_UpdateInputForPawn::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_UpdateInputForPawn, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'BP_QTM_Manager_C_UpdateInputForPawn::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_UpdateInputForPawn, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_QTM_Manager_C_UpdateInputForPawn::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_UpdateInputForPawn, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BP_QTM_Manager_C_UpdateInputForPawn::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_UpdateInputForPawn, CallFunc_Add_IntInt_ReturnValue_1) == 0x000044, "Member 'BP_QTM_Manager_C_UpdateInputForPawn::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_UpdateInputForPawn, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000048, "Member 'BP_QTM_Manager_C_UpdateInputForPawn::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_UpdateInputForPawn, K2Node_MakeStruct_QTM_PlayerInputStruct_1) == 0x000050, "Member 'BP_QTM_Manager_C_UpdateInputForPawn::K2Node_MakeStruct_QTM_PlayerInputStruct_1' has a wrong offset!");

// Function BP_QTM_Manager.BP_QTM_Manager_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_QTM_Manager_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QTM_Manager_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_QTM_Manager_C_ReceiveTick");
static_assert(sizeof(BP_QTM_Manager_C_ReceiveTick) == 0x000004, "Wrong size on BP_QTM_Manager_C_ReceiveTick");
static_assert(offsetof(BP_QTM_Manager_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_QTM_Manager_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_QTM_Manager.BP_QTM_Manager_C.PawnToPlayerState
// 0x0068 (0x0068 - 0x0000)
struct BP_QTM_Manager_C_PawnToPlayerState final
{
public:
	TArray<class AFortPlayerPawn*>                PlayerPawns;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class AFortPlayerStateAthena*>         PlayerStates;                                      // 0x0010(0x0010)(Parm, OutParm)
	TArray<class AFortPlayerStateAthena*>         PlayerStatesArray;                                 // 0x0020(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerStateAthena*                 K2Node_DynamicCast_AsFort_Player_State_Athena;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QTM_Manager_C_PawnToPlayerState) == 0x000008, "Wrong alignment on BP_QTM_Manager_C_PawnToPlayerState");
static_assert(sizeof(BP_QTM_Manager_C_PawnToPlayerState) == 0x000068, "Wrong size on BP_QTM_Manager_C_PawnToPlayerState");
static_assert(offsetof(BP_QTM_Manager_C_PawnToPlayerState, PlayerPawns) == 0x000000, "Member 'BP_QTM_Manager_C_PawnToPlayerState::PlayerPawns' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_PawnToPlayerState, PlayerStates) == 0x000010, "Member 'BP_QTM_Manager_C_PawnToPlayerState::PlayerStates' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_PawnToPlayerState, PlayerStatesArray) == 0x000020, "Member 'BP_QTM_Manager_C_PawnToPlayerState::PlayerStatesArray' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_PawnToPlayerState, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_QTM_Manager_C_PawnToPlayerState::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_PawnToPlayerState, Temp_int_Array_Index_Variable) == 0x000034, "Member 'BP_QTM_Manager_C_PawnToPlayerState::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_PawnToPlayerState, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'BP_QTM_Manager_C_PawnToPlayerState::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_PawnToPlayerState, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_QTM_Manager_C_PawnToPlayerState::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_PawnToPlayerState, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'BP_QTM_Manager_C_PawnToPlayerState::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_PawnToPlayerState, K2Node_DynamicCast_AsFort_Player_State_Athena) == 0x000050, "Member 'BP_QTM_Manager_C_PawnToPlayerState::K2Node_DynamicCast_AsFort_Player_State_Athena' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_PawnToPlayerState, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BP_QTM_Manager_C_PawnToPlayerState::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_PawnToPlayerState, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'BP_QTM_Manager_C_PawnToPlayerState::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_PawnToPlayerState, CallFunc_Array_Add_ReturnValue) == 0x000060, "Member 'BP_QTM_Manager_C_PawnToPlayerState::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_QTM_Manager.BP_QTM_Manager_C.OnRep_RepInputStruct
// 0x0030 (0x0030 - 0x0000)
struct BP_QTM_Manager_C_OnRep_RepInputStruct final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQTM_PlayerInputStruct                 CallFunc_Array_Get_Item;                           // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPawn_IsLocalPawn;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QTM_Manager_C_OnRep_RepInputStruct) == 0x000008, "Wrong alignment on BP_QTM_Manager_C_OnRep_RepInputStruct");
static_assert(sizeof(BP_QTM_Manager_C_OnRep_RepInputStruct) == 0x000030, "Wrong size on BP_QTM_Manager_C_OnRep_RepInputStruct");
static_assert(offsetof(BP_QTM_Manager_C_OnRep_RepInputStruct, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'BP_QTM_Manager_C_OnRep_RepInputStruct::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_OnRep_RepInputStruct, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_QTM_Manager_C_OnRep_RepInputStruct::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_OnRep_RepInputStruct, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_QTM_Manager_C_OnRep_RepInputStruct::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_OnRep_RepInputStruct, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_QTM_Manager_C_OnRep_RepInputStruct::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_OnRep_RepInputStruct, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_QTM_Manager_C_OnRep_RepInputStruct::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_OnRep_RepInputStruct, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000020, "Member 'BP_QTM_Manager_C_OnRep_RepInputStruct::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_OnRep_RepInputStruct, CallFunc_IsLocalPawn_IsLocalPawn) == 0x000021, "Member 'BP_QTM_Manager_C_OnRep_RepInputStruct::CallFunc_IsLocalPawn_IsLocalPawn' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_OnRep_RepInputStruct, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000022, "Member 'BP_QTM_Manager_C_OnRep_RepInputStruct::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_OnRep_RepInputStruct, CallFunc_Not_PreBool_ReturnValue) == 0x000023, "Member 'BP_QTM_Manager_C_OnRep_RepInputStruct::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_OnRep_RepInputStruct, CallFunc_BooleanAND_ReturnValue) == 0x000024, "Member 'BP_QTM_Manager_C_OnRep_RepInputStruct::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_OnRep_RepInputStruct, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_QTM_Manager_C_OnRep_RepInputStruct::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_OnRep_RepInputStruct, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'BP_QTM_Manager_C_OnRep_RepInputStruct::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_QTM_Manager.BP_QTM_Manager_C.OnAnyKeyPressed
// 0x0004 (0x0004 - 0x0000)
struct BP_QTM_Manager_C_OnAnyKeyPressed final
{
public:
	class FName                                   KeyName;                                           // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QTM_Manager_C_OnAnyKeyPressed) == 0x000004, "Wrong alignment on BP_QTM_Manager_C_OnAnyKeyPressed");
static_assert(sizeof(BP_QTM_Manager_C_OnAnyKeyPressed) == 0x000004, "Wrong size on BP_QTM_Manager_C_OnAnyKeyPressed");
static_assert(offsetof(BP_QTM_Manager_C_OnAnyKeyPressed, KeyName) == 0x000000, "Member 'BP_QTM_Manager_C_OnAnyKeyPressed::KeyName' has a wrong offset!");

// Function BP_QTM_Manager.BP_QTM_Manager_C.ExecuteUbergraph_BP_QTM_Manager
// 0x0178 (0x0178 - 0x0000)
struct BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaMutator_SpecialEvent*        CallFunc_GetSpecialEventMutator_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortControllerComponent_SpecialEvent*  CallFunc_FindSpecialEventComponent_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpecialClientEvent                    K2Node_CustomEvent_ClientEventData;                // 0x0050(0x0018)(NoDestructor)
	TDelegate<void(const struct FSpecialClientEvent& ClientEventData)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0068(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaMutator_SpecialRelevancy*    CallFunc_GetSpecialRelevancyMutator_ReturnValue;   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FindRelevancyGroupIndex_ReturnValue;      // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPlayerPawn*>                CallFunc_GetPlayerPawns_OutPawns;                  // 0x0088(0x0010)(ReferenceParm)
	class AFortPlayerPawn*                        CallFunc_Array_Get_Item;                           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A6[0x2];                                       // 0x00A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue_1; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaMutator_SpecialRelevancy*    CallFunc_GetSpecialRelevancyMutator_ReturnValue_1; // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_4;          // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreActorsInSameRelvancyGroup_ReturnValue; // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DE[0x2];                                       // 0x00DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue; // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue_2; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortControllerComponent_SpecialEvent*  CallFunc_FindSpecialEventComponent_ReturnValue_1;  // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_1;     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaMutator_SpecialRelevancy*    CallFunc_GetSpecialRelevancyMutator_ReturnValue_2; // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreActorsInSameRelvancyGroup_ReturnValue_1; // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0134(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0140(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_KeyName;                        // 0x0148(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FName& KeyName)>   K2Node_CreateDelegate_OutputDelegate_3;            // 0x014C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FName& KeyName)>   K2Node_CreateDelegate_OutputDelegate_4;            // 0x0158(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue_3; // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreHUDElementsVisible_ReturnValue;        // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager) == 0x000008, "Wrong alignment on BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager");
static_assert(sizeof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager) == 0x000178, "Wrong size on BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, EntryPoint) == 0x000000, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000006, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_GetSpecialEventMutator_ReturnValue) == 0x000008, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_GetSpecialEventMutator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_GetFirstLocalFortPlayerController_ReturnValue) == 0x000010, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_GetFirstLocalFortPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_FindSpecialEventComponent_ReturnValue) == 0x000020, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_FindSpecialEventComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000038, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, Temp_int_Loop_Counter_Variable) == 0x000040, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x000048, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, Temp_bool_Has_Been_Initd_Variable) == 0x000049, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, Temp_bool_IsClosed_Variable) == 0x00004A, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_IsDedicatedServer_ReturnValue) == 0x00004B, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, Temp_int_Array_Index_Variable) == 0x00004C, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, K2Node_CustomEvent_ClientEventData) == 0x000050, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::K2Node_CustomEvent_ClientEventData' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, K2Node_CreateDelegate_OutputDelegate_1) == 0x000068, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_GetSpecialRelevancyMutator_ReturnValue) == 0x000078, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_GetSpecialRelevancyMutator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_IsValid_ReturnValue_1) == 0x000080, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_FindRelevancyGroupIndex_ReturnValue) == 0x000084, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_FindRelevancyGroupIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_GetPlayerPawns_OutPawns) == 0x000088, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_GetPlayerPawns_OutPawns' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_Array_Get_Item) == 0x000098, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_Array_Length_ReturnValue) == 0x0000A0, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_IsValid_ReturnValue_2) == 0x0000A4, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_Less_IntInt_ReturnValue) == 0x0000A5, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_Array_Length_ReturnValue_1) == 0x0000A8, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_IsValid_ReturnValue_3) == 0x0000AC, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000B0, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_GetFirstLocalFortPlayerController_ReturnValue_1) == 0x0000B8, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_GetFirstLocalFortPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x0000C0, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x0000C1, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_Array_Add_ReturnValue) == 0x0000C4, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_IsDedicatedServer_ReturnValue_3) == 0x0000C8, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_IsDedicatedServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_GetSpecialRelevancyMutator_ReturnValue_1) == 0x0000D0, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_GetSpecialRelevancyMutator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_Lerp_ReturnValue) == 0x0000D8, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_IsDedicatedServer_ReturnValue_4) == 0x0000DC, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_IsDedicatedServer_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_AreActorsInSameRelvancyGroup_ReturnValue) == 0x0000DD, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_AreActorsInSameRelvancyGroup_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_Lerp_ReturnValue_1) == 0x0000E0, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_GetFloatValue_ReturnValue) == 0x0000E4, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000E8, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue) == 0x0000EC, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000F0, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000F4, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x0000F8, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0000FC, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_MapRangeClamped_ReturnValue) == 0x000100, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x000104, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000108, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_FClamp_ReturnValue) == 0x00010C, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_GetFirstLocalFortPlayerController_ReturnValue_2) == 0x000110, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_GetFirstLocalFortPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_FindSpecialEventComponent_ReturnValue_1) == 0x000118, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_FindSpecialEventComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_EqualEqual_GameplayTag_ReturnValue_1) == 0x000120, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_EqualEqual_GameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_GetSpecialRelevancyMutator_ReturnValue_2) == 0x000128, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_GetSpecialRelevancyMutator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_AreActorsInSameRelvancyGroup_ReturnValue_1) == 0x000130, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_AreActorsInSameRelvancyGroup_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, K2Node_CreateDelegate_OutputDelegate_2) == 0x000134, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000140, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, K2Node_CustomEvent_KeyName) == 0x000148, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::K2Node_CustomEvent_KeyName' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, K2Node_CreateDelegate_OutputDelegate_3) == 0x00014C, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, K2Node_CreateDelegate_OutputDelegate_4) == 0x000158, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, K2Node_Event_DeltaSeconds) == 0x000164, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_GetFirstLocalFortPlayerController_ReturnValue_3) == 0x000168, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_GetFirstLocalFortPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_IsValid_ReturnValue_4) == 0x000170, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager, CallFunc_AreHUDElementsVisible_ReturnValue) == 0x000171, "Member 'BP_QTM_Manager_C_ExecuteUbergraph_BP_QTM_Manager::CallFunc_AreHUDElementsVisible_ReturnValue' has a wrong offset!");

// Function BP_QTM_Manager.BP_QTM_Manager_C.ClientToServerRPCAddFillPercent
// 0x0018 (0x0018 - 0x0000)
struct BP_QTM_Manager_C_ClientToServerRPCAddFillPercent final
{
public:
	struct FSpecialClientEvent                    ClientEventData;                                   // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BP_QTM_Manager_C_ClientToServerRPCAddFillPercent) == 0x000008, "Wrong alignment on BP_QTM_Manager_C_ClientToServerRPCAddFillPercent");
static_assert(sizeof(BP_QTM_Manager_C_ClientToServerRPCAddFillPercent) == 0x000018, "Wrong size on BP_QTM_Manager_C_ClientToServerRPCAddFillPercent");
static_assert(offsetof(BP_QTM_Manager_C_ClientToServerRPCAddFillPercent, ClientEventData) == 0x000000, "Member 'BP_QTM_Manager_C_ClientToServerRPCAddFillPercent::ClientEventData' has a wrong offset!");

}

