#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkewedTabButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_SkewedTabButton.BP_SkewedTabButton_C
// 0x0040 (0x1050 - 0x1010)
class UBP_SkewedTabButton_C final : public UAthenaSkewedTabButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1010(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Unhovered;                                         // 0x1018(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x1020(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x1028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 No_Count_1;                                        // 0x1030(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           RGB1_Text_Color;                                   // 0x1038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BP_OnDeselected();
	void BP_OnHovered();
	void BP_OnSelected();
	void BP_OnUnhovered();
	void ExecuteUbergraph_BP_SkewedTabButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SkewedTabButton_C">();
	}
	static class UBP_SkewedTabButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SkewedTabButton_C>();
	}
};
static_assert(alignof(UBP_SkewedTabButton_C) == 0x000010, "Wrong alignment on UBP_SkewedTabButton_C");
static_assert(sizeof(UBP_SkewedTabButton_C) == 0x001050, "Wrong size on UBP_SkewedTabButton_C");
static_assert(offsetof(UBP_SkewedTabButton_C, UberGraphFrame) == 0x001010, "Member 'UBP_SkewedTabButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_SkewedTabButton_C, Unhovered) == 0x001018, "Member 'UBP_SkewedTabButton_C::Unhovered' has a wrong offset!");
static_assert(offsetof(UBP_SkewedTabButton_C, Hovered) == 0x001020, "Member 'UBP_SkewedTabButton_C::Hovered' has a wrong offset!");
static_assert(offsetof(UBP_SkewedTabButton_C, Selected) == 0x001028, "Member 'UBP_SkewedTabButton_C::Selected' has a wrong offset!");
static_assert(offsetof(UBP_SkewedTabButton_C, No_Count_1) == 0x001030, "Member 'UBP_SkewedTabButton_C::No_Count_1' has a wrong offset!");
static_assert(offsetof(UBP_SkewedTabButton_C, RGB1_Text_Color) == 0x001038, "Member 'UBP_SkewedTabButton_C::RGB1_Text_Color' has a wrong offset!");

}

