#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS20_BattlePassRewardGridHeader

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BPS20_BattlePassRewardGridHeader.BPS20_BattlePassRewardGridHeader_C.ExecuteUbergraph_BPS20_BattlePassRewardGridHeader
// 0x0278 (0x0278 - 0x0000)
struct BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERewardPageType                               Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0010(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0028(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0040(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0058(0x0018)()
	bool                                          Temp_bool_Variable_2;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73[0x1];                                       // 0x0073(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_RequiredLevel;                        // 0x0074(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_RequiredRewards;                      // 0x0078(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InPageNumber;                         // 0x007C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0090(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ReferenceParm)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F8(0x0018)()
	int32                                         K2Node_Event_PurchasedRewards;                     // 0x0110(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_TotalRewards;                         // 0x0114(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0128(0x0050)(HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_2;            // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0190(0x0050)(HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01E8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01F8(0x0018)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_1;                           // 0x0218(0x0018)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERewardPageType                               K2Node_Event_PageType;                             // 0x0238(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_2;                           // 0x0240(0x0018)()
	class FText                                   K2Node_Event_CustomName;                           // 0x0258(0x0018)(ConstParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader) == 0x000008, "Wrong alignment on BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader");
static_assert(sizeof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader) == 0x000278, "Wrong size on BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, EntryPoint) == 0x000000, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, Temp_bool_Variable) == 0x000004, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, Temp_byte_Variable) == 0x000005, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, Temp_byte_Variable_1) == 0x000006, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, Temp_bool_Variable_1) == 0x000007, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, Temp_byte_Variable_2) == 0x000008, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, Temp_text_Variable) == 0x000010, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, Temp_text_Variable_1) == 0x000028, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, Temp_text_Variable_2) == 0x000040, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, Temp_text_Variable_3) == 0x000058, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, Temp_bool_Variable_2) == 0x000070, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, Temp_byte_Variable_3) == 0x000071, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, Temp_byte_Variable_4) == 0x000072, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, K2Node_Event_RequiredLevel) == 0x000074, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::K2Node_Event_RequiredLevel' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, K2Node_Event_RequiredRewards) == 0x000078, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::K2Node_Event_RequiredRewards' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, K2Node_Event_InPageNumber) == 0x00007C, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::K2Node_Event_InPageNumber' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000080, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000088, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, K2Node_MakeStruct_FormatArgumentData) == 0x000090, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, K2Node_MakeArray_Array) == 0x0000E0, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, K2Node_Select_Default) == 0x0000F0, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, CallFunc_Format_ReturnValue) == 0x0000F8, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, K2Node_Event_PurchasedRewards) == 0x000110, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::K2Node_Event_PurchasedRewards' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, K2Node_Event_TotalRewards) == 0x000114, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::K2Node_Event_TotalRewards' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000118, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000120, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, K2Node_MakeStruct_FormatArgumentData_1) == 0x000128, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000178, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, CallFunc_Conv_IntToInt64_ReturnValue_2) == 0x000180, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::CallFunc_Conv_IntToInt64_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000188, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, K2Node_MakeStruct_FormatArgumentData_2) == 0x000190, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0001E0, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, K2Node_MakeArray_Array_1) == 0x0001E8, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, CallFunc_Format_ReturnValue_1) == 0x0001F8, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000210, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, K2Node_Select_Default_1) == 0x000218, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, CallFunc_PlayAnimation_ReturnValue) == 0x000230, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, K2Node_Event_PageType) == 0x000238, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::K2Node_Event_PageType' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, K2Node_Select_Default_2) == 0x000240, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, K2Node_Event_CustomName) == 0x000258, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::K2Node_Event_CustomName' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000270, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader, K2Node_Select_Default_3) == 0x000271, "Member 'BPS20_BattlePassRewardGridHeader_C_ExecuteUbergraph_BPS20_BattlePassRewardGridHeader::K2Node_Select_Default_3' has a wrong offset!");

// Function BPS20_BattlePassRewardGridHeader.BPS20_BattlePassRewardGridHeader_C.OnPageLocked
// 0x0008 (0x0008 - 0x0000)
struct BPS20_BattlePassRewardGridHeader_C_OnPageLocked final
{
public:
	int32                                         RequiredLevel;                                     // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RequiredRewards;                                   // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS20_BattlePassRewardGridHeader_C_OnPageLocked) == 0x000004, "Wrong alignment on BPS20_BattlePassRewardGridHeader_C_OnPageLocked");
static_assert(sizeof(BPS20_BattlePassRewardGridHeader_C_OnPageLocked) == 0x000008, "Wrong size on BPS20_BattlePassRewardGridHeader_C_OnPageLocked");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_OnPageLocked, RequiredLevel) == 0x000000, "Member 'BPS20_BattlePassRewardGridHeader_C_OnPageLocked::RequiredLevel' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_OnPageLocked, RequiredRewards) == 0x000004, "Member 'BPS20_BattlePassRewardGridHeader_C_OnPageLocked::RequiredRewards' has a wrong offset!");

// Function BPS20_BattlePassRewardGridHeader.BPS20_BattlePassRewardGridHeader_C.OnPageNumberSet
// 0x0004 (0x0004 - 0x0000)
struct BPS20_BattlePassRewardGridHeader_C_OnPageNumberSet final
{
public:
	int32                                         InPageNumber;                                      // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS20_BattlePassRewardGridHeader_C_OnPageNumberSet) == 0x000004, "Wrong alignment on BPS20_BattlePassRewardGridHeader_C_OnPageNumberSet");
static_assert(sizeof(BPS20_BattlePassRewardGridHeader_C_OnPageNumberSet) == 0x000004, "Wrong size on BPS20_BattlePassRewardGridHeader_C_OnPageNumberSet");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_OnPageNumberSet, InPageNumber) == 0x000000, "Member 'BPS20_BattlePassRewardGridHeader_C_OnPageNumberSet::InPageNumber' has a wrong offset!");

// Function BPS20_BattlePassRewardGridHeader.BPS20_BattlePassRewardGridHeader_C.OnPageUnlocked
// 0x0008 (0x0008 - 0x0000)
struct BPS20_BattlePassRewardGridHeader_C_OnPageUnlocked final
{
public:
	int32                                         PurchasedRewards;                                  // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalRewards;                                      // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS20_BattlePassRewardGridHeader_C_OnPageUnlocked) == 0x000004, "Wrong alignment on BPS20_BattlePassRewardGridHeader_C_OnPageUnlocked");
static_assert(sizeof(BPS20_BattlePassRewardGridHeader_C_OnPageUnlocked) == 0x000008, "Wrong size on BPS20_BattlePassRewardGridHeader_C_OnPageUnlocked");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_OnPageUnlocked, PurchasedRewards) == 0x000000, "Member 'BPS20_BattlePassRewardGridHeader_C_OnPageUnlocked::PurchasedRewards' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_OnPageUnlocked, TotalRewards) == 0x000004, "Member 'BPS20_BattlePassRewardGridHeader_C_OnPageUnlocked::TotalRewards' has a wrong offset!");

// Function BPS20_BattlePassRewardGridHeader.BPS20_BattlePassRewardGridHeader_C.OnSetPageCustomName
// 0x0018 (0x0018 - 0x0000)
struct BPS20_BattlePassRewardGridHeader_C_OnSetPageCustomName final
{
public:
	class FText                                   CustomName;                                        // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BPS20_BattlePassRewardGridHeader_C_OnSetPageCustomName) == 0x000008, "Wrong alignment on BPS20_BattlePassRewardGridHeader_C_OnSetPageCustomName");
static_assert(sizeof(BPS20_BattlePassRewardGridHeader_C_OnSetPageCustomName) == 0x000018, "Wrong size on BPS20_BattlePassRewardGridHeader_C_OnSetPageCustomName");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_OnSetPageCustomName, CustomName) == 0x000000, "Member 'BPS20_BattlePassRewardGridHeader_C_OnSetPageCustomName::CustomName' has a wrong offset!");

// Function BPS20_BattlePassRewardGridHeader.BPS20_BattlePassRewardGridHeader_C.OnSetPageType
// 0x0001 (0x0001 - 0x0000)
struct BPS20_BattlePassRewardGridHeader_C_OnSetPageType final
{
public:
	ERewardPageType                               PageType;                                          // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS20_BattlePassRewardGridHeader_C_OnSetPageType) == 0x000001, "Wrong alignment on BPS20_BattlePassRewardGridHeader_C_OnSetPageType");
static_assert(sizeof(BPS20_BattlePassRewardGridHeader_C_OnSetPageType) == 0x000001, "Wrong size on BPS20_BattlePassRewardGridHeader_C_OnSetPageType");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_OnSetPageType, PageType) == 0x000000, "Member 'BPS20_BattlePassRewardGridHeader_C_OnSetPageType::PageType' has a wrong offset!");

// Function BPS20_BattlePassRewardGridHeader.BPS20_BattlePassRewardGridHeader_C.UpdateLockedHeaderText
// 0x04F0 (0x04F0 - 0x0000)
struct BPS20_BattlePassRewardGridHeader_C_UpdateLockedHeaderText final
{
public:
	int32                                         RequiredLevel;                                     // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RequiredRewards;                                   // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0010(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0060(0x0050)(HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x00B0(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x00C8(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00E8(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0138(0x0050)(HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_2;                              // 0x0188(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x01A0(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BA[0x6];                                      // 0x01BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x01C0(0x0018)()
	class FText                                   K2Node_Select_Default_1;                           // 0x01D8(0x0018)()
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0200(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0250(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x02A0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x02B0(0x0018)()
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_2;            // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x02D0(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0328(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0338(0x0018)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_3;            // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_4;            // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_7;            // 0x0368(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_8;            // 0x03B8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0408(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0418(0x0018)()
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_5;            // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_9;            // 0x0438(0x0050)(HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0490(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x04A0(0x0018)()
	class FText                                   K2Node_Select_Default_2;                           // 0x04B8(0x0018)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x04D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D2[0x6];                                      // 0x04D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_3;                           // 0x04D8(0x0018)()
};
static_assert(alignof(BPS20_BattlePassRewardGridHeader_C_UpdateLockedHeaderText) == 0x000008, "Wrong alignment on BPS20_BattlePassRewardGridHeader_C_UpdateLockedHeaderText");
static_assert(sizeof(BPS20_BattlePassRewardGridHeader_C_UpdateLockedHeaderText) == 0x0004F0, "Wrong size on BPS20_BattlePassRewardGridHeader_C_UpdateLockedHeaderText");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_UpdateLockedHeaderText, RequiredLevel) == 0x000000, "Member 'BPS20_BattlePassRewardGridHeader_C_UpdateLockedHeaderText::RequiredLevel' has a wrong offset!");
static_assert(offsetof(BPS20_BattlePassRewardGridHeader_C_UpdateLockedHeaderText, RequiredRewards) == 0x000004, "Member 'BPS20_BattlePassRewardGridHeader_C_UpdateLockedHeaderText::RequiredRewards' has a wrong offset!");
