#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS20_HoldableCloseButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPS20_HoldableCloseButton.BPS20_HoldableCloseButton_C
// 0x0090 (0x10B0 - 0x1020)
class UBPS20_HoldableCloseButton_C final : public UFortHoldableButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1020(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x1028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoldCompleted;                                     // 0x1030(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoldProgress;                                      // 0x1038(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x1040(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_GamepadProgress;                             // 0x1048(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Input;                                     // 0x1050(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_50;                                    // 0x1058(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Height;                                    // 0x1060(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_KBM;                                       // 0x1068(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextButton_Text;                                   // 0x1070(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   In_Text;                                           // 0x1078(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	float                                         In_Min_Desired_Width;                              // 0x1090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         In_Min_Desired_Height;                             // 0x1094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Hold_Completed;                                    // 0x1098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BP_OnHoldCompleted();
	void BP_OnHoldDecreased(const float HoldPercentage);
	void BP_OnHoldEnded(const float HoldPercentage, const bool bInUseSecondaryHoldAnimation);
	void BP_OnHoldIncreased(const float HoldPercentage);
	void BP_OnHoldReset();
	void BP_OnHoldStarted(const float HoldPercentage, const bool bInUseSecondaryHoldAnimation);
	void BP_OnHovered();
	void BP_OnPressed();
	void BP_OnUnhovered();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_BPS20_HoldableCloseButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Update_style(bool Using_Gamepad);
	void UpdateTextAndStyle(ECommonInputType Input_Type);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPS20_HoldableCloseButton_C">();
	}
	static class UBPS20_HoldableCloseButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPS20_HoldableCloseButton_C>();
	}
};
static_assert(alignof(UBPS20_HoldableCloseButton_C) == 0x000010, "Wrong alignment on UBPS20_HoldableCloseButton_C");
static_assert(sizeof(UBPS20_HoldableCloseButton_C) == 0x0010B0, "Wrong size on UBPS20_HoldableCloseButton_C");
static_assert(offsetof(UBPS20_HoldableCloseButton_C, UberGraphFrame) == 0x001020, "Member 'UBPS20_HoldableCloseButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPS20_HoldableCloseButton_C, Hover) == 0x001028, "Member 'UBPS20_HoldableCloseButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UBPS20_HoldableCloseButton_C, HoldCompleted) == 0x001030, "Member 'UBPS20_HoldableCloseButton_C::HoldCompleted' has a wrong offset!");
static_assert(offsetof(UBPS20_HoldableCloseButton_C, HoldProgress) == 0x001038, "Member 'UBPS20_HoldableCloseButton_C::HoldProgress' has a wrong offset!");
static_assert(offsetof(UBPS20_HoldableCloseButton_C, Image_Background) == 0x001040, "Member 'UBPS20_HoldableCloseButton_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UBPS20_HoldableCloseButton_C, Image_GamepadProgress) == 0x001048, "Member 'UBPS20_HoldableCloseButton_C::Image_GamepadProgress' has a wrong offset!");
static_assert(offsetof(UBPS20_HoldableCloseButton_C, Overlay_Input) == 0x001050, "Member 'UBPS20_HoldableCloseButton_C::Overlay_Input' has a wrong offset!");
static_assert(offsetof(UBPS20_HoldableCloseButton_C, ProgressBar_50) == 0x001058, "Member 'UBPS20_HoldableCloseButton_C::ProgressBar_50' has a wrong offset!");
static_assert(offsetof(UBPS20_HoldableCloseButton_C, SizeBox_Height) == 0x001060, "Member 'UBPS20_HoldableCloseButton_C::SizeBox_Height' has a wrong offset!");
static_assert(offsetof(UBPS20_HoldableCloseButton_C, SizeBox_KBM) == 0x001068, "Member 'UBPS20_HoldableCloseButton_C::SizeBox_KBM' has a wrong offset!");
static_assert(offsetof(UBPS20_HoldableCloseButton_C, TextButton_Text) == 0x001070, "Member 'UBPS20_HoldableCloseButton_C::TextButton_Text' has a wrong offset!");
static_assert(offsetof(UBPS20_HoldableCloseButton_C, In_Text) == 0x001078, "Member 'UBPS20_HoldableCloseButton_C::In_Text' has a wrong offset!");
static_assert(offsetof(UBPS20_HoldableCloseButton_C, In_Min_Desired_Width) == 0x001090, "Member 'UBPS20_HoldableCloseButton_C::In_Min_Desired_Width' has a wrong offset!");
static_assert(offsetof(UBPS20_HoldableCloseButton_C, In_Min_Desired_Height) == 0x001094, "Member 'UBPS20_HoldableCloseButton_C::In_Min_Desired_Height' has a wrong offset!");
static_assert(offsetof(UBPS20_HoldableCloseButton_C, Hold_Completed) == 0x001098, "Member 'UBPS20_HoldableCloseButton_C::Hold_Completed' has a wrong offset!");

}

