#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS20_BulkClaimRewards

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePassBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPS20_BulkClaimRewards.BPS20_BulkClaimRewards_C
// 0x0050 (0x0580 - 0x0530)
class UBPS20_BulkClaimRewards_C final : public UFortBattlePassBulkBuyPageBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0530(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0538(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock_185;                           // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Cost;                                              // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_131;                                         // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_231;                                         // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_LevelsAmount;                                 // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Title;                                             // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         First_Page_to_Claim;                               // 0x0570(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Last_Page_to_Claim;                                // 0x0574(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Add_One;                                           // 0x0578(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	void ExecuteUbergraph_BPS20_BulkClaimRewards(int32 EntryPoint);
	void OnCostChanged(const int32 Cost_0);
	void OnPageRangeChanged(const int32 FromPage, const int32 ToPage);
	void OnRewardCountChanged(const int32 Count);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPS20_BulkClaimRewards_C">();
	}
	static class UBPS20_BulkClaimRewards_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPS20_BulkClaimRewards_C>();
	}
};
static_assert(alignof(UBPS20_BulkClaimRewards_C) == 0x000008, "Wrong alignment on UBPS20_BulkClaimRewards_C");
static_assert(sizeof(UBPS20_BulkClaimRewards_C) == 0x000580, "Wrong size on UBPS20_BulkClaimRewards_C");
static_assert(offsetof(UBPS20_BulkClaimRewards_C, UberGraphFrame) == 0x000530, "Member 'UBPS20_BulkClaimRewards_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPS20_BulkClaimRewards_C, Intro) == 0x000538, "Member 'UBPS20_BulkClaimRewards_C::Intro' has a wrong offset!");
static_assert(offsetof(UBPS20_BulkClaimRewards_C, CommonRichTextBlock_185) == 0x000540, "Member 'UBPS20_BulkClaimRewards_C::CommonRichTextBlock_185' has a wrong offset!");
static_assert(offsetof(UBPS20_BulkClaimRewards_C, Cost) == 0x000548, "Member 'UBPS20_BulkClaimRewards_C::Cost' has a wrong offset!");
static_assert(offsetof(UBPS20_BulkClaimRewards_C, Image_131) == 0x000550, "Member 'UBPS20_BulkClaimRewards_C::Image_131' has a wrong offset!");
static_assert(offsetof(UBPS20_BulkClaimRewards_C, Image_231) == 0x000558, "Member 'UBPS20_BulkClaimRewards_C::Image_231' has a wrong offset!");
static_assert(offsetof(UBPS20_BulkClaimRewards_C, Text_LevelsAmount) == 0x000560, "Member 'UBPS20_BulkClaimRewards_C::Text_LevelsAmount' has a wrong offset!");
static_assert(offsetof(UBPS20_BulkClaimRewards_C, Title) == 0x000568, "Member 'UBPS20_BulkClaimRewards_C::Title' has a wrong offset!");
static_assert(offsetof(UBPS20_BulkClaimRewards_C, First_Page_to_Claim) == 0x000570, "Member 'UBPS20_BulkClaimRewards_C::First_Page_to_Claim' has a wrong offset!");
static_assert(offsetof(UBPS20_BulkClaimRewards_C, Last_Page_to_Claim) == 0x000574, "Member 'UBPS20_BulkClaimRewards_C::Last_Page_to_Claim' has a wrong offset!");
static_assert(offsetof(UBPS20_BulkClaimRewards_C, Add_One) == 0x000578, "Member 'UBPS20_BulkClaimRewards_C::Add_One' has a wrong offset!");

}

