#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS20_AboutModal_Pip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPS20_AboutModal_Pip.BPS20_AboutModal_Pip_C
// 0x0040 (0x0FE0 - 0x0FA0)
class UBPS20_AboutModal_Pip_C final : public UCommonButtonBase
{
public:
	uint8                                         Pad_F98[0x8];                                      // 0x0F98(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0FA0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0FA8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select;                                            // 0x0FB0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 PIP;                                               // 0x0FB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsFocused;                                         // 0x0FC0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC1[0x7];                                      // 0x0FC1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              ClickedOnPip;                                      // 0x0FC8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BP_OnClicked();
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_BPS20_AboutModal_Pip(int32 EntryPoint);
	void Is_Focused(bool Is_Focused_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPS20_AboutModal_Pip_C">();
	}
	static class UBPS20_AboutModal_Pip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPS20_AboutModal_Pip_C>();
	}
};
static_assert(alignof(UBPS20_AboutModal_Pip_C) == 0x000010, "Wrong alignment on UBPS20_AboutModal_Pip_C");
static_assert(sizeof(UBPS20_AboutModal_Pip_C) == 0x000FE0, "Wrong size on UBPS20_AboutModal_Pip_C");
static_assert(offsetof(UBPS20_AboutModal_Pip_C, UberGraphFrame) == 0x000FA0, "Member 'UBPS20_AboutModal_Pip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPS20_AboutModal_Pip_C, Hover) == 0x000FA8, "Member 'UBPS20_AboutModal_Pip_C::Hover' has a wrong offset!");
static_assert(offsetof(UBPS20_AboutModal_Pip_C, Select) == 0x000FB0, "Member 'UBPS20_AboutModal_Pip_C::Select' has a wrong offset!");
static_assert(offsetof(UBPS20_AboutModal_Pip_C, PIP) == 0x000FB8, "Member 'UBPS20_AboutModal_Pip_C::PIP' has a wrong offset!");
static_assert(offsetof(UBPS20_AboutModal_Pip_C, IsFocused) == 0x000FC0, "Member 'UBPS20_AboutModal_Pip_C::IsFocused' has a wrong offset!");
static_assert(offsetof(UBPS20_AboutModal_Pip_C, ClickedOnPip) == 0x000FC8, "Member 'UBPS20_AboutModal_Pip_C::ClickedOnPip' has a wrong offset!");

}

