#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS20_GetAllButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPS20_GetAllButton.BPS20_GetAllButton_C
// 0x0060 (0x1000 - 0x0FA0)
class UBPS20_GetAllButton_C final : public UCommonButtonBase
{
public:
	uint8                                         Pad_F98[0x8];                                      // 0x0F98(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0FA0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0FA8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0FB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_34;                                          // 0x0FB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Hover;                                       // 0x0FC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   MainText;                                          // 0x0FC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   MainText_hover;                                    // 0x0FD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_23;                                        // 0x0FD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Input;                                     // 0x0FE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x0FE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Page_Complete;                                     // 0x0FF0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_BPS20_GetAllButton(int32 EntryPoint);
	void Set_Text_Data(bool Page_Complete_0, int32 Starting_Page, int32 Ending_Page, int32 Cost);
	void UpdateTextAndStyle(ECommonInputType Input_Type);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPS20_GetAllButton_C">();
	}
	static class UBPS20_GetAllButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPS20_GetAllButton_C>();
	}
};
static_assert(alignof(UBPS20_GetAllButton_C) == 0x000010, "Wrong alignment on UBPS20_GetAllButton_C");
static_assert(sizeof(UBPS20_GetAllButton_C) == 0x001000, "Wrong size on UBPS20_GetAllButton_C");
static_assert(offsetof(UBPS20_GetAllButton_C, UberGraphFrame) == 0x000FA0, "Member 'UBPS20_GetAllButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPS20_GetAllButton_C, Hover) == 0x000FA8, "Member 'UBPS20_GetAllButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UBPS20_GetAllButton_C, Image) == 0x000FB0, "Member 'UBPS20_GetAllButton_C::Image' has a wrong offset!");
static_assert(offsetof(UBPS20_GetAllButton_C, Image_34) == 0x000FB8, "Member 'UBPS20_GetAllButton_C::Image_34' has a wrong offset!");
static_assert(offsetof(UBPS20_GetAllButton_C, Image_Hover) == 0x000FC0, "Member 'UBPS20_GetAllButton_C::Image_Hover' has a wrong offset!");
static_assert(offsetof(UBPS20_GetAllButton_C, MainText) == 0x000FC8, "Member 'UBPS20_GetAllButton_C::MainText' has a wrong offset!");
static_assert(offsetof(UBPS20_GetAllButton_C, MainText_hover) == 0x000FD0, "Member 'UBPS20_GetAllButton_C::MainText_hover' has a wrong offset!");
static_assert(offsetof(UBPS20_GetAllButton_C, Overlay_23) == 0x000FD8, "Member 'UBPS20_GetAllButton_C::Overlay_23' has a wrong offset!");
static_assert(offsetof(UBPS20_GetAllButton_C, Overlay_Input) == 0x000FE0, "Member 'UBPS20_GetAllButton_C::Overlay_Input' has a wrong offset!");
static_assert(offsetof(UBPS20_GetAllButton_C, SizeBox_0) == 0x000FE8, "Member 'UBPS20_GetAllButton_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(UBPS20_GetAllButton_C, Page_Complete) == 0x000FF0, "Member 'UBPS20_GetAllButton_C::Page_Complete' has a wrong offset!");

}

