#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS20_BulkClaimRewards

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BPS20_BulkClaimRewards.BPS20_BulkClaimRewards_C.ExecuteUbergraph_BPS20_BulkClaimRewards
// 0x0230 (0x0230 - 0x0000)
struct BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_FromPage;                             // 0x0010(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_ToPage;                               // 0x0014(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Count;                                // 0x0018(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Cost;                                 // 0x001C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0080(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x00E0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F0(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0108(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0170(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0188(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x01A0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x01B8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0208(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0218(0x0018)()
};
static_assert(alignof(BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards) == 0x000008, "Wrong alignment on BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards");
static_assert(sizeof(BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards) == 0x000230, "Wrong size on BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards");
static_assert(offsetof(BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards, EntryPoint) == 0x000000, "Member 'BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards, Temp_bool_Variable) == 0x000004, "Member 'BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards, K2Node_Event_FromPage) == 0x000010, "Member 'BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards::K2Node_Event_FromPage' has a wrong offset!");
static_assert(offsetof(BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards, K2Node_Event_ToPage) == 0x000014, "Member 'BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards::K2Node_Event_ToPage' has a wrong offset!");
static_assert(offsetof(BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards, K2Node_Event_Count) == 0x000018, "Member 'BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards::K2Node_Event_Count' has a wrong offset!");
static_assert(offsetof(BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards, K2Node_Event_Cost) == 0x00001C, "Member 'BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards::K2Node_Event_Cost' has a wrong offset!");
static_assert(offsetof(BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000020, "Member 'BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000028, "Member 'BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards, K2Node_MakeStruct_FormatArgumentData_1) == 0x000080, "Member 'BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards, K2Node_MakeArray_Array) == 0x0000D0, "Member 'BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards, K2Node_MakeArray_Array_1) == 0x0000E0, "Member 'BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards, CallFunc_Format_ReturnValue) == 0x0000F0, "Member 'BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards, CallFunc_Format_ReturnValue_1) == 0x000108, "Member 'BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards, CallFunc_Add_IntInt_ReturnValue) == 0x000120, "Member 'BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards, CallFunc_Add_IntInt_ReturnValue_1) == 0x000124, "Member 'BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards, CallFunc_Conv_IntToString_ReturnValue) == 0x000128, "Member 'BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000138, "Member 'BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards, CallFunc_Concat_StrStr_ReturnValue) == 0x000148, "Member 'BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000158, "Member 'BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000160, "Member 'BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards, CallFunc_Conv_StringToText_ReturnValue) == 0x000170, "Member 'BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards, CallFunc_Conv_IntToText_ReturnValue) == 0x000188, "Member 'BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards, K2Node_Select_Default) == 0x0001A0, "Member 'BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards, K2Node_MakeStruct_FormatArgumentData_2) == 0x0001B8, "Member 'BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards, K2Node_MakeArray_Array_2) == 0x000208, "Member 'BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards, CallFunc_Format_ReturnValue_2) == 0x000218, "Member 'BPS20_BulkClaimRewards_C_ExecuteUbergraph_BPS20_BulkClaimRewards::CallFunc_Format_ReturnValue_2' has a wrong offset!");

// Function BPS20_BulkClaimRewards.BPS20_BulkClaimRewards_C.OnCostChanged
// 0x0004 (0x0004 - 0x0000)
struct BPS20_BulkClaimRewards_C_OnCostChanged final
{
public:
	int32                                         Cost_0;                                            // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS20_BulkClaimRewards_C_OnCostChanged) == 0x000004, "Wrong alignment on BPS20_BulkClaimRewards_C_OnCostChanged");
static_assert(sizeof(BPS20_BulkClaimRewards_C_OnCostChanged) == 0x000004, "Wrong size on BPS20_BulkClaimRewards_C_OnCostChanged");
static_assert(offsetof(BPS20_BulkClaimRewards_C_OnCostChanged, Cost_0) == 0x000000, "Member 'BPS20_BulkClaimRewards_C_OnCostChanged::Cost_0' has a wrong offset!");

// Function BPS20_BulkClaimRewards.BPS20_BulkClaimRewards_C.OnPageRangeChanged
// 0x0008 (0x0008 - 0x0000)
struct BPS20_BulkClaimRewards_C_OnPageRangeChanged final
{
public:
	int32                                         FromPage;                                          // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ToPage;                                            // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS20_BulkClaimRewards_C_OnPageRangeChanged) == 0x000004, "Wrong alignment on BPS20_BulkClaimRewards_C_OnPageRangeChanged");
static_assert(sizeof(BPS20_BulkClaimRewards_C_OnPageRangeChanged) == 0x000008, "Wrong size on BPS20_BulkClaimRewards_C_OnPageRangeChanged");
static_assert(offsetof(BPS20_BulkClaimRewards_C_OnPageRangeChanged, FromPage) == 0x000000, "Member 'BPS20_BulkClaimRewards_C_OnPageRangeChanged::FromPage' has a wrong offset!");
static_assert(offsetof(BPS20_BulkClaimRewards_C_OnPageRangeChanged, ToPage) == 0x000004, "Member 'BPS20_BulkClaimRewards_C_OnPageRangeChanged::ToPage' has a wrong offset!");

// Function BPS20_BulkClaimRewards.BPS20_BulkClaimRewards_C.OnRewardCountChanged
// 0x0004 (0x0004 - 0x0000)
struct BPS20_BulkClaimRewards_C_OnRewardCountChanged final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS20_BulkClaimRewards_C_OnRewardCountChanged) == 0x000004, "Wrong alignment on BPS20_BulkClaimRewards_C_OnRewardCountChanged");
static_assert(sizeof(BPS20_BulkClaimRewards_C_OnRewardCountChanged) == 0x000004, "Wrong size on BPS20_BulkClaimRewards_C_OnRewardCountChanged");
static_assert(offsetof(BPS20_BulkClaimRewards_C_OnRewardCountChanged, Count) == 0x000000, "Member 'BPS20_BulkClaimRewards_C_OnRewardCountChanged::Count' has a wrong offset!");

}

