#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS20_LandingPages

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePassBase_structs.hpp"
#include "BattlePassS20UI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPS20_LandingPages.BPS20_LandingPages_C
// 0x00C0 (0x05F0 - 0x0530)
class UBPS20_LandingPages_C final : public UBattlePassLandingPageS20
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0530(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0538(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_OwnBP;                               // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPS20_SeasonalDataWidget_C*            SeasonDataWidget;                                  // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              Switcher_BottonButtons;                            // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              On_show_BP_character;                              // 0x0558(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              On_show_Custo_Character;                           // 0x0568(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              On_show_Mystery_Character;                         // 0x0578(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              On_show_Bonus_Character;                           // 0x0588(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              On_show_Crew_Character;                            // 0x0598(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              On_show_Buy_BP;                                    // 0x05A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              On_show_Buy_Level;                                 // 0x05B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              On_show_Gift_Battle_Pass;                          // 0x05C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          BPOwned;                                           // 0x05D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CustomizationOwned;                                // 0x05D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DA[0x6];                                      // 0x05DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FBattlePassLandingPageButtonDisplayDetails& DisplayInfo, bool bShowRewardCount)> OnShowButtonDetails; // 0x05E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__BPS20_LandingPages_Button_BonusRewards_K2Node_ComponentBoundEvent_11_OnShowButtonDetails__DelegateSignature(const struct FBattlePassLandingPageButtonDisplayDetails& DisplayInfo);
	void BndEvt__BPS20_LandingPages_Button_BuyBattlePass_K2Node_ComponentBoundEvent_0_OnShowButtonDetails__DelegateSignature(const struct FBattlePassLandingPageButtonDisplayDetails& DisplayInfo);
	void BndEvt__BPS20_LandingPages_Button_BuyResources_K2Node_ComponentBoundEvent_1_OnShowButtonDetails__DelegateSignature(const struct FBattlePassLandingPageButtonDisplayDetails& DisplayInfo);
	void BndEvt__BPS20_LandingPages_Button_CharacterCustomizer_K2Node_ComponentBoundEvent_9_OnShowButtonDetails__DelegateSignature(const struct FBattlePassLandingPageButtonDisplayDetails& DisplayInfo);
	void BndEvt__BPS20_LandingPages_Button_GiftBattlePass_K2Node_ComponentBoundEvent_2_OnShowButtonDetails__DelegateSignature(const struct FBattlePassLandingPageButtonDisplayDetails& DisplayInfo);
	void BndEvt__BPS20_LandingPages_Button_JoinSubscription_K2Node_ComponentBoundEvent_12_OnShowButtonDetails__DelegateSignature(const struct FBattlePassLandingPageButtonDisplayDetails& DisplayInfo);
	void BndEvt__BPS20_LandingPages_Button_Quests_K2Node_ComponentBoundEvent_10_OnShowButtonDetails__DelegateSignature(const struct FBattlePassLandingPageButtonDisplayDetails& DisplayInfo);
	void BndEvt__BPS20_LandingPages_Button_Rewards_K2Node_ComponentBoundEvent_8_OnShowButtonDetails__DelegateSignature(const struct FBattlePassLandingPageButtonDisplayDetails& DisplayInfo);
	void Button_BonusRewards_Event_0(class UBPS20_LandingPageButton_C* Button_BonusRewards_0);
	void Button_BuyBattlePass_Event_0(class UBPS20_LandingPage_SmallButton_C* Button_BuyBattlePass_0);
	void Button_BuyResources_Event_0(class UBPS20_LandingPage_SmallButton_C* Button_BuyResources_0);
	void Button_CharacterCustomizer_Event_0(class UBPS20_LandingPageButton_C* Button_CharacterCustomizer_0);
	void Button_GiftBattlePass_Event_0(class UBPS20_LandingPage_SmallButton_C* Button_GiftBattlePass_0);
	void Button_JoinSubscription_Event_0(class UBPS20_LandingPageButton_C* Button_JoinSubscription_0);
	void Button_MysteryRewards_Event_0(class UBPS20_LandingPageButton_C* Button_MysteryRewards);
	void Button_RewardOverview_Event_2(class UBPS20_LandingPageButton_C* Button_RewardOverview);
	void ExecuteUbergraph_BPS20_LandingPages(int32 EntryPoint);
	void On_BattlePass_completed(bool BPComplete);
	void On_Level_Changed(int32 Level);
	void OnBattlePassGiftingAllowed(const bool bGiftingAllowed);
	void OnBattlePassOwned();
	void OnBattlePassSubscriptionAllowed(const bool bSubscriptionAllowed);
	void OnEnterSubPage();
	void Play_intro();
	void SequenceEvent__ENTRYPOINTBPS20_LandingPages_0(class UBPS20_LandingPageButton_C* Button_RewardOverview);
	void SequenceEvent__ENTRYPOINTBPS20_LandingPages_1(class UBPS20_LandingPageButton_C* Button_CharacterCustomizer_0);
	void SequenceEvent__ENTRYPOINTBPS20_LandingPages_2(class UBPS20_LandingPageButton_C* Button_MysteryRewards);
	void SequenceEvent__ENTRYPOINTBPS20_LandingPages_3(class UBPS20_LandingPageButton_C* Button_BonusRewards_0);
	void SequenceEvent__ENTRYPOINTBPS20_LandingPages_4(class UBPS20_LandingPageButton_C* Button_JoinSubscription_0);
	void SequenceEvent__ENTRYPOINTBPS20_LandingPages_5(class UBPS20_LandingPage_SmallButton_C* Button_BuyResources_0);
	void SequenceEvent__ENTRYPOINTBPS20_LandingPages_6(class UBPS20_LandingPage_SmallButton_C* Button_GiftBattlePass_0);
	void SequenceEvent__ENTRYPOINTBPS20_LandingPages_7(class UBPS20_LandingPage_SmallButton_C* Button_BuyBattlePass_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPS20_LandingPages_C">();
	}
	static class UBPS20_LandingPages_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPS20_LandingPages_C>();
	}
};
static_assert(alignof(UBPS20_LandingPages_C) == 0x000008, "Wrong alignment on UBPS20_LandingPages_C");
static_assert(sizeof(UBPS20_LandingPages_C) == 0x0005F0, "Wrong size on UBPS20_LandingPages_C");
static_assert(offsetof(UBPS20_LandingPages_C, UberGraphFrame) == 0x000530, "Member 'UBPS20_LandingPages_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPS20_LandingPages_C, Intro) == 0x000538, "Member 'UBPS20_LandingPages_C::Intro' has a wrong offset!");
static_assert(offsetof(UBPS20_LandingPages_C, HorizontalBox_OwnBP) == 0x000540, "Member 'UBPS20_LandingPages_C::HorizontalBox_OwnBP' has a wrong offset!");
static_assert(offsetof(UBPS20_LandingPages_C, SeasonDataWidget) == 0x000548, "Member 'UBPS20_LandingPages_C::SeasonDataWidget' has a wrong offset!");
static_assert(offsetof(UBPS20_LandingPages_C, Switcher_BottonButtons) == 0x000550, "Member 'UBPS20_LandingPages_C::Switcher_BottonButtons' has a wrong offset!");
static_assert(offsetof(UBPS20_LandingPages_C, On_show_BP_character) == 0x000558, "Member 'UBPS20_LandingPages_C::On_show_BP_character' has a wrong offset!");
static_assert(offsetof(UBPS20_LandingPages_C, On_show_Custo_Character) == 0x000568, "Member 'UBPS20_LandingPages_C::On_show_Custo_Character' has a wrong offset!");
static_assert(offsetof(UBPS20_LandingPages_C, On_show_Mystery_Character) == 0x000578, "Member 'UBPS20_LandingPages_C::On_show_Mystery_Character' has a wrong offset!");
static_assert(offsetof(UBPS20_LandingPages_C, On_show_Bonus_Character) == 0x000588, "Member 'UBPS20_LandingPages_C::On_show_Bonus_Character' has a wrong offset!");
static_assert(offsetof(UBPS20_LandingPages_C, On_show_Crew_Character) == 0x000598, "Member 'UBPS20_LandingPages_C::On_show_Crew_Character' has a wrong offset!");
static_assert(offsetof(UBPS20_LandingPages_C, On_show_Buy_BP) == 0x0005A8, "Member 'UBPS20_LandingPages_C::On_show_Buy_BP' has a wrong offset!");
static_assert(offsetof(UBPS20_LandingPages_C, On_show_Buy_Level) == 0x0005B8, "Member 'UBPS20_LandingPages_C::On_show_Buy_Level' has a wrong offset!");
static_assert(offsetof(UBPS20_LandingPages_C, On_show_Gift_Battle_Pass) == 0x0005C8, "Member 'UBPS20_LandingPages_C::On_show_Gift_Battle_Pass' has a wrong offset!");
static_assert(offsetof(UBPS20_LandingPages_C, BPOwned) == 0x0005D8, "Member 'UBPS20_LandingPages_C::BPOwned' has a wrong offset!");
static_assert(offsetof(UBPS20_LandingPages_C, CustomizationOwned) == 0x0005D9, "Member 'UBPS20_LandingPages_C::CustomizationOwned' has a wrong offset!");
static_assert(offsetof(UBPS20_LandingPages_C, OnShowButtonDetails) == 0x0005E0, "Member 'UBPS20_LandingPages_C::OnShowButtonDetails' has a wrong offset!");

}

