#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS20_LandingPageButton

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BattlePassBase_structs.hpp"
#include "BattlePassBase_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPS20_LandingPageButton.BPS20_LandingPageButton_C
// 0x00D0 (0x1260 - 0x1190)
class UBPS20_LandingPageButton_C final : public UBattlePassLandingPageButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1190(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       burst;                                             // 0x1198(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x11A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x11A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USpacer*                                ExtraSpace;                                        // 0x11B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x11B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_32;                                          // 0x11C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x11C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_disabled;                                    // 0x11D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Lock_Purple;                                 // 0x11D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_selected_LR;                                 // 0x11E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_selected_TB;                                 // 0x11E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_Title;                                    // 0x11F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              Switcher_locked;                                   // 0x11F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ETextJustify                                  TileTextJustification;                             // 0x1200(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_1201[0x7];                                     // 0x1201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Material;                                          // 0x1208(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector2D                              In_Size;                                           // 0x1210(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Extra_Space;                                       // 0x1220(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_1224[0x4];                                     // 0x1224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Empty_text;                                        // 0x1228(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsDisabled;                                        // 0x1240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1241[0x7];                                     // 0x1241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FBattlePassLandingPageButtonDisplayDetails& DisplayInfo)> OnShowButtonDetails; // 0x1248(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          HasExtraLock;                                      // 0x1258(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_BPS20_LandingPageButton(int32 EntryPoint);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnDisplayDetailsUpdated(const struct FBattlePassLandingPageButtonDisplayDetails& NewDisplayDetails);
	void OnInitialized();
	void OnSubscriptionTextureLoaded(class UTexture2D* Texture);
	void Play_intro();
	void PreConstruct(bool IsDesignTime);
	void SetExtraLock(bool ExtraLock);
	void UpdateStatusIcons();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPS20_LandingPageButton_C">();
	}
	static class UBPS20_LandingPageButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPS20_LandingPageButton_C>();
	}
};
static_assert(alignof(UBPS20_LandingPageButton_C) == 0x000010, "Wrong alignment on UBPS20_LandingPageButton_C");
static_assert(sizeof(UBPS20_LandingPageButton_C) == 0x001260, "Wrong size on UBPS20_LandingPageButton_C");
static_assert(offsetof(UBPS20_LandingPageButton_C, UberGraphFrame) == 0x001190, "Member 'UBPS20_LandingPageButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPS20_LandingPageButton_C, burst) == 0x001198, "Member 'UBPS20_LandingPageButton_C::burst' has a wrong offset!");
static_assert(offsetof(UBPS20_LandingPageButton_C, Intro) == 0x0011A0, "Member 'UBPS20_LandingPageButton_C::Intro' has a wrong offset!");
static_assert(offsetof(UBPS20_LandingPageButton_C, Selected) == 0x0011A8, "Member 'UBPS20_LandingPageButton_C::Selected' has a wrong offset!");
static_assert(offsetof(UBPS20_LandingPageButton_C, ExtraSpace) == 0x0011B0, "Member 'UBPS20_LandingPageButton_C::ExtraSpace' has a wrong offset!");
static_assert(offsetof(UBPS20_LandingPageButton_C, Image) == 0x0011B8, "Member 'UBPS20_LandingPageButton_C::Image' has a wrong offset!");
static_assert(offsetof(UBPS20_LandingPageButton_C, Image_32) == 0x0011C0, "Member 'UBPS20_LandingPageButton_C::Image_32' has a wrong offset!");
static_assert(offsetof(UBPS20_LandingPageButton_C, Image_Background) == 0x0011C8, "Member 'UBPS20_LandingPageButton_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UBPS20_LandingPageButton_C, Image_disabled) == 0x0011D0, "Member 'UBPS20_LandingPageButton_C::Image_disabled' has a wrong offset!");
static_assert(offsetof(UBPS20_LandingPageButton_C, Image_Lock_Purple) == 0x0011D8, "Member 'UBPS20_LandingPageButton_C::Image_Lock_Purple' has a wrong offset!");
static_assert(offsetof(UBPS20_LandingPageButton_C, Image_selected_LR) == 0x0011E0, "Member 'UBPS20_LandingPageButton_C::Image_selected_LR' has a wrong offset!");
static_assert(offsetof(UBPS20_LandingPageButton_C, Image_selected_TB) == 0x0011E8, "Member 'UBPS20_LandingPageButton_C::Image_selected_TB' has a wrong offset!");
static_assert(offsetof(UBPS20_LandingPageButton_C, RichText_Title) == 0x0011F0, "Member 'UBPS20_LandingPageButton_C::RichText_Title' has a wrong offset!");
static_assert(offsetof(UBPS20_LandingPageButton_C, Switcher_locked) == 0x0011F8, "Member 'UBPS20_LandingPageButton_C::Switcher_locked' has a wrong offset!");
static_assert(offsetof(UBPS20_LandingPageButton_C, TileTextJustification) == 0x001200, "Member 'UBPS20_LandingPageButton_C::TileTextJustification' has a wrong offset!");
static_assert(offsetof(UBPS20_LandingPageButton_C, Material) == 0x001208, "Member 'UBPS20_LandingPageButton_C::Material' has a wrong offset!");
static_assert(offsetof(UBPS20_LandingPageButton_C, In_Size) == 0x001210, "Member 'UBPS20_LandingPageButton_C::In_Size' has a wrong offset!");
static_assert(offsetof(UBPS20_LandingPageButton_C, Extra_Space) == 0x001220, "Member 'UBPS20_LandingPageButton_C::Extra_Space' has a wrong offset!");
static_assert(offsetof(UBPS20_LandingPageButton_C, Empty_text) == 0x001228, "Member 'UBPS20_LandingPageButton_C::Empty_text' has a wrong offset!");
static_assert(offsetof(UBPS20_LandingPageButton_C, IsDisabled) == 0x001240, "Member 'UBPS20_LandingPageButton_C::IsDisabled' has a wrong offset!");
static_assert(offsetof(UBPS20_LandingPageButton_C, OnShowButtonDetails) == 0x001248, "Member 'UBPS20_LandingPageButton_C::OnShowButtonDetails' has a wrong offset!");
static_assert(offsetof(UBPS20_LandingPageButton_C, HasExtraLock) == 0x001258, "Member 'UBPS20_LandingPageButton_C::HasExtraLock' has a wrong offset!");

}

