#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS20_ContextualButton

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPS20_ContextualButton.BPS20_ContextualButton_C
// 0x00E0 (0x1100 - 0x1020)
class UBPS20_ContextualButton_C final : public UFortHoldableButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1020(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoldCompleted;                                     // 0x1028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoldProgress;                                      // 0x1030(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x1038(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       Button_text;                                       // 0x1040(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x1048(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_material;                                    // 0x1050(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Progress;                                    // 0x1058(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x1060(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_Icon;                                       // 0x1068(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Subtitle;                                     // 0x1070(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    UnbindedInputActionWidget;                         // 0x1078(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   In_Text;                                           // 0x1080(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	float                                         In_Width_Override;                                 // 0x1098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_109C[0x4];                                     // 0x109C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Material;                                          // 0x10A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	ETextJustify                                  Justification;                                     // 0x10A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_10A9[0x7];                                     // 0x10A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               HoldProgressDMI;                                   // 0x10B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   In_SubText;                                        // 0x10B8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          Show_BP_icon;                                      // 0x10D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D1[0x3];                                     // 0x10D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Size;                                              // 0x10D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         In_Height_Override;                                // 0x10D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_10DC[0x4];                                     // 0x10DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        FillingSoundAudioComponent;                        // 0x10E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             FillingSoundOverride;                              // 0x10E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             FillCompleteSoundOverride;                         // 0x10F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Font_Material;                                     // 0x10F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BP_OnHoldCompleted();
	void BP_OnHoldDecreased(const float HoldPercentage);
	void BP_OnHoldEnded(const float HoldPercentage, const bool bInUseSecondaryHoldAnimation);
	void BP_OnHoldIncreased(const float HoldPercentage);
	void BP_OnHoldReset();
	void BP_OnHoldStarted(const float HoldPercentage, const bool bInUseSecondaryHoldAnimation);
	void BP_OnHovered();
	void BP_OnPressed();
	void BP_OnUnhovered();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_BPS20_ContextualButton(int32 EntryPoint);
	void FillComplete();
	void PlayFillSound();
	void PreConstruct(bool IsDesignTime);
	void StopFillSound();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPS20_ContextualButton_C">();
	}
	static class UBPS20_ContextualButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPS20_ContextualButton_C>();
	}
};
static_assert(alignof(UBPS20_ContextualButton_C) == 0x000010, "Wrong alignment on UBPS20_ContextualButton_C");
static_assert(sizeof(UBPS20_ContextualButton_C) == 0x001100, "Wrong size on UBPS20_ContextualButton_C");
static_assert(offsetof(UBPS20_ContextualButton_C, UberGraphFrame) == 0x001020, "Member 'UBPS20_ContextualButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPS20_ContextualButton_C, HoldCompleted) == 0x001028, "Member 'UBPS20_ContextualButton_C::HoldCompleted' has a wrong offset!");
static_assert(offsetof(UBPS20_ContextualButton_C, HoldProgress) == 0x001030, "Member 'UBPS20_ContextualButton_C::HoldProgress' has a wrong offset!");
static_assert(offsetof(UBPS20_ContextualButton_C, Hover) == 0x001038, "Member 'UBPS20_ContextualButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UBPS20_ContextualButton_C, Button_text) == 0x001040, "Member 'UBPS20_ContextualButton_C::Button_text' has a wrong offset!");
static_assert(offsetof(UBPS20_ContextualButton_C, Image_Icon) == 0x001048, "Member 'UBPS20_ContextualButton_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UBPS20_ContextualButton_C, Image_material) == 0x001050, "Member 'UBPS20_ContextualButton_C::Image_material' has a wrong offset!");
static_assert(offsetof(UBPS20_ContextualButton_C, Image_Progress) == 0x001058, "Member 'UBPS20_ContextualButton_C::Image_Progress' has a wrong offset!");
static_assert(offsetof(UBPS20_ContextualButton_C, SizeBox_0) == 0x001060, "Member 'UBPS20_ContextualButton_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(UBPS20_ContextualButton_C, Spacer_Icon) == 0x001068, "Member 'UBPS20_ContextualButton_C::Spacer_Icon' has a wrong offset!");
static_assert(offsetof(UBPS20_ContextualButton_C, Text_Subtitle) == 0x001070, "Member 'UBPS20_ContextualButton_C::Text_Subtitle' has a wrong offset!");
static_assert(offsetof(UBPS20_ContextualButton_C, UnbindedInputActionWidget) == 0x001078, "Member 'UBPS20_ContextualButton_C::UnbindedInputActionWidget' has a wrong offset!");
static_assert(offsetof(UBPS20_ContextualButton_C, In_Text) == 0x001080, "Member 'UBPS20_ContextualButton_C::In_Text' has a wrong offset!");
static_assert(offsetof(UBPS20_ContextualButton_C, In_Width_Override) == 0x001098, "Member 'UBPS20_ContextualButton_C::In_Width_Override' has a wrong offset!");
static_assert(offsetof(UBPS20_ContextualButton_C, Material) == 0x0010A0, "Member 'UBPS20_ContextualButton_C::Material' has a wrong offset!");
static_assert(offsetof(UBPS20_ContextualButton_C, Justification) == 0x0010A8, "Member 'UBPS20_ContextualButton_C::Justification' has a wrong offset!");
static_assert(offsetof(UBPS20_ContextualButton_C, HoldProgressDMI) == 0x0010B0, "Member 'UBPS20_ContextualButton_C::HoldProgressDMI' has a wrong offset!");
static_assert(offsetof(UBPS20_ContextualButton_C, In_SubText) == 0x0010B8, "Member 'UBPS20_ContextualButton_C::In_SubText' has a wrong offset!");
static_assert(offsetof(UBPS20_ContextualButton_C, Show_BP_icon) == 0x0010D0, "Member 'UBPS20_ContextualButton_C::Show_BP_icon' has a wrong offset!");
static_assert(offsetof(UBPS20_ContextualButton_C, Size) == 0x0010D4, "Member 'UBPS20_ContextualButton_C::Size' has a wrong offset!");
static_assert(offsetof(UBPS20_ContextualButton_C, In_Height_Override) == 0x0010D8, "Member 'UBPS20_ContextualButton_C::In_Height_Override' has a wrong offset!");
static_assert(offsetof(UBPS20_ContextualButton_C, FillingSoundAudioComponent) == 0x0010E0, "Member 'UBPS20_ContextualButton_C::FillingSoundAudioComponent' has a wrong offset!");
static_assert(offsetof(UBPS20_ContextualButton_C, FillingSoundOverride) == 0x0010E8, "Member 'UBPS20_ContextualButton_C::FillingSoundOverride' has a wrong offset!");
static_assert(offsetof(UBPS20_ContextualButton_C, FillCompleteSoundOverride) == 0x0010F0, "Member 'UBPS20_ContextualButton_C::FillCompleteSoundOverride' has a wrong offset!");
static_assert(offsetof(UBPS20_ContextualButton_C, Font_Material) == 0x0010F8, "Member 'UBPS20_ContextualButton_C::Font_Material' has a wrong offset!");

}

