#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS20_BattlePassRewardPage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePassS20UI_classes.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPS20_BattlePassRewardPage.BPS20_BattlePassRewardPage_C
// 0x0040 (0x0588 - 0x0548)
class UBPS20_BattlePassRewardPage_C final : public UBattlePassRewardPageS20
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0548(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0550(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Header_intro;                                      // 0x0558(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_85;                                          // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Subtitle;                                          // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Title;                                             // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_23;                                    // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	void ExecuteUbergraph_BPS20_BattlePassRewardPage(int32 EntryPoint);
	void OnInitForPageType(const ERewardPageType InRewardPageType);
	void OnInputMethodChanged(const ECommonInputType InputType);
	void OnPageChanged(const int32 PageNumber);
	void PageNavigator_Event_0(class UPageNavigator_C* PageNavigator_0);
	void SequenceEvent__ENTRYPOINTBPS20_BattlePassRewardPage_0(class UPageNavigator_C* PageNavigator_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPS20_BattlePassRewardPage_C">();
	}
	static class UBPS20_BattlePassRewardPage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPS20_BattlePassRewardPage_C>();
	}
};
static_assert(alignof(UBPS20_BattlePassRewardPage_C) == 0x000008, "Wrong alignment on UBPS20_BattlePassRewardPage_C");
static_assert(sizeof(UBPS20_BattlePassRewardPage_C) == 0x000588, "Wrong size on UBPS20_BattlePassRewardPage_C");
static_assert(offsetof(UBPS20_BattlePassRewardPage_C, UberGraphFrame) == 0x000548, "Member 'UBPS20_BattlePassRewardPage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPS20_BattlePassRewardPage_C, Intro) == 0x000550, "Member 'UBPS20_BattlePassRewardPage_C::Intro' has a wrong offset!");
static_assert(offsetof(UBPS20_BattlePassRewardPage_C, Header_intro) == 0x000558, "Member 'UBPS20_BattlePassRewardPage_C::Header_intro' has a wrong offset!");
static_assert(offsetof(UBPS20_BattlePassRewardPage_C, Image_85) == 0x000560, "Member 'UBPS20_BattlePassRewardPage_C::Image_85' has a wrong offset!");
static_assert(offsetof(UBPS20_BattlePassRewardPage_C, SafeZone_0) == 0x000568, "Member 'UBPS20_BattlePassRewardPage_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UBPS20_BattlePassRewardPage_C, Subtitle) == 0x000570, "Member 'UBPS20_BattlePassRewardPage_C::Subtitle' has a wrong offset!");
static_assert(offsetof(UBPS20_BattlePassRewardPage_C, Title) == 0x000578, "Member 'UBPS20_BattlePassRewardPage_C::Title' has a wrong offset!");
static_assert(offsetof(UBPS20_BattlePassRewardPage_C, VerticalBox_23) == 0x000580, "Member 'UBPS20_BattlePassRewardPage_C::VerticalBox_23' has a wrong offset!");

}

