#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChatContainer

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChatContainer.ChatContainer_C
// 0x0090 (0x03A8 - 0x0318)
class UChatContainer_C final : public UFortChatContainer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SizeAnimation;                                     // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeAnimation;                                     // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          ChatBorder;                                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorderBackground;                            // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ConsoleChatShortcut;                               // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        CursorModeSwitcher;                                // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBox_Messages;                                     // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               HBox_Tabs;                                         // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HudContentHBox;                                    // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       KeybindWidget;                                     // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_ChatSize;                                  // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_ConsoleButtonSpaceProvider;                // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_SendButton;                               // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Disabled;                                     // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EUMGSequencePlayMode                          NewVar_0;                                          // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CurrentlyUsingGamepad;                             // 0x0391(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AnimationClosing;                                  // 0x0392(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_393[0x5];                                      // 0x0393(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             WindowCloseSound;                                  // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             WindowOpenSound;                                   // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__ChatContainer_ChatList_Messages_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature(class UUserWidget* Widget);
	void BndEvt__ConsoleChatShortcut_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void Construct();
	void Destruct();
	void ExecuteUbergraph_ChatContainer(int32 EntryPoint);
	void FocusChat();
	void HandleChatOpenChanged(bool bChatShouldBeOpen);
	void HandleCursorModeChanged(bool bEnabled, class FName ActionName, class UUserWidget* Widget);
	void OnChatOpenChanged(bool bShouldBeOpen);
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void OnSendButtonDisplayChanged(bool bShowSendButton);
	void OnSizeAnimationComplete();
	void SetChatBoxStyle();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChatContainer_C">();
	}
	static class UChatContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChatContainer_C>();
	}
};
static_assert(alignof(UChatContainer_C) == 0x000008, "Wrong alignment on UChatContainer_C");
static_assert(sizeof(UChatContainer_C) == 0x0003A8, "Wrong size on UChatContainer_C");
static_assert(offsetof(UChatContainer_C, UberGraphFrame) == 0x000318, "Member 'UChatContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, SizeAnimation) == 0x000320, "Member 'UChatContainer_C::SizeAnimation' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, FadeAnimation) == 0x000328, "Member 'UChatContainer_C::FadeAnimation' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, ChatBorder) == 0x000330, "Member 'UChatContainer_C::ChatBorder' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, CommonBorderBackground) == 0x000338, "Member 'UChatContainer_C::CommonBorderBackground' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, ConsoleChatShortcut) == 0x000340, "Member 'UChatContainer_C::ConsoleChatShortcut' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, CursorModeSwitcher) == 0x000348, "Member 'UChatContainer_C::CursorModeSwitcher' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, HBox_Messages) == 0x000350, "Member 'UChatContainer_C::HBox_Messages' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, HBox_Tabs) == 0x000358, "Member 'UChatContainer_C::HBox_Tabs' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, HudContentHBox) == 0x000360, "Member 'UChatContainer_C::HudContentHBox' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, KeybindWidget) == 0x000368, "Member 'UChatContainer_C::KeybindWidget' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, SizeBox_ChatSize) == 0x000370, "Member 'UChatContainer_C::SizeBox_ChatSize' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, SizeBox_ConsoleButtonSpaceProvider) == 0x000378, "Member 'UChatContainer_C::SizeBox_ConsoleButtonSpaceProvider' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, Switcher_SendButton) == 0x000380, "Member 'UChatContainer_C::Switcher_SendButton' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, Text_Disabled) == 0x000388, "Member 'UChatContainer_C::Text_Disabled' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, NewVar_0) == 0x000390, "Member 'UChatContainer_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, CurrentlyUsingGamepad) == 0x000391, "Member 'UChatContainer_C::CurrentlyUsingGamepad' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, AnimationClosing) == 0x000392, "Member 'UChatContainer_C::AnimationClosing' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, WindowCloseSound) == 0x000398, "Member 'UChatContainer_C::WindowCloseSound' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, WindowOpenSound) == 0x0003A0, "Member 'UChatContainer_C::WindowOpenSound' has a wrong offset!");

}

