#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ControllerDisconnectedModal

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function ControllerDisconnectedModal.ControllerDisconnectedModal_C.ExecuteUbergraph_ControllerDisconnectedModal
// 0x0004 (0x0004 - 0x0000)
struct ControllerDisconnectedModal_C_ExecuteUbergraph_ControllerDisconnectedModal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ControllerDisconnectedModal_C_ExecuteUbergraph_ControllerDisconnectedModal) == 0x000004, "Wrong alignment on ControllerDisconnectedModal_C_ExecuteUbergraph_ControllerDisconnectedModal");
static_assert(sizeof(ControllerDisconnectedModal_C_ExecuteUbergraph_ControllerDisconnectedModal) == 0x000004, "Wrong size on ControllerDisconnectedModal_C_ExecuteUbergraph_ControllerDisconnectedModal");
static_assert(offsetof(ControllerDisconnectedModal_C_ExecuteUbergraph_ControllerDisconnectedModal, EntryPoint) == 0x000000, "Member 'ControllerDisconnectedModal_C_ExecuteUbergraph_ControllerDisconnectedModal::EntryPoint' has a wrong offset!");

// Function ControllerDisconnectedModal.ControllerDisconnectedModal_C.OnAnalogValueChanged
// 0x02A8 (0x02A8 - 0x0000)
struct ControllerDisconnectedModal_C_OnAnalogValueChanged final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FAnalogInputEvent                      InAnalogInputEvent;                                // 0x0040(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0080(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0138(0x00B8)()
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x01F0(0x00B8)()
};
static_assert(alignof(ControllerDisconnectedModal_C_OnAnalogValueChanged) == 0x000008, "Wrong alignment on ControllerDisconnectedModal_C_OnAnalogValueChanged");
static_assert(sizeof(ControllerDisconnectedModal_C_OnAnalogValueChanged) == 0x0002A8, "Wrong size on ControllerDisconnectedModal_C_OnAnalogValueChanged");
static_assert(offsetof(ControllerDisconnectedModal_C_OnAnalogValueChanged, MyGeometry) == 0x000000, "Member 'ControllerDisconnectedModal_C_OnAnalogValueChanged::MyGeometry' has a wrong offset!");
static_assert(offsetof(ControllerDisconnectedModal_C_OnAnalogValueChanged, InAnalogInputEvent) == 0x000040, "Member 'ControllerDisconnectedModal_C_OnAnalogValueChanged::InAnalogInputEvent' has a wrong offset!");
static_assert(offsetof(ControllerDisconnectedModal_C_OnAnalogValueChanged, ReturnValue) == 0x000080, "Member 'ControllerDisconnectedModal_C_OnAnalogValueChanged::ReturnValue' has a wrong offset!");
static_assert(offsetof(ControllerDisconnectedModal_C_OnAnalogValueChanged, CallFunc_Unhandled_ReturnValue) == 0x000138, "Member 'ControllerDisconnectedModal_C_OnAnalogValueChanged::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(ControllerDisconnectedModal_C_OnAnalogValueChanged, CallFunc_Handled_ReturnValue) == 0x0001F0, "Member 'ControllerDisconnectedModal_C_OnAnalogValueChanged::CallFunc_Handled_ReturnValue' has a wrong offset!");

}

