#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CrewPurchase_RewardTile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CrewUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CrewPurchase_RewardTile.CrewPurchase_RewardTile_C
// 0x0040 (0x1030 - 0x0FF0)
class UCrewPurchase_RewardTile_C final : public UCrewRewardTile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0FF0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverScale;                                        // 0x0FF8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x1000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_check;                                       // 0x1008(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_EdgeSlant;                                   // 0x1010(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Frame;                                       // 0x1018(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Pulse;                                       // 0x1020(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Shadow;                                      // 0x1028(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnDeselected();
	void BP_OnSelected();
	void Construct();
	void ExecuteUbergraph_CrewPurchase_RewardTile(int32 EntryPoint);
	void OnDownloadTileImageComplete(class UTexture2D* Texture);
	void OnStartingDownloadTileImage();
	void OnUpdateOwnedState(bool bOwned);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CrewPurchase_RewardTile_C">();
	}
	static class UCrewPurchase_RewardTile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrewPurchase_RewardTile_C>();
	}
};
static_assert(alignof(UCrewPurchase_RewardTile_C) == 0x000010, "Wrong alignment on UCrewPurchase_RewardTile_C");
static_assert(sizeof(UCrewPurchase_RewardTile_C) == 0x001030, "Wrong size on UCrewPurchase_RewardTile_C");
static_assert(offsetof(UCrewPurchase_RewardTile_C, UberGraphFrame) == 0x000FF0, "Member 'UCrewPurchase_RewardTile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCrewPurchase_RewardTile_C, HoverScale) == 0x000FF8, "Member 'UCrewPurchase_RewardTile_C::HoverScale' has a wrong offset!");
static_assert(offsetof(UCrewPurchase_RewardTile_C, Hover) == 0x001000, "Member 'UCrewPurchase_RewardTile_C::Hover' has a wrong offset!");
static_assert(offsetof(UCrewPurchase_RewardTile_C, Image_check) == 0x001008, "Member 'UCrewPurchase_RewardTile_C::Image_check' has a wrong offset!");
static_assert(offsetof(UCrewPurchase_RewardTile_C, Image_EdgeSlant) == 0x001010, "Member 'UCrewPurchase_RewardTile_C::Image_EdgeSlant' has a wrong offset!");
static_assert(offsetof(UCrewPurchase_RewardTile_C, Image_Frame) == 0x001018, "Member 'UCrewPurchase_RewardTile_C::Image_Frame' has a wrong offset!");
static_assert(offsetof(UCrewPurchase_RewardTile_C, Image_Pulse) == 0x001020, "Member 'UCrewPurchase_RewardTile_C::Image_Pulse' has a wrong offset!");
static_assert(offsetof(UCrewPurchase_RewardTile_C, Image_Shadow) == 0x001028, "Member 'UCrewPurchase_RewardTile_C::Image_Shadow' has a wrong offset!");

}

