#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeadzoneAdjustment

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DeadzoneAdjustment.DeadzoneAdjustment_C
// 0x0030 (0x02A8 - 0x0278)
class UDeadzoneAdjustment_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Deadzone_Adjustment;                               // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOptionsMenuSetting_C*                  Deadzone_Adjustment_Slider;                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Deadzone_Max;                                      // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ResetButton;                                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ESettingType                                  SettingType;                                       // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	class UWidget* DoCustomNavigation_0(EUINavigation Navigation_0);
	void ExecuteUbergraph_DeadzoneAdjustment(int32 EntryPoint);
	void OnValueChanged_Bind(float Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DeadzoneAdjustment_C">();
	}
	static class UDeadzoneAdjustment_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDeadzoneAdjustment_C>();
	}
};
static_assert(alignof(UDeadzoneAdjustment_C) == 0x000008, "Wrong alignment on UDeadzoneAdjustment_C");
static_assert(sizeof(UDeadzoneAdjustment_C) == 0x0002A8, "Wrong size on UDeadzoneAdjustment_C");
static_assert(offsetof(UDeadzoneAdjustment_C, UberGraphFrame) == 0x000278, "Member 'UDeadzoneAdjustment_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDeadzoneAdjustment_C, Deadzone_Adjustment) == 0x000280, "Member 'UDeadzoneAdjustment_C::Deadzone_Adjustment' has a wrong offset!");
static_assert(offsetof(UDeadzoneAdjustment_C, Deadzone_Adjustment_Slider) == 0x000288, "Member 'UDeadzoneAdjustment_C::Deadzone_Adjustment_Slider' has a wrong offset!");
static_assert(offsetof(UDeadzoneAdjustment_C, Deadzone_Max) == 0x000290, "Member 'UDeadzoneAdjustment_C::Deadzone_Max' has a wrong offset!");
static_assert(offsetof(UDeadzoneAdjustment_C, ResetButton) == 0x000298, "Member 'UDeadzoneAdjustment_C::ResetButton' has a wrong offset!");
static_assert(offsetof(UDeadzoneAdjustment_C, SettingType) == 0x0002A0, "Member 'UDeadzoneAdjustment_C::SettingType' has a wrong offset!");

}

