#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DiscoverySubModeLobbyFirstTimeNotification

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DiscoverySubModeLobbyFirstTimeNotification.DiscoverySubModeLobbyFirstTimeNotification_C
// 0x0030 (0x02A8 - 0x0278)
class UDiscoverySubModeLobbyFirstTimeNotification_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               ParentOverlay;                                     // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_MainText;                                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   NotificationFormatText;                            // 0x0290(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_DiscoverySubModeLobbyFirstTimeNotification(int32 EntryPoint);
	void HideNotification();
	void OnInitialized();
	void ShowNotification();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DiscoverySubModeLobbyFirstTimeNotification_C">();
	}
	static class UDiscoverySubModeLobbyFirstTimeNotification_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDiscoverySubModeLobbyFirstTimeNotification_C>();
	}
};
static_assert(alignof(UDiscoverySubModeLobbyFirstTimeNotification_C) == 0x000008, "Wrong alignment on UDiscoverySubModeLobbyFirstTimeNotification_C");
static_assert(sizeof(UDiscoverySubModeLobbyFirstTimeNotification_C) == 0x0002A8, "Wrong size on UDiscoverySubModeLobbyFirstTimeNotification_C");
static_assert(offsetof(UDiscoverySubModeLobbyFirstTimeNotification_C, UberGraphFrame) == 0x000278, "Member 'UDiscoverySubModeLobbyFirstTimeNotification_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDiscoverySubModeLobbyFirstTimeNotification_C, ParentOverlay) == 0x000280, "Member 'UDiscoverySubModeLobbyFirstTimeNotification_C::ParentOverlay' has a wrong offset!");
static_assert(offsetof(UDiscoverySubModeLobbyFirstTimeNotification_C, Text_MainText) == 0x000288, "Member 'UDiscoverySubModeLobbyFirstTimeNotification_C::Text_MainText' has a wrong offset!");
static_assert(offsetof(UDiscoverySubModeLobbyFirstTimeNotification_C, NotificationFormatText) == 0x000290, "Member 'UDiscoverySubModeLobbyFirstTimeNotification_C::NotificationFormatText' has a wrong offset!");

}

