#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DiscoverySubModeLobbyViolator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DiscoverySubModeLobbyViolator.DiscoverySubModeLobbyViolator_C
// 0x0030 (0x02A8 - 0x0278)
class UDiscoverySubModeLobbyViolator_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               ParentOverlay;                                     // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_MainText;                                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   NotificationFormatText;                            // 0x0290(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_DiscoverySubModeLobbyViolator(int32 EntryPoint);
	void HideNotification();
	void OnInitialized();
	void ShowNotification(const class FText& ActivityName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DiscoverySubModeLobbyViolator_C">();
	}
	static class UDiscoverySubModeLobbyViolator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDiscoverySubModeLobbyViolator_C>();
	}
};
static_assert(alignof(UDiscoverySubModeLobbyViolator_C) == 0x000008, "Wrong alignment on UDiscoverySubModeLobbyViolator_C");
static_assert(sizeof(UDiscoverySubModeLobbyViolator_C) == 0x0002A8, "Wrong size on UDiscoverySubModeLobbyViolator_C");
static_assert(offsetof(UDiscoverySubModeLobbyViolator_C, UberGraphFrame) == 0x000278, "Member 'UDiscoverySubModeLobbyViolator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDiscoverySubModeLobbyViolator_C, ParentOverlay) == 0x000280, "Member 'UDiscoverySubModeLobbyViolator_C::ParentOverlay' has a wrong offset!");
static_assert(offsetof(UDiscoverySubModeLobbyViolator_C, Text_MainText) == 0x000288, "Member 'UDiscoverySubModeLobbyViolator_C::Text_MainText' has a wrong offset!");
static_assert(offsetof(UDiscoverySubModeLobbyViolator_C, NotificationFormatText) == 0x000290, "Member 'UDiscoverySubModeLobbyViolator_C::NotificationFormatText' has a wrong offset!");

}

