#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ErrorInfoFlag

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ErrorInfoFlag.ErrorInfoFlag_C
// 0x0040 (0x02B8 - 0x0278)
class UErrorInfoFlag_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_ErrorBG;                                     // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ErrorBG_Accent;                              // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OptionalIcon;                                      // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_UserInformation;                              // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           AccentColor;                                       // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     IconMaterial;                                      // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateText(const class FText& Text);
	void UpdateIconMaterial(class UMaterialInterface* Material);
	void UpdateAccentColor(const struct FLinearColor& Color);
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_ErrorInfoFlag(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ErrorInfoFlag_C">();
	}
	static class UErrorInfoFlag_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UErrorInfoFlag_C>();
	}
};
static_assert(alignof(UErrorInfoFlag_C) == 0x000008, "Wrong alignment on UErrorInfoFlag_C");
static_assert(sizeof(UErrorInfoFlag_C) == 0x0002B8, "Wrong size on UErrorInfoFlag_C");
static_assert(offsetof(UErrorInfoFlag_C, UberGraphFrame) == 0x000278, "Member 'UErrorInfoFlag_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UErrorInfoFlag_C, Image_ErrorBG) == 0x000280, "Member 'UErrorInfoFlag_C::Image_ErrorBG' has a wrong offset!");
static_assert(offsetof(UErrorInfoFlag_C, Image_ErrorBG_Accent) == 0x000288, "Member 'UErrorInfoFlag_C::Image_ErrorBG_Accent' has a wrong offset!");
static_assert(offsetof(UErrorInfoFlag_C, OptionalIcon) == 0x000290, "Member 'UErrorInfoFlag_C::OptionalIcon' has a wrong offset!");
static_assert(offsetof(UErrorInfoFlag_C, Text_UserInformation) == 0x000298, "Member 'UErrorInfoFlag_C::Text_UserInformation' has a wrong offset!");
static_assert(offsetof(UErrorInfoFlag_C, AccentColor) == 0x0002A0, "Member 'UErrorInfoFlag_C::AccentColor' has a wrong offset!");
static_assert(offsetof(UErrorInfoFlag_C, IconMaterial) == 0x0002B0, "Member 'UErrorInfoFlag_C::IconMaterial' has a wrong offset!");

}

