#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventsSimpleTab

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CommonUILegacy_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EventsSimpleTab.EventsSimpleTab_C
// 0x00F0 (0x10E0 - 0x0FF0)
class UEventsSimpleTab_C final : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_FE8[0x8];                                      // 0x0FE8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0FF0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x0FF8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x1000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       CenterButtonTextWidget;                            // 0x1008(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CenterButtonTextWidget_White;                      // 0x1010(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_VariablePadding;                      // 0x1018(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ButtonTop;                                   // 0x1020(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_ButtonBG;                                  // 0x1028(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ToUpper;                                           // 0x1030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          XL;                                                // 0x1031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1032[0x6];                                     // 0x1032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ButtonNameText;                                    // 0x1038(0x0018)(Edit, BlueprintVisible)
	TMap<class FString, struct FLinearColor>      Color;                                             // 0x1050(0x0050)(Edit, BlueprintVisible)
	struct FLinearColor                           GamepadButtonTextColor;                            // 0x10A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DefaultTextColor;                                  // 0x10B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ButtonPadding;                                     // 0x10C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          VisualSelectionState;                              // 0x10D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_EventsSimpleTab(int32 EntryPoint);
	void OnInitialized();
	void OnSelectedChangedEvent(class UCommonButtonLegacy* Button, bool Selected_0);
	void PreConstruct(bool IsDesignTime);
	void UpdateColor(const class FString& ParameterName, const struct FLinearColor& New_Color);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EventsSimpleTab_C">();
	}
	static class UEventsSimpleTab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventsSimpleTab_C>();
	}
};
static_assert(alignof(UEventsSimpleTab_C) == 0x000010, "Wrong alignment on UEventsSimpleTab_C");
static_assert(sizeof(UEventsSimpleTab_C) == 0x0010E0, "Wrong size on UEventsSimpleTab_C");
static_assert(offsetof(UEventsSimpleTab_C, UberGraphFrame) == 0x000FF0, "Member 'UEventsSimpleTab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEventsSimpleTab_C, Selected) == 0x000FF8, "Member 'UEventsSimpleTab_C::Selected' has a wrong offset!");
static_assert(offsetof(UEventsSimpleTab_C, Hovered) == 0x001000, "Member 'UEventsSimpleTab_C::Hovered' has a wrong offset!");
static_assert(offsetof(UEventsSimpleTab_C, CenterButtonTextWidget) == 0x001008, "Member 'UEventsSimpleTab_C::CenterButtonTextWidget' has a wrong offset!");
static_assert(offsetof(UEventsSimpleTab_C, CenterButtonTextWidget_White) == 0x001010, "Member 'UEventsSimpleTab_C::CenterButtonTextWidget_White' has a wrong offset!");
static_assert(offsetof(UEventsSimpleTab_C, CommonBorder_VariablePadding) == 0x001018, "Member 'UEventsSimpleTab_C::CommonBorder_VariablePadding' has a wrong offset!");
static_assert(offsetof(UEventsSimpleTab_C, Image_ButtonTop) == 0x001020, "Member 'UEventsSimpleTab_C::Image_ButtonTop' has a wrong offset!");
static_assert(offsetof(UEventsSimpleTab_C, Overlay_ButtonBG) == 0x001028, "Member 'UEventsSimpleTab_C::Overlay_ButtonBG' has a wrong offset!");
static_assert(offsetof(UEventsSimpleTab_C, ToUpper) == 0x001030, "Member 'UEventsSimpleTab_C::ToUpper' has a wrong offset!");
static_assert(offsetof(UEventsSimpleTab_C, XL) == 0x001031, "Member 'UEventsSimpleTab_C::XL' has a wrong offset!");
static_assert(offsetof(UEventsSimpleTab_C, ButtonNameText) == 0x001038, "Member 'UEventsSimpleTab_C::ButtonNameText' has a wrong offset!");
static_assert(offsetof(UEventsSimpleTab_C, Color) == 0x001050, "Member 'UEventsSimpleTab_C::Color' has a wrong offset!");
static_assert(offsetof(UEventsSimpleTab_C, GamepadButtonTextColor) == 0x0010A0, "Member 'UEventsSimpleTab_C::GamepadButtonTextColor' has a wrong offset!");
static_assert(offsetof(UEventsSimpleTab_C, DefaultTextColor) == 0x0010B0, "Member 'UEventsSimpleTab_C::DefaultTextColor' has a wrong offset!");
static_assert(offsetof(UEventsSimpleTab_C, ButtonPadding) == 0x0010C0, "Member 'UEventsSimpleTab_C::ButtonPadding' has a wrong offset!");
static_assert(offsetof(UEventsSimpleTab_C, VisualSelectionState) == 0x0010D0, "Member 'UEventsSimpleTab_C::VisualSelectionState' has a wrong offset!");

}

