#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventScoreRow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EventScoreRow.EventScoreRow_C
// 0x0028 (0x02A0 - 0x0278)
class UEventScoreRow_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 ImageDivider;                                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       StatLabelText;                                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       StatValueText;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          FinalEntry;                                        // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_EventScoreRow(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetData(const class FText& Label, int32 Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EventScoreRow_C">();
	}
	static class UEventScoreRow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventScoreRow_C>();
	}
};
static_assert(alignof(UEventScoreRow_C) == 0x000008, "Wrong alignment on UEventScoreRow_C");
static_assert(sizeof(UEventScoreRow_C) == 0x0002A0, "Wrong size on UEventScoreRow_C");
static_assert(offsetof(UEventScoreRow_C, UberGraphFrame) == 0x000278, "Member 'UEventScoreRow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEventScoreRow_C, ImageDivider) == 0x000280, "Member 'UEventScoreRow_C::ImageDivider' has a wrong offset!");
static_assert(offsetof(UEventScoreRow_C, StatLabelText) == 0x000288, "Member 'UEventScoreRow_C::StatLabelText' has a wrong offset!");
static_assert(offsetof(UEventScoreRow_C, StatValueText) == 0x000290, "Member 'UEventScoreRow_C::StatValueText' has a wrong offset!");
static_assert(offsetof(UEventScoreRow_C, FinalEntry) == 0x000298, "Member 'UEventScoreRow_C::FinalEntry' has a wrong offset!");

}

