#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventTeamMatchHistoryEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EventTeamMatchHistoryEntry.EventTeamMatchHistoryEntry_C
// 0x0060 (0x1090 - 0x1030)
class UEventTeamMatchHistoryEntry_C final : public UFortEventTeamMatchHistoryEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1030(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x1038(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          Border_Zebra;                                      // 0x1040(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_eliminations;                                // 0x1048(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_OnlineStatus;                                // 0x1050(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Placement;                                   // 0x1058(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SelectedBG;                                  // 0x1060(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ReplayInteraction;                            // 0x1068(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Hovered;                                           // 0x1070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              Unhovered;                                         // 0x1080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_EventTeamMatchHistoryEntry(int32 EntryPoint);
	void OnListItemObjectSet(class UObject* ListItemObject);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EventTeamMatchHistoryEntry_C">();
	}
	static class UEventTeamMatchHistoryEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventTeamMatchHistoryEntry_C>();
	}
};
static_assert(alignof(UEventTeamMatchHistoryEntry_C) == 0x000010, "Wrong alignment on UEventTeamMatchHistoryEntry_C");
static_assert(sizeof(UEventTeamMatchHistoryEntry_C) == 0x001090, "Wrong size on UEventTeamMatchHistoryEntry_C");
static_assert(offsetof(UEventTeamMatchHistoryEntry_C, UberGraphFrame) == 0x001030, "Member 'UEventTeamMatchHistoryEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryEntry_C, Selected) == 0x001038, "Member 'UEventTeamMatchHistoryEntry_C::Selected' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryEntry_C, Border_Zebra) == 0x001040, "Member 'UEventTeamMatchHistoryEntry_C::Border_Zebra' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryEntry_C, Image_eliminations) == 0x001048, "Member 'UEventTeamMatchHistoryEntry_C::Image_eliminations' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryEntry_C, Image_OnlineStatus) == 0x001050, "Member 'UEventTeamMatchHistoryEntry_C::Image_OnlineStatus' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryEntry_C, Image_Placement) == 0x001058, "Member 'UEventTeamMatchHistoryEntry_C::Image_Placement' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryEntry_C, Image_SelectedBG) == 0x001060, "Member 'UEventTeamMatchHistoryEntry_C::Image_SelectedBG' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryEntry_C, Text_ReplayInteraction) == 0x001068, "Member 'UEventTeamMatchHistoryEntry_C::Text_ReplayInteraction' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryEntry_C, Hovered) == 0x001070, "Member 'UEventTeamMatchHistoryEntry_C::Hovered' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryEntry_C, Unhovered) == 0x001080, "Member 'UEventTeamMatchHistoryEntry_C::Unhovered' has a wrong offset!");

}

