#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Prime_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "ControlRig_structs.hpp"
#include "Engine_structs.hpp"
#include "GravityOverrideParamsStruct_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_Prime_Skeleton_AnimBlueprint.F_MED_Prime_Skeleton_AnimBlueprint_C
// 0x5AB0 (0x6130 - 0x0680)
class UF_MED_Prime_Skeleton_AnimBlueprint_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0680(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0688(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0690(0x0008)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0698(0x0180)(ContainsInstancedReference)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0818(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0838(0x0020)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x0858(0x0458)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_9;                        // 0x0CB0(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_8;                        // 0x0DB8(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_7;                        // 0x0EC0(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_6;                        // 0x0FC8(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_5;                        // 0x10D0(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_4;                        // 0x11D8(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_3;                        // 0x12E0(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_2;                        // 0x13E8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x14F0(0x0128)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_1;                        // 0x1618(0x0108)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_2;                         // 0x1720(0x0980)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_6;                      // 0x20A0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_5;                      // 0x25B0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0x2AC0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x2FD0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x34E0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x39F0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x3F00(0x0510)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x4410(0x0128)()
	uint8                                         Pad_4538[0x8];                                     // 0x4538(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_1;                         // 0x4540(0x0980)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x4EC0(0x0128)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x4FE8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x50F0(0x0128)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x5218(0x0020)()
	uint8                                         Pad_5238[0x8];                                     // 0x5238(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x5240(0x0980)()
	struct FGravityOverrideParamsStruct           Gravity_Override_Params;                           // 0x5BC0(0x0548)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Gravity_Override;                                  // 0x6108(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Neck_Alpha;                                        // 0x6120(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Head_Tilt_Alpha;                                   // 0x6124(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Skydive_Alpha;                                     // 0x6128(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_Prime_Skeleton_AnimBlueprint_C">();
	}
	static class UF_MED_Prime_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_Prime_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(UF_MED_Prime_Skeleton_AnimBlueprint_C) == 0x000010, "Wrong alignment on UF_MED_Prime_Skeleton_AnimBlueprint_C");
static_assert(sizeof(UF_MED_Prime_Skeleton_AnimBlueprint_C) == 0x006130, "Wrong size on UF_MED_Prime_Skeleton_AnimBlueprint_C");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x000680, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_C, AnimBlueprintExtension_PropertyAccess) == 0x000688, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_C, AnimBlueprintExtension_Base) == 0x000690, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_C, AnimGraphNode_CopyPoseFromMesh) == 0x000698, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_C, AnimGraphNode_LocalToComponentSpace) == 0x000818, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace) == 0x000838, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_C, AnimGraphNode_ControlRig) == 0x000858, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_C::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_C, AnimGraphNode_Constraint_9) == 0x000CB0, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_C::AnimGraphNode_Constraint_9' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_C, AnimGraphNode_Constraint_8) == 0x000DB8, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_C::AnimGraphNode_Constraint_8' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_C, AnimGraphNode_Constraint_7) == 0x000EC0, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_C::AnimGraphNode_Constraint_7' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_C, AnimGraphNode_Constraint_6) == 0x000FC8, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_C::AnimGraphNode_Constraint_6' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_C, AnimGraphNode_Constraint_5) == 0x0010D0, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_C::AnimGraphNode_Constraint_5' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_C, AnimGraphNode_Constraint_4) == 0x0011D8, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_C::AnimGraphNode_Constraint_4' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_C, AnimGraphNode_Constraint_3) == 0x0012E0, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_C::AnimGraphNode_Constraint_3' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_C, AnimGraphNode_Constraint_2) == 0x0013E8, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_C::AnimGraphNode_Constraint_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone_3) == 0x0014F0, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_C, AnimGraphNode_Constraint_1) == 0x001618, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_C::AnimGraphNode_Constraint_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_C, AnimGraphNode_RigidBody_2) == 0x001720, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_C::AnimGraphNode_RigidBody_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_C, AnimGraphNode_AnimDynamics_6) == 0x0020A0, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_C::AnimGraphNode_AnimDynamics_6' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_C, AnimGraphNode_AnimDynamics_5) == 0x0025B0, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_C::AnimGraphNode_AnimDynamics_5' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_C, AnimGraphNode_AnimDynamics_4) == 0x002AC0, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_C::AnimGraphNode_AnimDynamics_4' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_C, AnimGraphNode_AnimDynamics_3) == 0x002FD0, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_C, AnimGraphNode_AnimDynamics_2) == 0x0034E0, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_C, AnimGraphNode_AnimDynamics_1) == 0x0039F0, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_C, AnimGraphNode_AnimDynamics) == 0x003F00, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone_2) == 0x004410, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_C, AnimGraphNode_RigidBody_1) == 0x004540, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_C::AnimGraphNode_RigidBody_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone_1) == 0x004EC0, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_C, AnimGraphNode_Constraint) == 0x004FE8, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_C::AnimGraphNode_Constraint' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone) == 0x0050F0, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_C, AnimGraphNode_Root) == 0x005218, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_C, AnimGraphNode_RigidBody) == 0x005240, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_C, Gravity_Override_Params) == 0x005BC0, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_C::Gravity_Override_Params' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_C, Gravity_Override) == 0x006108, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_C::Gravity_Override' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_C, Neck_Alpha) == 0x006120, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_C::Neck_Alpha' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_C, Head_Tilt_Alpha) == 0x006124, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_C::Head_Tilt_Alpha' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_C, Skydive_Alpha) == 0x006128, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_C::Skydive_Alpha' has a wrong offset!");

}

