#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Prime_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GravityOverrideSettingStruct_structs.hpp"


namespace SDK::Params
{

// Function F_MED_Prime_Skeleton_AnimBlueprint.F_MED_Prime_Skeleton_AnimBlueprint_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct F_MED_Prime_Skeleton_AnimBlueprint_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(F_MED_Prime_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000008, "Wrong alignment on F_MED_Prime_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(sizeof(F_MED_Prime_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000010, "Wrong size on F_MED_Prime_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(offsetof(F_MED_Prime_Skeleton_AnimBlueprint_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'F_MED_Prime_Skeleton_AnimBlueprint_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function F_MED_Prime_Skeleton_AnimBlueprint.F_MED_Prime_Skeleton_AnimBlueprint_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct F_MED_Prime_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(F_MED_Prime_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on F_MED_Prime_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(sizeof(F_MED_Prime_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on F_MED_Prime_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(offsetof(F_MED_Prime_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'F_MED_Prime_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function F_MED_Prime_Skeleton_AnimBlueprint.F_MED_Prime_Skeleton_AnimBlueprint_C.ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint
// 0x0240 (0x0240 - 0x0000)
struct F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Gravity_Override_State_Function_GravityOverride; // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Gravity_Override_State_Function_CurrentStateOut; // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGravityOverrideSettingStruct          CallFunc_Gravity_Override_State_Function_GravityOverrideSettingsOut; // 0x0030(0x0068)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue; // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetDeltaTransformFromRefPose_ReturnValue; // 0x00A0(0x0060)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue_1; // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0xC];                                      // 0x0164(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetDeltaTransformFromRefPose_ReturnValue_1; // 0x0170(0x0060)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_1;            // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint) == 0x000010, "Wrong alignment on F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint");
static_assert(sizeof(F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint) == 0x000240, "Wrong size on F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint");
static_assert(offsetof(F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint, EntryPoint) == 0x000000, "Member 'F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000004, "Member 'F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint, CallFunc_Gravity_Override_State_Function_GravityOverride) == 0x000008, "Member 'F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint::CallFunc_Gravity_Override_State_Function_GravityOverride' has a wrong offset!");
static_assert(offsetof(F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint, CallFunc_Gravity_Override_State_Function_CurrentStateOut) == 0x000020, "Member 'F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint::CallFunc_Gravity_Override_State_Function_CurrentStateOut' has a wrong offset!");
static_assert(offsetof(F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint, CallFunc_Gravity_Override_State_Function_GravityOverrideSettingsOut) == 0x000030, "Member 'F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint::CallFunc_Gravity_Override_State_Function_GravityOverrideSettingsOut' has a wrong offset!");
static_assert(offsetof(F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint, CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue) == 0x000098, "Member 'F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint::CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint, CallFunc_GetDeltaTransformFromRefPose_ReturnValue) == 0x0000A0, "Member 'F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint::CallFunc_GetDeltaTransformFromRefPose_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint, K2Node_Event_DeltaTimeX) == 0x000100, "Member 'F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint, CallFunc_BreakTransform_Location) == 0x000108, "Member 'F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint, CallFunc_BreakTransform_Rotation) == 0x000120, "Member 'F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint, CallFunc_BreakTransform_Scale) == 0x000138, "Member 'F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint, CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue_1) == 0x000150, "Member 'F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint::CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint, CallFunc_BreakRotator_Roll) == 0x000158, "Member 'F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint, CallFunc_BreakRotator_Pitch) == 0x00015C, "Member 'F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint, CallFunc_BreakRotator_Yaw) == 0x000160, "Member 'F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint, CallFunc_GetDeltaTransformFromRefPose_ReturnValue_1) == 0x000170, "Member 'F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint::CallFunc_GetDeltaTransformFromRefPose_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint, CallFunc_MapRangeClamped_ReturnValue) == 0x0001D0, "Member 'F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint, CallFunc_BreakTransform_Location_1) == 0x0001D8, "Member 'F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint, CallFunc_BreakTransform_Rotation_1) == 0x0001F0, "Member 'F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint, CallFunc_BreakTransform_Scale_1) == 0x000208, "Member 'F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint, CallFunc_BreakRotator_Roll_1) == 0x000220, "Member 'F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint, CallFunc_BreakRotator_Pitch_1) == 0x000224, "Member 'F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint, CallFunc_BreakRotator_Yaw_1) == 0x000228, "Member 'F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint, CallFunc_MapRangeClamped_ReturnValue_1) == 0x00022C, "Member 'F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint, CallFunc_BooleanOR_ReturnValue) == 0x000230, "Member 'F_MED_Prime_Skeleton_AnimBlueprint_C_ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

