#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Elastic_ASN_3_AnimBP_PRIME

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_Elastic_ASN_3_AnimBP_PRIME.F_MED_Elastic_ASN_3_AnimBP_PRIME_C
// 0x12A0 (0x1920 - 0x0680)
class UF_MED_Elastic_ASN_3_AnimBP_PRIME_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0680(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0688(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0690(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0698(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_1;                  // 0x06B8(0x0180)(ContainsInstancedReference)
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0838(0x0180)(ContainsInstancedReference)
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x09B8(0x00E0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x0A98(0x0128)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x0BC0(0x0980)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x1540(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1668(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1688(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x16A8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x17D0(0x0128)()
	float                                         HeadUp;                                            // 0x18F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18FC[0x4];                                     // 0x18FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 Body_Mesh;                                         // 0x1900(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   Pawn_Owner;                                        // 0x1908(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Head_MESH;                                         // 0x1910(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_F_MED_Elastic_ASN_3_AnimBP_PRIME(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_Elastic_ASN_3_AnimBP_PRIME_C">();
	}
	static class UF_MED_Elastic_ASN_3_AnimBP_PRIME_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_Elastic_ASN_3_AnimBP_PRIME_C>();
	}
};
static_assert(alignof(UF_MED_Elastic_ASN_3_AnimBP_PRIME_C) == 0x000010, "Wrong alignment on UF_MED_Elastic_ASN_3_AnimBP_PRIME_C");
static_assert(sizeof(UF_MED_Elastic_ASN_3_AnimBP_PRIME_C) == 0x001920, "Wrong size on UF_MED_Elastic_ASN_3_AnimBP_PRIME_C");
static_assert(offsetof(UF_MED_Elastic_ASN_3_AnimBP_PRIME_C, UberGraphFrame) == 0x000680, "Member 'UF_MED_Elastic_ASN_3_AnimBP_PRIME_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_MED_Elastic_ASN_3_AnimBP_PRIME_C, AnimBlueprintExtension_PropertyAccess) == 0x000688, "Member 'UF_MED_Elastic_ASN_3_AnimBP_PRIME_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UF_MED_Elastic_ASN_3_AnimBP_PRIME_C, AnimBlueprintExtension_Base) == 0x000690, "Member 'UF_MED_Elastic_ASN_3_AnimBP_PRIME_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UF_MED_Elastic_ASN_3_AnimBP_PRIME_C, AnimGraphNode_Root) == 0x000698, "Member 'UF_MED_Elastic_ASN_3_AnimBP_PRIME_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_MED_Elastic_ASN_3_AnimBP_PRIME_C, AnimGraphNode_CopyPoseFromMesh_1) == 0x0006B8, "Member 'UF_MED_Elastic_ASN_3_AnimBP_PRIME_C::AnimGraphNode_CopyPoseFromMesh_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Elastic_ASN_3_AnimBP_PRIME_C, AnimGraphNode_CopyPoseFromMesh) == 0x000838, "Member 'UF_MED_Elastic_ASN_3_AnimBP_PRIME_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UF_MED_Elastic_ASN_3_AnimBP_PRIME_C, AnimGraphNode_LayeredBoneBlend) == 0x0009B8, "Member 'UF_MED_Elastic_ASN_3_AnimBP_PRIME_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UF_MED_Elastic_ASN_3_AnimBP_PRIME_C, AnimGraphNode_ModifyBone_3) == 0x000A98, "Member 'UF_MED_Elastic_ASN_3_AnimBP_PRIME_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UF_MED_Elastic_ASN_3_AnimBP_PRIME_C, AnimGraphNode_RigidBody) == 0x000BC0, "Member 'UF_MED_Elastic_ASN_3_AnimBP_PRIME_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UF_MED_Elastic_ASN_3_AnimBP_PRIME_C, AnimGraphNode_ModifyBone_2) == 0x001540, "Member 'UF_MED_Elastic_ASN_3_AnimBP_PRIME_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Elastic_ASN_3_AnimBP_PRIME_C, AnimGraphNode_LocalToComponentSpace) == 0x001668, "Member 'UF_MED_Elastic_ASN_3_AnimBP_PRIME_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Elastic_ASN_3_AnimBP_PRIME_C, AnimGraphNode_ComponentToLocalSpace) == 0x001688, "Member 'UF_MED_Elastic_ASN_3_AnimBP_PRIME_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Elastic_ASN_3_AnimBP_PRIME_C, AnimGraphNode_ModifyBone_1) == 0x0016A8, "Member 'UF_MED_Elastic_ASN_3_AnimBP_PRIME_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Elastic_ASN_3_AnimBP_PRIME_C, AnimGraphNode_ModifyBone) == 0x0017D0, "Member 'UF_MED_Elastic_ASN_3_AnimBP_PRIME_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UF_MED_Elastic_ASN_3_AnimBP_PRIME_C, HeadUp) == 0x0018F8, "Member 'UF_MED_Elastic_ASN_3_AnimBP_PRIME_C::HeadUp' has a wrong offset!");
static_assert(offsetof(UF_MED_Elastic_ASN_3_AnimBP_PRIME_C, Body_Mesh) == 0x001900, "Member 'UF_MED_Elastic_ASN_3_AnimBP_PRIME_C::Body_Mesh' has a wrong offset!");
static_assert(offsetof(UF_MED_Elastic_ASN_3_AnimBP_PRIME_C, Pawn_Owner) == 0x001908, "Member 'UF_MED_Elastic_ASN_3_AnimBP_PRIME_C::Pawn_Owner' has a wrong offset!");
static_assert(offsetof(UF_MED_Elastic_ASN_3_AnimBP_PRIME_C, Head_MESH) == 0x001910, "Member 'UF_MED_Elastic_ASN_3_AnimBP_PRIME_C::Head_MESH' has a wrong offset!");

}

