#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Elastic_ASN_3_AnimBP_PRIME

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function F_MED_Elastic_ASN_3_AnimBP_PRIME.F_MED_Elastic_ASN_3_AnimBP_PRIME_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct F_MED_Elastic_ASN_3_AnimBP_PRIME_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(F_MED_Elastic_ASN_3_AnimBP_PRIME_C_AnimGraph) == 0x000008, "Wrong alignment on F_MED_Elastic_ASN_3_AnimBP_PRIME_C_AnimGraph");
static_assert(sizeof(F_MED_Elastic_ASN_3_AnimBP_PRIME_C_AnimGraph) == 0x000010, "Wrong size on F_MED_Elastic_ASN_3_AnimBP_PRIME_C_AnimGraph");
static_assert(offsetof(F_MED_Elastic_ASN_3_AnimBP_PRIME_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'F_MED_Elastic_ASN_3_AnimBP_PRIME_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function F_MED_Elastic_ASN_3_AnimBP_PRIME.F_MED_Elastic_ASN_3_AnimBP_PRIME_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct F_MED_Elastic_ASN_3_AnimBP_PRIME_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(F_MED_Elastic_ASN_3_AnimBP_PRIME_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on F_MED_Elastic_ASN_3_AnimBP_PRIME_C_BlueprintUpdateAnimation");
static_assert(sizeof(F_MED_Elastic_ASN_3_AnimBP_PRIME_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on F_MED_Elastic_ASN_3_AnimBP_PRIME_C_BlueprintUpdateAnimation");
static_assert(offsetof(F_MED_Elastic_ASN_3_AnimBP_PRIME_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'F_MED_Elastic_ASN_3_AnimBP_PRIME_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function F_MED_Elastic_ASN_3_AnimBP_PRIME.F_MED_Elastic_ASN_3_AnimBP_PRIME_C.ExecuteUbergraph_F_MED_Elastic_ASN_3_AnimBP_PRIME
// 0x0100 (0x0100 - 0x0000)
struct F_MED_Elastic_ASN_3_AnimBP_PRIME_C_ExecuteUbergraph_F_MED_Elastic_ASN_3_AnimBP_PRIME final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshForPartType_ReturnValue;   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue_1; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0xF];                                       // 0x0031(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetDeltaTransformFromRefPose_ReturnValue; // 0x0040(0x0060)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(F_MED_Elastic_ASN_3_AnimBP_PRIME_C_ExecuteUbergraph_F_MED_Elastic_ASN_3_AnimBP_PRIME) == 0x000010, "Wrong alignment on F_MED_Elastic_ASN_3_AnimBP_PRIME_C_ExecuteUbergraph_F_MED_Elastic_ASN_3_AnimBP_PRIME");
static_assert(sizeof(F_MED_Elastic_ASN_3_AnimBP_PRIME_C_ExecuteUbergraph_F_MED_Elastic_ASN_3_AnimBP_PRIME) == 0x000100, "Wrong size on F_MED_Elastic_ASN_3_AnimBP_PRIME_C_ExecuteUbergraph_F_MED_Elastic_ASN_3_AnimBP_PRIME");
static_assert(offsetof(F_MED_Elastic_ASN_3_AnimBP_PRIME_C_ExecuteUbergraph_F_MED_Elastic_ASN_3_AnimBP_PRIME, EntryPoint) == 0x000000, "Member 'F_MED_Elastic_ASN_3_AnimBP_PRIME_C_ExecuteUbergraph_F_MED_Elastic_ASN_3_AnimBP_PRIME::EntryPoint' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_ASN_3_AnimBP_PRIME_C_ExecuteUbergraph_F_MED_Elastic_ASN_3_AnimBP_PRIME, CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue) == 0x000008, "Member 'F_MED_Elastic_ASN_3_AnimBP_PRIME_C_ExecuteUbergraph_F_MED_Elastic_ASN_3_AnimBP_PRIME::CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_ASN_3_AnimBP_PRIME_C_ExecuteUbergraph_F_MED_Elastic_ASN_3_AnimBP_PRIME, CallFunc_GetSkeletalMeshForPartType_ReturnValue) == 0x000010, "Member 'F_MED_Elastic_ASN_3_AnimBP_PRIME_C_ExecuteUbergraph_F_MED_Elastic_ASN_3_AnimBP_PRIME::CallFunc_GetSkeletalMeshForPartType_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_ASN_3_AnimBP_PRIME_C_ExecuteUbergraph_F_MED_Elastic_ASN_3_AnimBP_PRIME, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000018, "Member 'F_MED_Elastic_ASN_3_AnimBP_PRIME_C_ExecuteUbergraph_F_MED_Elastic_ASN_3_AnimBP_PRIME::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_ASN_3_AnimBP_PRIME_C_ExecuteUbergraph_F_MED_Elastic_ASN_3_AnimBP_PRIME, CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue_1) == 0x000020, "Member 'F_MED_Elastic_ASN_3_AnimBP_PRIME_C_ExecuteUbergraph_F_MED_Elastic_ASN_3_AnimBP_PRIME::CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_ASN_3_AnimBP_PRIME_C_ExecuteUbergraph_F_MED_Elastic_ASN_3_AnimBP_PRIME, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000028, "Member 'F_MED_Elastic_ASN_3_AnimBP_PRIME_C_ExecuteUbergraph_F_MED_Elastic_ASN_3_AnimBP_PRIME::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_ASN_3_AnimBP_PRIME_C_ExecuteUbergraph_F_MED_Elastic_ASN_3_AnimBP_PRIME, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'F_MED_Elastic_ASN_3_AnimBP_PRIME_C_ExecuteUbergraph_F_MED_Elastic_ASN_3_AnimBP_PRIME::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_ASN_3_AnimBP_PRIME_C_ExecuteUbergraph_F_MED_Elastic_ASN_3_AnimBP_PRIME, CallFunc_GetDeltaTransformFromRefPose_ReturnValue) == 0x000040, "Member 'F_MED_Elastic_ASN_3_AnimBP_PRIME_C_ExecuteUbergraph_F_MED_Elastic_ASN_3_AnimBP_PRIME::CallFunc_GetDeltaTransformFromRefPose_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_ASN_3_AnimBP_PRIME_C_ExecuteUbergraph_F_MED_Elastic_ASN_3_AnimBP_PRIME, CallFunc_BreakTransform_Location) == 0x0000A0, "Member 'F_MED_Elastic_ASN_3_AnimBP_PRIME_C_ExecuteUbergraph_F_MED_Elastic_ASN_3_AnimBP_PRIME::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_ASN_3_AnimBP_PRIME_C_ExecuteUbergraph_F_MED_Elastic_ASN_3_AnimBP_PRIME, CallFunc_BreakTransform_Rotation) == 0x0000B8, "Member 'F_MED_Elastic_ASN_3_AnimBP_PRIME_C_ExecuteUbergraph_F_MED_Elastic_ASN_3_AnimBP_PRIME::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_ASN_3_AnimBP_PRIME_C_ExecuteUbergraph_F_MED_Elastic_ASN_3_AnimBP_PRIME, CallFunc_BreakTransform_Scale) == 0x0000D0, "Member 'F_MED_Elastic_ASN_3_AnimBP_PRIME_C_ExecuteUbergraph_F_MED_Elastic_ASN_3_AnimBP_PRIME::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_ASN_3_AnimBP_PRIME_C_ExecuteUbergraph_F_MED_Elastic_ASN_3_AnimBP_PRIME, CallFunc_BreakRotator_Roll) == 0x0000E8, "Member 'F_MED_Elastic_ASN_3_AnimBP_PRIME_C_ExecuteUbergraph_F_MED_Elastic_ASN_3_AnimBP_PRIME::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_ASN_3_AnimBP_PRIME_C_ExecuteUbergraph_F_MED_Elastic_ASN_3_AnimBP_PRIME, CallFunc_BreakRotator_Pitch) == 0x0000EC, "Member 'F_MED_Elastic_ASN_3_AnimBP_PRIME_C_ExecuteUbergraph_F_MED_Elastic_ASN_3_AnimBP_PRIME::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_ASN_3_AnimBP_PRIME_C_ExecuteUbergraph_F_MED_Elastic_ASN_3_AnimBP_PRIME, CallFunc_BreakRotator_Yaw) == 0x0000F0, "Member 'F_MED_Elastic_ASN_3_AnimBP_PRIME_C_ExecuteUbergraph_F_MED_Elastic_ASN_3_AnimBP_PRIME::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_ASN_3_AnimBP_PRIME_C_ExecuteUbergraph_F_MED_Elastic_ASN_3_AnimBP_PRIME, K2Node_Event_DeltaTimeX) == 0x0000F4, "Member 'F_MED_Elastic_ASN_3_AnimBP_PRIME_C_ExecuteUbergraph_F_MED_Elastic_ASN_3_AnimBP_PRIME::K2Node_Event_DeltaTimeX' has a wrong offset!");

}

