#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FeatTimelineListEntry

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function FeatTimelineListEntry.FeatTimelineListEntry_C.BndEvt__SimpleButton_ClickArea_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct FeatTimelineListEntry_C_BndEvt__SimpleButton_ClickArea_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FeatTimelineListEntry_C_BndEvt__SimpleButton_ClickArea_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on FeatTimelineListEntry_C_BndEvt__SimpleButton_ClickArea_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(FeatTimelineListEntry_C_BndEvt__SimpleButton_ClickArea_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on FeatTimelineListEntry_C_BndEvt__SimpleButton_ClickArea_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(FeatTimelineListEntry_C_BndEvt__SimpleButton_ClickArea_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'FeatTimelineListEntry_C_BndEvt__SimpleButton_ClickArea_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function FeatTimelineListEntry.FeatTimelineListEntry_C.BndEvt__SimpleButton_ClickArea_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct FeatTimelineListEntry_C_BndEvt__SimpleButton_ClickArea_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FeatTimelineListEntry_C_BndEvt__SimpleButton_ClickArea_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on FeatTimelineListEntry_C_BndEvt__SimpleButton_ClickArea_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(FeatTimelineListEntry_C_BndEvt__SimpleButton_ClickArea_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on FeatTimelineListEntry_C_BndEvt__SimpleButton_ClickArea_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(FeatTimelineListEntry_C_BndEvt__SimpleButton_ClickArea_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'FeatTimelineListEntry_C_BndEvt__SimpleButton_ClickArea_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function FeatTimelineListEntry.FeatTimelineListEntry_C.ExecuteUbergraph_FeatTimelineListEntry
// 0x00A8 (0x00A8 - 0x0000)
struct FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NumFeatsOnDay;                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_IdxOnDay;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NumDays;                              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_2;          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_1;    // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_1;               // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button;                 // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry) == 0x000008, "Wrong alignment on FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry");
static_assert(sizeof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry) == 0x0000A8, "Wrong size on FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, EntryPoint) == 0x000000, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, K2Node_Event_NumFeatsOnDay) == 0x000018, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::K2Node_Event_NumFeatsOnDay' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, K2Node_Event_IdxOnDay) == 0x00001C, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::K2Node_Event_IdxOnDay' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000020, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, K2Node_MakeStruct_Margin) == 0x000024, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000034, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, K2Node_MakeStruct_Margin_1) == 0x000038, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x000048, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, K2Node_Event_NumDays) == 0x00004C, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::K2Node_Event_NumDays' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, K2Node_Event_IsDesignTime) == 0x000050, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, CallFunc_Multiply_IntFloat_ReturnValue_2) == 0x000054, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::CallFunc_Multiply_IntFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, CallFunc_IsVisible_ReturnValue) == 0x000058, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, CallFunc_PlayAnimation_ReturnValue_2) == 0x000060, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000068, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_1) == 0x000070, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000078, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, CallFunc_PlayAnimation_ReturnValue_3) == 0x000080, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, CallFunc_IsHovered_ReturnValue) == 0x000088, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, CallFunc_BooleanOR_ReturnValue) == 0x000089, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, K2Node_ComponentBoundEvent_Button_1) == 0x000090, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, K2Node_ComponentBoundEvent_Button) == 0x000098, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, CallFunc_IsUsingTouch_ReturnValue) == 0x0000A0, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, CallFunc_Not_PreBool_ReturnValue) == 0x0000A1, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function FeatTimelineListEntry.FeatTimelineListEntry_C.OnFeatInfoSet
// 0x0008 (0x0008 - 0x0000)
struct FeatTimelineListEntry_C_OnFeatInfoSet final
{
public:
	int32                                         NumFeatsOnDay;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         IdxOnDay;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FeatTimelineListEntry_C_OnFeatInfoSet) == 0x000004, "Wrong alignment on FeatTimelineListEntry_C_OnFeatInfoSet");
static_assert(sizeof(FeatTimelineListEntry_C_OnFeatInfoSet) == 0x000008, "Wrong size on FeatTimelineListEntry_C_OnFeatInfoSet");
static_assert(offsetof(FeatTimelineListEntry_C_OnFeatInfoSet, NumFeatsOnDay) == 0x000000, "Member 'FeatTimelineListEntry_C_OnFeatInfoSet::NumFeatsOnDay' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_OnFeatInfoSet, IdxOnDay) == 0x000004, "Member 'FeatTimelineListEntry_C_OnFeatInfoSet::IdxOnDay' has a wrong offset!");

// Function FeatTimelineListEntry.FeatTimelineListEntry_C.OnTimespanInfoSet
// 0x0004 (0x0004 - 0x0000)
struct FeatTimelineListEntry_C_OnTimespanInfoSet final
{
public:
	int32                                         NumDays;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FeatTimelineListEntry_C_OnTimespanInfoSet) == 0x000004, "Wrong alignment on FeatTimelineListEntry_C_OnTimespanInfoSet");
static_assert(sizeof(FeatTimelineListEntry_C_OnTimespanInfoSet) == 0x000004, "Wrong size on FeatTimelineListEntry_C_OnTimespanInfoSet");
static_assert(offsetof(FeatTimelineListEntry_C_OnTimespanInfoSet, NumDays) == 0x000000, "Member 'FeatTimelineListEntry_C_OnTimespanInfoSet::NumDays' has a wrong offset!");

// Function FeatTimelineListEntry.FeatTimelineListEntry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct FeatTimelineListEntry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FeatTimelineListEntry_C_PreConstruct) == 0x000001, "Wrong alignment on FeatTimelineListEntry_C_PreConstruct");
static_assert(sizeof(FeatTimelineListEntry_C_PreConstruct) == 0x000001, "Wrong size on FeatTimelineListEntry_C_PreConstruct");
static_assert(offsetof(FeatTimelineListEntry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'FeatTimelineListEntry_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function FeatTimelineListEntry.FeatTimelineListEntry_C.SetSeasonStyle
// 0x0828 (0x0828 - 0x0000)
struct FeatTimelineListEntry_C_SetSeasonStyle final
{
public:
	struct FLinearColor                           Season20Color2;                                    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Season20Color1;                                    // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Season20;                                          // 0x0020(0x0018)(Edit, BlueprintVisible)
	struct FLinearColor                           Season19Color2;                                    // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Season19Color1;                                    // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Season19;                                          // 0x0058(0x0018)(Edit, BlueprintVisible)
	struct FLinearColor                           Season18Color2;                                    // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Season18Color1;                                    // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Season18;                                          // 0x0090(0x0018)(Edit, BlueprintVisible)
	struct FLinearColor                           Season17Color2;                                    // 0x00A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Season17Color1;                                    // 0x00B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Season17;                                          // 0x00C8(0x0018)(Edit, BlueprintVisible)
	struct FLinearColor                           Season16Color2;                                    // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Season16Color1;                                    // 0x00F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Season16;                                          // 0x0100(0x0018)(Edit, BlueprintVisible)
	struct FLinearColor                           Season15Color2;                                    // 0x0118(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Season15Color1;                                    // 0x0128(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Season15;                                          // 0x0138(0x0018)(Edit, BlueprintVisible)
	struct FLinearColor                           Season14Color2;                                    // 0x0150(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Season14Color1;                                    // 0x0160(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Season14;                                          // 0x0170(0x0018)(Edit, BlueprintVisible)
	struct FLinearColor                           Season13Color2;                                    // 0x0188(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Season13Color1;                                    // 0x0198(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Season12Color2;                                    // 0x01A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Season12Color1;                                    // 0x01B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Season11Color2;                                    // 0x01C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Season11Color1;                                    // 0x01D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Season12;                                          // 0x01E8(0x0018)(Edit, BlueprintVisible)
	class FText                                   Season13;                                          // 0x0200(0x0018)(Edit, BlueprintVisible)
	class FText                                   Season11;                                          // 0x0218(0x0018)(Edit, BlueprintVisible)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0230(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0280(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0290(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x02A8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x02F8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0308(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0320(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0370(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0380(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0398(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x03E8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x03F8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0410(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_4;                          // 0x0460(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_4;                     // 0x0470(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0488(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_5;                          // 0x04D8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_5;                     // 0x04E8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x0500(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_6;                          // 0x0550(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_6;                     // 0x0560(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_7;            // 0x0578(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_7;                          // 0x05C8(0x0010)(ReferenceParm)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_7;                     // 0x05E0(0x0018)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x05F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_3;         // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_4;         // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_5;         // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_6;         // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_7;         // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_8;         // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_9;         // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_10;        // 0x0640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_11;        // 0x0648(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_12;        // 0x0650(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_13;        // 0x0658(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_14;        // 0x0660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_15;        // 0x0668(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_16;        // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_17;        // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_18;        // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_19;        // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_20;        // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_21;        // 0x0698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_22;        // 0x06A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_23;        // 0x06A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_24;        // 0x06B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_25;        // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_26;        // 0x06C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_27;        // 0x06C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_28;        // 0x06D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_29;        // 0x06D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_30;        // 0x06E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_8;            // 0x06E8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_8;                          // 0x0738(0x0010)(ReferenceParm)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_31;        // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_8;                     // 0x0750(0x0018)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_32;        // 0x0768(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_33;        // 0x0770(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_34;        // 0x0778(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_35;        // 0x0780(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_36;        // 0x0788(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_37;        // 0x0790(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_38;        // 0x0798(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_39;        // 0x07A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_9;            // 0x07A8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_9;                          // 0x07F8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_9;                     // 0x0808(0x0018)()
	struct FGameplayTag                           CallFunc_CalculateSourceTag_ReturnValue;           // 0x0820(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0824(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FeatTimelineListEntry_C_SetSeasonStyle) == 0x000008, "Wrong alignment on FeatTimelineListEntry_C_SetSeasonStyle");
static_assert(sizeof(FeatTimelineListEntry_C_SetSeasonStyle) == 0x000828, "Wrong size on FeatTimelineListEntry_C_SetSeasonStyle");
static_assert(offsetof(FeatTimelineListEntry_C_SetSeasonStyle, Season20Color2) == 0x000000, "Member 'FeatTimelineListEntry_C_SetSeasonStyle::Season20Color2' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_SetSeasonStyle, Season20Color1) == 0x000010, "Member 'FeatTimelineListEntry_C_SetSeasonStyle::Season20Color1' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_SetSeasonStyle, Season20) == 0x000020, "Member 'FeatTimelineListEntry_C_SetSeasonStyle::Season20' has a wrong offset!");
