#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FlagSelectionModal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FlagSelectionModal.FlagSelectionModal_C
// 0x0028 (0x0608 - 0x05E0)
class UFlagSelectionModal_C final : public UFortFlagSelectionModal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           FlagConfirmation;                                  // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           FlagSelection;                                     // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_Confirmation;                             // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__Button_Change_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__Button_ConfirmationCancel_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BP_OnActivated();
	void ExecuteUbergraph_FlagSelectionModal(int32 EntryPoint);
	void Handle_Back(bool* Passthrough);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FlagSelectionModal_C">();
	}
	static class UFlagSelectionModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFlagSelectionModal_C>();
	}
};
static_assert(alignof(UFlagSelectionModal_C) == 0x000008, "Wrong alignment on UFlagSelectionModal_C");
static_assert(sizeof(UFlagSelectionModal_C) == 0x000608, "Wrong size on UFlagSelectionModal_C");
static_assert(offsetof(UFlagSelectionModal_C, UberGraphFrame) == 0x0005E0, "Member 'UFlagSelectionModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFlagSelectionModal_C, FlagConfirmation) == 0x0005E8, "Member 'UFlagSelectionModal_C::FlagConfirmation' has a wrong offset!");
static_assert(offsetof(UFlagSelectionModal_C, FlagSelection) == 0x0005F0, "Member 'UFlagSelectionModal_C::FlagSelection' has a wrong offset!");
static_assert(offsetof(UFlagSelectionModal_C, SafeZone_0) == 0x0005F8, "Member 'UFlagSelectionModal_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UFlagSelectionModal_C, Switcher_Confirmation) == 0x000600, "Member 'UFlagSelectionModal_C::Switcher_Confirmation' has a wrong offset!");

}

