#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fortnite_Player_DBNOCarried_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct Fortnite_Player_DBNOCarried_AnimBP.Fortnite_Player_DBNOCarried_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x0227 (0x0228 - 0x0001)
struct Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_548;                                // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_549;                            // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_550;                            // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_551;                            // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_552;                                // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            __BlendSpace_553;                                  // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_554;                                  // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_555;                            // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_556;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_557;                            // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_558;                                  // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_559;                               // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_560;                                // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_561;                            // 0x0060(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_562;                               // 0x0068(0x0010)(BlueprintVisible, EditFixedSize)
	class UAnimSequenceBase*                      __AnimSequenceBase_563;                            // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_564;                                // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_565;                            // 0x0088(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_566;                            // 0x0090(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_567;                               // 0x0098(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_568;                               // 0x00A8(0x0010)(BlueprintVisible, EditFixedSize)
	class UAnimSequenceBase*                      __AnimSequenceBase_569;                            // 0x00B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_570;                            // 0x00C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_571;                                // 0x00C8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_572;                                // 0x00C9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x2];                                       // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_573;                                // 0x00CC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_574;                                // 0x00D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_575;                               // 0x00D4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_576;                            // 0x00D8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_577;                              // 0x00E0(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_578;                               // 0x010C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_579;                            // 0x0110(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_580;                                // 0x0118(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_581;                                // 0x011C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_582;                               // 0x0120(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESequenceEvalReinit                           __ByteProperty_583;                                // 0x0124(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_584;                                // 0x0125(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_126[0x2];                                      // 0x0126(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_585;                            // 0x0128(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_586;                                // 0x0130(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_587;                                // 0x0131(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_132[0x2];                                      // 0x0132(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_588;                                // 0x0134(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_589;                                // 0x0138(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_590;                               // 0x0140(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendProfile*                          __BlendProfile_591;                                // 0x0150(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_592;                                  // 0x0158(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_593;                                // 0x0160(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_594;                                // 0x0161(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_595;                                // 0x0162(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_163[0x5];                                      // 0x0163(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_596;                               // 0x0168(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_597;                              // 0x0178(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0190(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0210(0x0018)()
};
static_assert(alignof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000228, "Wrong size on Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_548) == 0x000004, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_548' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_549) == 0x000008, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_549' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_550) == 0x000010, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_550' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_551) == 0x000018, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_551' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_552) == 0x000020, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_552' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_553) == 0x000028, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_553' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_554) == 0x000030, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_554' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_555) == 0x000038, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_555' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_556) == 0x000040, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_556' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_557) == 0x000048, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_557' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_558) == 0x000050, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_558' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_559) == 0x000058, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_559' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_560) == 0x00005C, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_560' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_561) == 0x000060, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_561' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_562) == 0x000068, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_562' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_563) == 0x000078, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_563' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_564) == 0x000080, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_564' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_565) == 0x000088, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_565' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_566) == 0x000090, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_566' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_567) == 0x000098, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_567' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_568) == 0x0000A8, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_568' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_569) == 0x0000B8, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_569' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_570) == 0x0000C0, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_570' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_571) == 0x0000C8, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_571' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_572) == 0x0000C9, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_572' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_573) == 0x0000CC, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_573' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_574) == 0x0000D0, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_574' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_575) == 0x0000D4, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_575' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_576) == 0x0000D8, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_576' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_577) == 0x0000E0, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_577' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_578) == 0x00010C, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_578' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_579) == 0x000110, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_579' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_580) == 0x000118, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_580' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_581) == 0x00011C, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_581' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_582) == 0x000120, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_582' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_583) == 0x000124, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_583' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_584) == 0x000125, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_584' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_585) == 0x000128, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_585' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_586) == 0x000130, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_586' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_587) == 0x000131, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_587' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_588) == 0x000134, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_588' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_589) == 0x000138, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_589' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_590) == 0x000140, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_590' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_591) == 0x000150, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_591' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_592) == 0x000158, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_592' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_593) == 0x000160, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_593' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_594) == 0x000161, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_594' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_595) == 0x000162, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_595' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_596) == 0x000168, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_596' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_597) == 0x000178, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_597' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000190, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000210, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct Fortnite_Player_DBNOCarried_AnimBP.Fortnite_Player_DBNOCarried_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x004B (0x004C - 0x0001)
struct Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_3;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_5;                                  // 0x001C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_6;                                  // 0x001D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_7;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_8;                                  // 0x0024(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_9;                                 // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_10;                                 // 0x002C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_11;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_12;                                 // 0x0034(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_13;                                 // 0x0035(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_14;                                 // 0x0036(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37[0x1];                                       // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_15;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_16;                                 // 0x003C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_17;                                 // 0x003D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_18;                                 // 0x003E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F[0x1];                                       // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_19;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_20;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_21;                                 // 0x0048(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_22;                                 // 0x0049(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x00004C, "Wrong size on Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
