#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fortnite_M_Avg_Player_Sprint_AnimBP

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"
#include "Fortnite_M_Avg_Player_Sprint_AnimBP_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Fortnite_M_Avg_Player_Sprint_AnimBP.Fortnite_M_Avg_Player_Sprint_AnimBP_C
// 0x1490 (0x1BC0 - 0x0730)
class UFortnite_M_Avg_Player_Sprint_AnimBP_C final : public UFortSprintAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0730(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct Fortnite_M_Avg_Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x0738(0x0090)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x07C8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x07D0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x07D8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x07F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x0820(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x0848(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x0870(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13;                   // 0x0898(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x08D8(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_7;                   // 0x0918(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x0960(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x0980(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x09C0(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_6;                   // 0x0A00(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x0A48(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x0A68(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x0A90(0x00B8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0B48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0B70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0B98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0BC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0BE8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x0C10(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0C50(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x0C70(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5;                   // 0x0CB0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x0CF8(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0D38(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x0D58(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x0DA0(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0DE0(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0E20(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x0E40(0x00B8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x0EF8(0x0048)()
	struct FAnimNode_RotateRootBone               AnimGraphNode_RotateRootBone;                      // 0x0F40(0x00A8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x0FE8(0x0068)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_4;                     // 0x1050(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_3;                     // 0x1118(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x11E0(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x1220(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x1268(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x12A8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x12E8(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x1328(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0x1370(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x1438(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1500(0x0040)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x1540(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x1608(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x1650(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x1678(0x00E0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x1758(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x17C0(0x0068)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1828(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1870(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1898(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x18C0(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x1908(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x19E8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1A08(0x00B8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x1AC0(0x0100)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_Fortnite_M_Avg_Player_Sprint_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Fortnite_M_Avg_Player_Sprint_AnimBP_C">();
	}
	static class UFortnite_M_Avg_Player_Sprint_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortnite_M_Avg_Player_Sprint_AnimBP_C>();
	}
};
static_assert(alignof(UFortnite_M_Avg_Player_Sprint_AnimBP_C) == 0x000010, "Wrong alignment on UFortnite_M_Avg_Player_Sprint_AnimBP_C");
static_assert(sizeof(UFortnite_M_Avg_Player_Sprint_AnimBP_C) == 0x001BC0, "Wrong size on UFortnite_M_Avg_Player_Sprint_AnimBP_C");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, UberGraphFrame) == 0x000730, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, __AnimBlueprintMutables) == 0x000738, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x0007C8, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimBlueprintExtension_Base) == 0x0007D0, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_Root) == 0x0007D8, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_TransitionResult_9) == 0x0007F8, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_TransitionResult_9' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_TransitionResult_8) == 0x000820, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_TransitionResult_8' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_TransitionResult_7) == 0x000848, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_TransitionResult_6) == 0x000870, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_SequencePlayer_13) == 0x000898, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_SequencePlayer_13' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_SequencePlayer_12) == 0x0008D8, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_SequencePlayer_12' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_BlendListByBool_7) == 0x000918, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_BlendListByBool_7' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_StateResult_5) == 0x000960, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_SequencePlayer_11) == 0x000980, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_SequencePlayer_11' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_SequencePlayer_10) == 0x0009C0, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_SequencePlayer_10' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_BlendListByBool_6) == 0x000A00, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_BlendListByBool_6' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_StateResult_4) == 0x000A48, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_TransitionResult_5) == 0x000A68, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_StateMachine_2) == 0x000A90, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_StateMachine_2' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_TransitionResult_4) == 0x000B48, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_TransitionResult_3) == 0x000B70, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_TransitionResult_2) == 0x000B98, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_TransitionResult_1) == 0x000BC0, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_TransitionResult) == 0x000BE8, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_SequencePlayer_9) == 0x000C10, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_SequencePlayer_9' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_StateResult_3) == 0x000C50, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_SequencePlayer_8) == 0x000C70, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_BlendListByBool_5) == 0x000CB0, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_BlendListByBool_5' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_SequencePlayer_7) == 0x000CF8, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_StateResult_2) == 0x000D38, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_BlendListByBool_4) == 0x000D58, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_BlendListByBool_4' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_SequencePlayer_6) == 0x000DA0, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_SequencePlayer_5) == 0x000DE0, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_StateResult_1) == 0x000E20, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_StateMachine_1) == 0x000E40, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_BlendListByBool_3) == 0x000EF8, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_RotateRootBone) == 0x000F40, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_RotateRootBone' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_BlendSpacePlayer_2) == 0x000FE8, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_BlendSpacePlayer_2' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_ApplyAdditive_4) == 0x001050, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_ApplyAdditive_4' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_ApplyAdditive_3) == 0x001118, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_ApplyAdditive_3' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_SequencePlayer_4) == 0x0011E0, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_BlendListByBool_2) == 0x001220, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_SequencePlayer_3) == 0x001268, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x0012A8, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x0012E8, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_BlendListByBool_1) == 0x001328, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_ApplyAdditive_2) == 0x001370, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_ApplyAdditive_2' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_ApplyAdditive_1) == 0x001438, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_ApplyAdditive_1' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x001500, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_ApplyAdditive) == 0x001540, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_Slot_1) == 0x001608, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_UseCachedPose_2) == 0x001650, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_LayeredBoneBlend_1) == 0x001678, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_LayeredBoneBlend_1' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_BlendSpacePlayer_1) == 0x001758, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_BlendSpacePlayer) == 0x0017C0, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x001828, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x001870, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x001898, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_Slot) == 0x0018C0, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_LayeredBoneBlend) == 0x001908, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_StateResult) == 0x0019E8, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_StateMachine) == 0x001A08, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UFortnite_M_Avg_Player_Sprint_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x001AC0, "Member 'UFortnite_M_Avg_Player_Sprint_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");

}

