#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fortnite_M_Avg_Player_DBNO_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct Fortnite_M_Avg_Player_DBNO_AnimBP.Fortnite_M_Avg_Player_DBNO_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x015F (0x0160 - 0x0001)
struct Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_121;                                // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_122;                               // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_123;                            // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_124;                                // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_125;                            // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_126;                                // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_127;                               // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_128;                            // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_129;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            __BlendSpace_130;                                  // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_131;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_132;                              // 0x004C(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_133;                               // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_134;                            // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_135;                                // 0x0088(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_136;                                // 0x0089(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_137;                                // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_138;                                // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_139;                              // 0x0098(0x0018)(BlueprintVisible, NoDestructor)
	class UBlendSpace*                            __BlendSpace_140;                                  // 0x00B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_141;                                // 0x00B8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_142;                               // 0x00BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_143;                                // 0x00C0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_144;                                // 0x00C1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_145;                                // 0x00C2(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C3[0x1];                                       // 0x00C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_146;                                // 0x00C4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00C8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0148(0x0018)()
};
static_assert(alignof(Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000160, "Wrong size on Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_121) == 0x000004, "Member 'Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_121' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_122) == 0x000008, "Member 'Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_122' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_123) == 0x000010, "Member 'Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_123' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_124) == 0x000018, "Member 'Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_124' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_125) == 0x000020, "Member 'Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_125' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_126) == 0x000028, "Member 'Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_126' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_127) == 0x00002C, "Member 'Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_127' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_128) == 0x000030, "Member 'Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_128' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_129) == 0x000038, "Member 'Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_129' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_130) == 0x000040, "Member 'Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_130' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_131) == 0x000048, "Member 'Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_131' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_132) == 0x00004C, "Member 'Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_132' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_133) == 0x000078, "Member 'Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_133' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_134) == 0x000080, "Member 'Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_134' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_135) == 0x000088, "Member 'Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_135' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_136) == 0x000089, "Member 'Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_136' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_137) == 0x00008C, "Member 'Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_137' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_138) == 0x000090, "Member 'Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_138' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_139) == 0x000098, "Member 'Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_139' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_140) == 0x0000B0, "Member 'Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_140' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_141) == 0x0000B8, "Member 'Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_141' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_142) == 0x0000BC, "Member 'Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_142' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_143) == 0x0000C0, "Member 'Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_143' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_144) == 0x0000C1, "Member 'Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_144' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_145) == 0x0000C2, "Member 'Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_145' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_146) == 0x0000C4, "Member 'Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_146' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000C8, "Member 'Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000148, "Member 'Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct Fortnite_M_Avg_Player_DBNO_AnimBP.Fortnite_M_Avg_Player_DBNO_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0017 (0x0018 - 0x0001)
struct Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000018, "Wrong size on Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_1) == 0x00000C, "Member 'Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_1' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_2) == 0x000010, "Member 'Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_2' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000014, "Member 'Fortnite_M_Avg_Player_DBNO_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");

}

