#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Galileo_LobsterLayerAnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.AnimBlueprintGeneratedConstantData
// 0x027F (0x0280 - 0x0001)
struct Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_619;                                // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_620;                                // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_621;                                // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_622;                                // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_623;                                // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_624;                                // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_625;                                // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_626;                                // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_627;                            // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_628;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_629;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_630;                            // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_631;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_632;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_633;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_634;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_635;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_636;                            // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_637;                                // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_638;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_639;                                // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_640;                                // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_641;                                // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_642;                                // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_643;                            // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_644;                            // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_645;                                // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_646;                            // 0x0090(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_647;                               // 0x0098(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_648;                            // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_649;                                // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_650;                            // 0x00B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_651;                            // 0x00B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_652;                                // 0x00C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_653;                                // 0x00C4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_654;                                // 0x00C8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_655;                            // 0x00D0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_656;                                // 0x00D8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_657;                            // 0x00E0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_658;                               // 0x00E8(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_659;                                // 0x00F8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_660;                            // 0x0100(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_661;                               // 0x0108(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_662;                              // 0x010C(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_663;                               // 0x0138(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_664;                            // 0x0140(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_665;                                // 0x0148(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_666;                                // 0x0149(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_667;                                // 0x0150(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_668;                                  // 0x0158(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_669;                                // 0x0160(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_670;                                // 0x0161(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_671;                                // 0x0162(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_163[0x5];                                      // 0x0163(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_672;                               // 0x0168(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_673;                                // 0x0178(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_674;                                // 0x017C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_675;                                // 0x0180(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_676;                                // 0x0184(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_677;                                // 0x0188(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_678;                                // 0x018C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_679;                                // 0x0190(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_680;                                // 0x0194(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_681;                                // 0x0198(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_682;                                // 0x019C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_683;                                // 0x01A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_684;                                // 0x01A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_685;                                // 0x01A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_686;                                // 0x01AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_687;                                // 0x01B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_688;                                // 0x01B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_689;                                // 0x01B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_690;                                // 0x01BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_691;                                // 0x01C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_692;                              // 0x01C8(0x0018)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_693;                                // 0x01E0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_694;                                // 0x01E4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x01E8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0268(0x0018)()
};
static_assert(alignof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000280, "Wrong size on Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_619) == 0x000004, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_619' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_620) == 0x000008, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_620' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_621) == 0x00000C, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_621' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_622) == 0x000010, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_622' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_623) == 0x000014, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_623' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_624) == 0x000018, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_624' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_625) == 0x00001C, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_625' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_626) == 0x000020, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_626' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_627) == 0x000028, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_627' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_628) == 0x000030, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_628' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_629) == 0x000034, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_629' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_630) == 0x000038, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_630' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_631) == 0x000040, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_631' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_632) == 0x000044, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_632' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_633) == 0x000048, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_633' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_634) == 0x00004C, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_634' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_635) == 0x000050, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_635' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_636) == 0x000058, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_636' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_637) == 0x000060, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_637' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_638) == 0x000064, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_638' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_639) == 0x000068, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_639' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_640) == 0x00006C, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_640' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_641) == 0x000070, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_641' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_642) == 0x000074, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_642' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_643) == 0x000078, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_643' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_644) == 0x000080, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_644' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_645) == 0x000088, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_645' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_646) == 0x000090, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_646' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_647) == 0x000098, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_647' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_648) == 0x0000A0, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_648' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_649) == 0x0000A8, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_649' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_650) == 0x0000B0, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_650' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_651) == 0x0000B8, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_651' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_652) == 0x0000C0, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_652' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_653) == 0x0000C4, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_653' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_654) == 0x0000C8, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_654' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_655) == 0x0000D0, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_655' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_656) == 0x0000D8, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_656' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_657) == 0x0000E0, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_657' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_658) == 0x0000E8, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_658' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_659) == 0x0000F8, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_659' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_660) == 0x000100, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_660' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_661) == 0x000108, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_661' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_662) == 0x00010C, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_662' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_663) == 0x000138, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_663' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_664) == 0x000140, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_664' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_665) == 0x000148, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_665' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_666) == 0x000149, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_666' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_667) == 0x000150, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_667' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_668) == 0x000158, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_668' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_669) == 0x000160, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_669' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_670) == 0x000161, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_670' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_671) == 0x000162, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_671' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_672) == 0x000168, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_672' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_673) == 0x000178, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_673' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_674) == 0x00017C, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_674' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_675) == 0x000180, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_675' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_676) == 0x000184, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_676' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_677) == 0x000188, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_677' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_678) == 0x00018C, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_678' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_679) == 0x000190, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_679' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_680) == 0x000194, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_680' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_681) == 0x000198, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_681' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_682) == 0x00019C, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_682' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_683) == 0x0001A0, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_683' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_684) == 0x0001A4, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_684' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_685) == 0x0001A8, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_685' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_686) == 0x0001AC, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_686' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_687) == 0x0001B0, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_687' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_688) == 0x0001B4, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_688' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_689) == 0x0001B8, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_689' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_690) == 0x0001BC, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_690' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_691) == 0x0001C0, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_691' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_692) == 0x0001C8, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_692' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_693) == 0x0001E0, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_693' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_694) == 0x0001E4, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_694' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0001E8, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000268, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.AnimBlueprintGeneratedMutableData
// 0x004F (0x0050 - 0x0001)
struct Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase;                                // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_0;                              // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1;                              // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_2;                              // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_3;                              // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_4;                              // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_5;                              // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_6;                                  // 0x0040(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_7;                                  // 0x0041(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_8;                                 // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_9;                                 // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_10;                                 // 0x004C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_11;                                 // 0x004D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_12;                                 // 0x004E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong alignment on Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedMutableData) == 0x000050, "Wrong size on Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedMutableData, __AnimSequenceBase) == 0x000008, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedMutableData::__AnimSequenceBase' has a wrong offset!");
static_assert(offsetof(Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedMutableData, __AnimSequenceBase_0) == 0x000010, "Member 'Galileo_LobsterLayerAnimBP::FAnimBlueprintGeneratedMutableData::__AnimSequenceBase_0' has a wrong offset!");
