#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Galileo_Countdown

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Galileo_Countdown.Galileo_Countdown_C
// 0x0030 (0x02A8 - 0x0278)
class UGalileo_Countdown_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonWidgetSwitcherLegacy*            CommonWidgetSwitcher_State;                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_CustomText;                                   // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_LiveIn_Line1;                                 // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_LiveIn_Line2;                                 // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void EventOriginalText();
	void EventSetText(const class FText& NewText);
	void ExecuteUbergraph_Galileo_Countdown(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Galileo_Countdown_C">();
	}
	static class UGalileo_Countdown_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGalileo_Countdown_C>();
	}
};
static_assert(alignof(UGalileo_Countdown_C) == 0x000008, "Wrong alignment on UGalileo_Countdown_C");
static_assert(sizeof(UGalileo_Countdown_C) == 0x0002A8, "Wrong size on UGalileo_Countdown_C");
static_assert(offsetof(UGalileo_Countdown_C, UberGraphFrame) == 0x000278, "Member 'UGalileo_Countdown_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGalileo_Countdown_C, CommonWidgetSwitcher_State) == 0x000280, "Member 'UGalileo_Countdown_C::CommonWidgetSwitcher_State' has a wrong offset!");
static_assert(offsetof(UGalileo_Countdown_C, Image_BG) == 0x000288, "Member 'UGalileo_Countdown_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UGalileo_Countdown_C, Text_CustomText) == 0x000290, "Member 'UGalileo_Countdown_C::Text_CustomText' has a wrong offset!");
static_assert(offsetof(UGalileo_Countdown_C, Text_LiveIn_Line1) == 0x000298, "Member 'UGalileo_Countdown_C::Text_LiveIn_Line1' has a wrong offset!");
static_assert(offsetof(UGalileo_Countdown_C, Text_LiveIn_Line2) == 0x0002A0, "Member 'UGalileo_Countdown_C::Text_LiveIn_Line2' has a wrong offset!");

}

