#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Athena_OutsideSafeZone

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_Athena_OutsideSafeZone.GC_Athena_OutsideSafeZone_C.ExecuteUbergraph_GC_Athena_OutsideSafeZone
// 0x0258 (0x0258 - 0x0000)
struct GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0010(0x00D0)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents;                   // 0x00E0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x00F0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    K2Node_Event_BurstCameraShakeInstance;             // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance;                   // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAmbientAudioSubsystem*                 CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget_1;                           // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0130(0x00D0)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents_1;                 // 0x0200(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents_1;                    // 0x0210(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UParticleSystemComponent*               CallFunc_Array_Get_Item;                           // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_Generic_C*           K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic;   // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Select_Default;                             // 0x0240(0x0004)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAmbientAudioSubsystem*                 CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnabled;                             // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone) == 0x000008, "Wrong alignment on GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone");
static_assert(sizeof(GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone) == 0x000258, "Wrong size on GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone, EntryPoint) == 0x000000, "Member 'GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone, CallFunc_RandomFloatInRange_ReturnValue) == 0x000004, "Member 'GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone, K2Node_Event_MyTarget) == 0x000008, "Member 'GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone, K2Node_Event_Parameters) == 0x000010, "Member 'GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone, K2Node_Event_ParticleComponents) == 0x0000E0, "Member 'GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone, K2Node_Event_AudioComponents) == 0x0000F0, "Member 'GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone, K2Node_Event_BurstCameraShakeInstance) == 0x000100, "Member 'GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone::K2Node_Event_BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone, K2Node_Event_BurstDecalInstance) == 0x000108, "Member 'GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone::K2Node_Event_BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone, CallFunc_Subtract_IntInt_ReturnValue) == 0x000110, "Member 'GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000118, "Member 'GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone, K2Node_SwitchInteger_CmpSuccess) == 0x000120, "Member 'GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone, K2Node_Event_MyTarget_1) == 0x000128, "Member 'GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone::K2Node_Event_MyTarget_1' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone, K2Node_Event_Parameters_1) == 0x000130, "Member 'GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone, K2Node_Event_ParticleComponents_1) == 0x000200, "Member 'GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone::K2Node_Event_ParticleComponents_1' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone, K2Node_Event_AudioComponents_1) == 0x000210, "Member 'GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone::K2Node_Event_AudioComponents_1' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone, CallFunc_Array_Get_Item) == 0x000220, "Member 'GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone, K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic) == 0x000228, "Member 'GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone::K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone, K2Node_DynamicCast_bSuccess) == 0x000230, "Member 'GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone, Temp_int_Variable) == 0x000234, "Member 'GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone, CallFunc_Lerp_ReturnValue) == 0x000238, "Member 'GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00023C, "Member 'GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone, K2Node_Select_Default) == 0x000240, "Member 'GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone, CallFunc_GetWorldSubsystem_ReturnValue_1) == 0x000248, "Member 'GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone::CallFunc_GetWorldSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone, K2Node_Event_bEnabled) == 0x000250, "Member 'GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone::K2Node_Event_bEnabled' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone, CallFunc_BooleanAND_ReturnValue) == 0x000251, "Member 'GC_Athena_OutsideSafeZone_C_ExecuteUbergraph_GC_Athena_OutsideSafeZone::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function GC_Athena_OutsideSafeZone.GC_Athena_OutsideSafeZone_C.Get Location in Circle XY
// 0x0088 (0x0088 - 0x0000)
struct GC_Athena_OutsideSafeZone_C_Get_Location_in_Circle_XY final
{
public:
	struct FVector                                Location_Local_Space;                              // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPI_ReturnValue;                        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Cos_ReturnValue;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Sin_ReturnValue;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Athena_OutsideSafeZone_C_Get_Location_in_Circle_XY) == 0x000008, "Wrong alignment on GC_Athena_OutsideSafeZone_C_Get_Location_in_Circle_XY");
static_assert(sizeof(GC_Athena_OutsideSafeZone_C_Get_Location_in_Circle_XY) == 0x000088, "Wrong size on GC_Athena_OutsideSafeZone_C_Get_Location_in_Circle_XY");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_Get_Location_in_Circle_XY, Location_Local_Space) == 0x000000, "Member 'GC_Athena_OutsideSafeZone_C_Get_Location_in_Circle_XY::Location_Local_Space' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_Get_Location_in_Circle_XY, CallFunc_MakeVector_ReturnValue) == 0x000018, "Member 'GC_Athena_OutsideSafeZone_C_Get_Location_in_Circle_XY::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_Get_Location_in_Circle_XY, CallFunc_RandomFloat_ReturnValue) == 0x000030, "Member 'GC_Athena_OutsideSafeZone_C_Get_Location_in_Circle_XY::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_Get_Location_in_Circle_XY, CallFunc_GetPI_ReturnValue) == 0x000034, "Member 'GC_Athena_OutsideSafeZone_C_Get_Location_in_Circle_XY::CallFunc_GetPI_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_Get_Location_in_Circle_XY, CallFunc_RandomFloatInRange_ReturnValue) == 0x000038, "Member 'GC_Athena_OutsideSafeZone_C_Get_Location_in_Circle_XY::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_Get_Location_in_Circle_XY, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00003C, "Member 'GC_Athena_OutsideSafeZone_C_Get_Location_in_Circle_XY::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_Get_Location_in_Circle_XY, CallFunc_Lerp_ReturnValue) == 0x000040, "Member 'GC_Athena_OutsideSafeZone_C_Get_Location_in_Circle_XY::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_Get_Location_in_Circle_XY, CallFunc_Cos_ReturnValue) == 0x000044, "Member 'GC_Athena_OutsideSafeZone_C_Get_Location_in_Circle_XY::CallFunc_Cos_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_Get_Location_in_Circle_XY, CallFunc_Sin_ReturnValue) == 0x000048, "Member 'GC_Athena_OutsideSafeZone_C_Get_Location_in_Circle_XY::CallFunc_Sin_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_Get_Location_in_Circle_XY, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00004C, "Member 'GC_Athena_OutsideSafeZone_C_Get_Location_in_Circle_XY::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_Get_Location_in_Circle_XY, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000050, "Member 'GC_Athena_OutsideSafeZone_C_Get_Location_in_Circle_XY::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_Get_Location_in_Circle_XY, CallFunc_MakeVector_ReturnValue_1) == 0x000058, "Member 'GC_Athena_OutsideSafeZone_C_Get_Location_in_Circle_XY::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_Get_Location_in_Circle_XY, CallFunc_VLerp_ReturnValue) == 0x000070, "Member 'GC_Athena_OutsideSafeZone_C_Get_Location_in_Circle_XY::CallFunc_VLerp_ReturnValue' has a wrong offset!");

// Function GC_Athena_OutsideSafeZone.GC_Athena_OutsideSafeZone_C.OnLoopingStart
// 0x00F8 (0x00F8 - 0x0000)
struct GC_Athena_OutsideSafeZone_C_OnLoopingStart final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00E8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Athena_OutsideSafeZone_C_OnLoopingStart) == 0x000008, "Wrong alignment on GC_Athena_OutsideSafeZone_C_OnLoopingStart");
static_assert(sizeof(GC_Athena_OutsideSafeZone_C_OnLoopingStart) == 0x0000F8, "Wrong size on GC_Athena_OutsideSafeZone_C_OnLoopingStart");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_OnLoopingStart, MyTarget) == 0x000000, "Member 'GC_Athena_OutsideSafeZone_C_OnLoopingStart::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_OnLoopingStart, Parameters) == 0x000008, "Member 'GC_Athena_OutsideSafeZone_C_OnLoopingStart::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_OnLoopingStart, ParticleComponents) == 0x0000D8, "Member 'GC_Athena_OutsideSafeZone_C_OnLoopingStart::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_OnLoopingStart, AudioComponents) == 0x0000E8, "Member 'GC_Athena_OutsideSafeZone_C_OnLoopingStart::AudioComponents' has a wrong offset!");

// Function GC_Athena_OutsideSafeZone.GC_Athena_OutsideSafeZone_C.OnRemoval
// 0x0108 (0x0108 - 0x0000)
struct GC_Athena_OutsideSafeZone_C_OnRemoval final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00E8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00F8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x0100(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Athena_OutsideSafeZone_C_OnRemoval) == 0x000008, "Wrong alignment on GC_Athena_OutsideSafeZone_C_OnRemoval");
static_assert(sizeof(GC_Athena_OutsideSafeZone_C_OnRemoval) == 0x000108, "Wrong size on GC_Athena_OutsideSafeZone_C_OnRemoval");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_OnRemoval, MyTarget) == 0x000000, "Member 'GC_Athena_OutsideSafeZone_C_OnRemoval::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_OnRemoval, Parameters) == 0x000008, "Member 'GC_Athena_OutsideSafeZone_C_OnRemoval::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_OnRemoval, ParticleComponents) == 0x0000D8, "Member 'GC_Athena_OutsideSafeZone_C_OnRemoval::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_OnRemoval, AudioComponents) == 0x0000E8, "Member 'GC_Athena_OutsideSafeZone_C_OnRemoval::AudioComponents' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_OnRemoval, BurstCameraShakeInstance) == 0x0000F8, "Member 'GC_Athena_OutsideSafeZone_C_OnRemoval::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_OnRemoval, BurstDecalInstance) == 0x000100, "Member 'GC_Athena_OutsideSafeZone_C_OnRemoval::BurstDecalInstance' has a wrong offset!");

// Function GC_Athena_OutsideSafeZone.GC_Athena_OutsideSafeZone_C.OnStormEffectsEnabled
// 0x0001 (0x0001 - 0x0000)
struct GC_Athena_OutsideSafeZone_C_OnStormEffectsEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Athena_OutsideSafeZone_C_OnStormEffectsEnabled) == 0x000001, "Wrong alignment on GC_Athena_OutsideSafeZone_C_OnStormEffectsEnabled");
static_assert(sizeof(GC_Athena_OutsideSafeZone_C_OnStormEffectsEnabled) == 0x000001, "Wrong size on GC_Athena_OutsideSafeZone_C_OnStormEffectsEnabled");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_OnStormEffectsEnabled, bEnabled) == 0x000000, "Member 'GC_Athena_OutsideSafeZone_C_OnStormEffectsEnabled::bEnabled' has a wrong offset!");

// Function GC_Athena_OutsideSafeZone.GC_Athena_OutsideSafeZone_C.Random Lighting Flashes
// 0x0188 (0x0188 - 0x0000)
struct GC_Athena_OutsideSafeZone_C_Random_Lighting_Flashes final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0060(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Get_Location_in_Circle_XY_Location_Local_Space; // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Athena_OutsideSafeZone_C_Random_Lighting_Flashes) == 0x000008, "Wrong alignment on GC_Athena_OutsideSafeZone_C_Random_Lighting_Flashes");
static_assert(sizeof(GC_Athena_OutsideSafeZone_C_Random_Lighting_Flashes) == 0x000188, "Wrong size on GC_Athena_OutsideSafeZone_C_Random_Lighting_Flashes");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_Random_Lighting_Flashes, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'GC_Athena_OutsideSafeZone_C_Random_Lighting_Flashes::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Athena_OutsideSafeZone_C_Random_Lighting_Flashes, CallFunc_BreakVector_X) == 0x000018, "Member 'GC_Athena_OutsideSafeZone_C_Random_Lighting_Flashes::CallFunc_BreakVector_X' has a wrong offset!");
