#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Armadillo_PlayerMissileExplode

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCN_Armadillo_PlayerMissileExplode.GCN_Armadillo_PlayerMissileExplode_C.OnBurstGeneric
// 0x0200 (0x0200 - 0x0000)
struct GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             ParticleComponents;                                // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00E8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00F8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x0100(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable;                              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_Array_Get_Item;                           // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0120(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0138(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x013C(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0140(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0160(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E2[0x6];                                      // 0x01E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable_1;                            // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default;                             // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric) == 0x000008, "Wrong alignment on GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric");
static_assert(sizeof(GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric) == 0x000200, "Wrong size on GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric");
static_assert(offsetof(GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric, MyTarget) == 0x000000, "Member 'GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric, Parameters) == 0x000008, "Member 'GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric, ParticleComponents) == 0x0000D8, "Member 'GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric, AudioComponents) == 0x0000E8, "Member 'GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric, BurstCameraShakeInstance) == 0x0000F8, "Member 'GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric, BurstDecalInstance) == 0x000100, "Member 'GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric, Temp_object_Variable) == 0x000108, "Member 'GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric, CallFunc_Array_Get_Item) == 0x000110, "Member 'GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000118, "Member 'GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x00011C, "Member 'GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000120, "Member 'GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000138, "Member 'GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x00013C, "Member 'GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000140, "Member 'GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000160, "Member 'GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_Location) == 0x000180, "Member 'GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_Normal) == 0x000198, "Member 'GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_Instigator) == 0x0001B0, "Member 'GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x0001B8, "Member 'GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0001C0, "Member 'GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001C8, "Member 'GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001D0, "Member 'GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001D4, "Member 'GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0001D8, "Member 'GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0001E0, "Member 'GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric, CallFunc_IsLocallyControlled_ReturnValue) == 0x0001E1, "Member 'GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric, Temp_object_Variable_1) == 0x0001E8, "Member 'GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric, Temp_bool_Variable) == 0x0001F0, "Member 'GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric, K2Node_Select_Default) == 0x0001F8, "Member 'GCN_Armadillo_PlayerMissileExplode_C_OnBurstGeneric::K2Node_Select_Default' has a wrong offset!");

}

