#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Loop_Shadow_Bomb

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_Loop_Shadow_Bomb.GCN_Loop_Shadow_Bomb_C
// 0x01B0 (0x0AF8 - 0x0948)
class AGCN_Loop_Shadow_Bomb_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0948(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_0_Visbility_E1DFEC9547FE3FAED2AFF3B0D8598182; // 0x0950(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_E1DFEC9547FE3FAED2AFF3B0D8598182; // 0x0954(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_955[0x3];                                      // 0x0955(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0958(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        TargetPlayer;                                      // 0x0960(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExpirationSoundPeriod;                             // 0x0968(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VelocityInterp;                                    // 0x096C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       AttachedFX;                                        // 0x0970(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class USkeletalMeshComponent*>         PlayerSkeletalMeshes;                              // 0x0980(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          FriendlyPlayer;                                    // 0x0990(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_991[0x7];                                      // 0x0991(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           ExpireTellDelayTimer;                              // 0x0998(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ExpirationSoundTimer;                              // 0x09A0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         VisbilityLevel;                                    // 0x09A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WalkVisMultiplier;                                 // 0x09AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SprintVisMultiplier;                               // 0x09B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinFriendlyOpacity;                                // 0x09B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InteractVisibility;                                // 0x09B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9BC[0x4];                                      // 0x09BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         DataDuration;                                      // 0x09C0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         DataTellDuration;                                  // 0x09E8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         DataWalkVisMult;                                   // 0x0A10(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         DataSprintVisMult;                                 // 0x0A38(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         DataFriendlyVisMult;                               // 0x0A60(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         DataShadowPlaneOpacity;                            // 0x0A88(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UTimelineComponent*                     FadeInOut;                                         // 0x0AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TickENabled;                                       // 0x0AB8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AB9[0x7];                                      // 0x0AB9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         SmokeBombDuration;                                 // 0x0AC0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         TellDuration;                                      // 0x0AE8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExpireTellOpacity;                                 // 0x0AEC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SmokeBombDurationUserSpecified;                    // 0x0AF0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Audio_Tick();
	void BeginExpireTell();
	void ClearExpireTell();
	void EndedInteract();
	void ExecuteUbergraph_GCN_Loop_Shadow_Bomb(int32 EntryPoint);
	void ExpireWarningTick();
	void GetSkeletalMeshes();
	void OnFinishedCharacterCustomization_Bind(class AFortPlayerPawn* Pawn);
	void OnLoopingStart(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);
	void OnRemoval(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UMatineeCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void OnWeaponEquippedDelegate_Event_0(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void ReceiveTick(float DeltaSeconds);
	void StartedInteract();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void UnbindEquippedWeapon();
	void UpdateTeamVisbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_Loop_Shadow_Bomb_C">();
	}
	static class AGCN_Loop_Shadow_Bomb_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_Loop_Shadow_Bomb_C>();
	}
};
static_assert(alignof(AGCN_Loop_Shadow_Bomb_C) == 0x000008, "Wrong alignment on AGCN_Loop_Shadow_Bomb_C");
static_assert(sizeof(AGCN_Loop_Shadow_Bomb_C) == 0x000AF8, "Wrong size on AGCN_Loop_Shadow_Bomb_C");
static_assert(offsetof(AGCN_Loop_Shadow_Bomb_C, UberGraphFrame) == 0x000948, "Member 'AGCN_Loop_Shadow_Bomb_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Shadow_Bomb_C, Timeline_0_Visbility_E1DFEC9547FE3FAED2AFF3B0D8598182) == 0x000950, "Member 'AGCN_Loop_Shadow_Bomb_C::Timeline_0_Visbility_E1DFEC9547FE3FAED2AFF3B0D8598182' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Shadow_Bomb_C, Timeline_0__Direction_E1DFEC9547FE3FAED2AFF3B0D8598182) == 0x000954, "Member 'AGCN_Loop_Shadow_Bomb_C::Timeline_0__Direction_E1DFEC9547FE3FAED2AFF3B0D8598182' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Shadow_Bomb_C, Timeline_0) == 0x000958, "Member 'AGCN_Loop_Shadow_Bomb_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Shadow_Bomb_C, TargetPlayer) == 0x000960, "Member 'AGCN_Loop_Shadow_Bomb_C::TargetPlayer' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Shadow_Bomb_C, ExpirationSoundPeriod) == 0x000968, "Member 'AGCN_Loop_Shadow_Bomb_C::ExpirationSoundPeriod' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Shadow_Bomb_C, VelocityInterp) == 0x00096C, "Member 'AGCN_Loop_Shadow_Bomb_C::VelocityInterp' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Shadow_Bomb_C, AttachedFX) == 0x000970, "Member 'AGCN_Loop_Shadow_Bomb_C::AttachedFX' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Shadow_Bomb_C, PlayerSkeletalMeshes) == 0x000980, "Member 'AGCN_Loop_Shadow_Bomb_C::PlayerSkeletalMeshes' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Shadow_Bomb_C, FriendlyPlayer) == 0x000990, "Member 'AGCN_Loop_Shadow_Bomb_C::FriendlyPlayer' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Shadow_Bomb_C, ExpireTellDelayTimer) == 0x000998, "Member 'AGCN_Loop_Shadow_Bomb_C::ExpireTellDelayTimer' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Shadow_Bomb_C, ExpirationSoundTimer) == 0x0009A0, "Member 'AGCN_Loop_Shadow_Bomb_C::ExpirationSoundTimer' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Shadow_Bomb_C, VisbilityLevel) == 0x0009A8, "Member 'AGCN_Loop_Shadow_Bomb_C::VisbilityLevel' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Shadow_Bomb_C, WalkVisMultiplier) == 0x0009AC, "Member 'AGCN_Loop_Shadow_Bomb_C::WalkVisMultiplier' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Shadow_Bomb_C, SprintVisMultiplier) == 0x0009B0, "Member 'AGCN_Loop_Shadow_Bomb_C::SprintVisMultiplier' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Shadow_Bomb_C, MinFriendlyOpacity) == 0x0009B4, "Member 'AGCN_Loop_Shadow_Bomb_C::MinFriendlyOpacity' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Shadow_Bomb_C, InteractVisibility) == 0x0009B8, "Member 'AGCN_Loop_Shadow_Bomb_C::InteractVisibility' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Shadow_Bomb_C, DataDuration) == 0x0009C0, "Member 'AGCN_Loop_Shadow_Bomb_C::DataDuration' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Shadow_Bomb_C, DataTellDuration) == 0x0009E8, "Member 'AGCN_Loop_Shadow_Bomb_C::DataTellDuration' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Shadow_Bomb_C, DataWalkVisMult) == 0x000A10, "Member 'AGCN_Loop_Shadow_Bomb_C::DataWalkVisMult' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Shadow_Bomb_C, DataSprintVisMult) == 0x000A38, "Member 'AGCN_Loop_Shadow_Bomb_C::DataSprintVisMult' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Shadow_Bomb_C, DataFriendlyVisMult) == 0x000A60, "Member 'AGCN_Loop_Shadow_Bomb_C::DataFriendlyVisMult' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Shadow_Bomb_C, DataShadowPlaneOpacity) == 0x000A88, "Member 'AGCN_Loop_Shadow_Bomb_C::DataShadowPlaneOpacity' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Shadow_Bomb_C, FadeInOut) == 0x000AB0, "Member 'AGCN_Loop_Shadow_Bomb_C::FadeInOut' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Shadow_Bomb_C, TickENabled) == 0x000AB8, "Member 'AGCN_Loop_Shadow_Bomb_C::TickENabled' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Shadow_Bomb_C, SmokeBombDuration) == 0x000AC0, "Member 'AGCN_Loop_Shadow_Bomb_C::SmokeBombDuration' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Shadow_Bomb_C, TellDuration) == 0x000AE8, "Member 'AGCN_Loop_Shadow_Bomb_C::TellDuration' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Shadow_Bomb_C, ExpireTellOpacity) == 0x000AEC, "Member 'AGCN_Loop_Shadow_Bomb_C::ExpireTellOpacity' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Shadow_Bomb_C, SmokeBombDurationUserSpecified) == 0x000AF0, "Member 'AGCN_Loop_Shadow_Bomb_C::SmokeBombDurationUserSpecified' has a wrong offset!");

}

