#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Galileo_Lobster_Deflect_Parent

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCN_Galileo_Lobster_Deflect_Parent.GCN_Galileo_Lobster_Deflect_Parent_C.OnBurst
// 0x0338 (0x0338 - 0x0000)
struct GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00E8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00F8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x0100(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_Array_Get_Item;                           // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_Array_Get_Item_1;                         // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0148(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0160(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0164(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0168(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0188(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude_1; // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude_1; // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext_1; // 0x0218(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName_1; // 0x0230(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag_1; // 0x0234(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags_1; // 0x0238(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags_1; // 0x0258(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location_1;    // 0x0278(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal_1;      // 0x0290(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator_1;  // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser_1; // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject_1; // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial_1; // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel_1; // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel_1; // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent_1; // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy_1; // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput; // 0x02E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F2[0x2];                                      // 0x02F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput_1; // 0x0300(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSoundFromBank_Sound_Exists;            // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             CallFunc_GetSoundFromBank_Sound;                   // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x032D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32E[0x2];                                      // 0x032E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst) == 0x000008, "Wrong alignment on GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst");
static_assert(sizeof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst) == 0x000338, "Wrong size on GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, MyTarget) == 0x000000, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, Parameters) == 0x000008, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, ParticleComponents) == 0x0000D8, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, AudioComponents) == 0x0000E8, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, BurstCameraShakeInstance) == 0x0000F8, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, BurstDecalInstance) == 0x000100, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_IsValid_ReturnValue) == 0x000108, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_Conv_FloatToString_ReturnValue) == 0x000110, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_Array_Get_Item) == 0x000120, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_Array_Length_ReturnValue) == 0x000128, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_Array_Get_Item_1) == 0x000130, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_Greater_IntInt_ReturnValue) == 0x000138, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x00013C, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x000140, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000148, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000160, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000164, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000168, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000188, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_Location) == 0x0001A8, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_Normal) == 0x0001C0, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_Instigator) == 0x0001D8, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x0001E0, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0001E8, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001F0, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001F8, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001FC, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x000200, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x000208, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude_1) == 0x00020C, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_RawMagnitude_1) == 0x000210, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_RawMagnitude_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_EffectContext_1) == 0x000218, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_EffectContext_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_MatchedTagName_1) == 0x000230, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_MatchedTagName_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_OriginalTag_1) == 0x000234, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_OriginalTag_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags_1) == 0x000238, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags_1) == 0x000258, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_Location_1) == 0x000278, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_Location_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_Normal_1) == 0x000290, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_Normal_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_Instigator_1) == 0x0002A8, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_Instigator_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_EffectCauser_1) == 0x0002B0, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_EffectCauser_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_SourceObject_1) == 0x0002B8, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_SourceObject_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_PhysicalMaterial_1) == 0x0002C0, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_PhysicalMaterial_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel_1) == 0x0002C8, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_AbilityLevel_1) == 0x0002CC, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_AbilityLevel_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_TargetAttachComponent_1) == 0x0002D0, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_TargetAttachComponent_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy_1) == 0x0002D8, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_SetFloatParameter_self_CastInput) == 0x0002E0, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_SetFloatParameter_self_CastInput' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_Less_FloatFloat_ReturnValue) == 0x0002F0, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x0002F1, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0002F4, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BooleanAND_ReturnValue) == 0x0002F8, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_SetFloatParameter_self_CastInput_1) == 0x000300, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_SetFloatParameter_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_GetOwner_ReturnValue) == 0x000310, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_GetSoundFromBank_Sound_Exists) == 0x000318, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_GetSoundFromBank_Sound_Exists' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_GetSoundFromBank_Sound) == 0x000320, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_GetSoundFromBank_Sound' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_MapRangeClamped_ReturnValue) == 0x000328, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, CallFunc_BooleanAND_ReturnValue_1) == 0x00032C, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, Temp_bool_Variable) == 0x00032D, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst, K2Node_Select_Default) == 0x000330, "Member 'GCN_Galileo_Lobster_Deflect_Parent_C_OnBurst::K2Node_Select_Default' has a wrong offset!");

}

