#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Athena_Interrogation_Reveal_Stencil_Latent

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_Athena_Interrogation_Reveal_Stencil_Latent.GCN_Athena_Interrogation_Reveal_Stencil_Latent_C
// 0x0080 (0x0590 - 0x0510)
class AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C final : public AFortGameplayCueNotify_BurstLatent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  PostProcess;                                       // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SweepDuration;                                     // 0x0520(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_524[0x4];                                      // 0x0524(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           SweepDelayHandle;                                  // 0x0528(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         SweepRadius;                                       // 0x0530(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_534[0x4];                                      // 0x0534(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LocalPlayerLocation;                               // 0x0538(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   PlayerPawnAthena;                                  // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DelayBeforeSweep;                                  // 0x0558(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55C[0x4];                                      // 0x055C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           DelayBeforeSweepHandle;                            // 0x0560(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         StencilDuration;                                   // 0x0568(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BeginSweepFX();
	void EndSweepFX();
	void ExecuteUbergraph_GCN_Athena_Interrogation_Reveal_Stencil_Latent(int32 EntryPoint);
	bool OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void PlayWorldSweep();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_Athena_Interrogation_Reveal_Stencil_Latent_C">();
	}
	static class AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C>();
	}
};
static_assert(alignof(AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C) == 0x000008, "Wrong alignment on AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C");
static_assert(sizeof(AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C) == 0x000590, "Wrong size on AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C");
static_assert(offsetof(AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C, UberGraphFrame) == 0x000510, "Member 'AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C, PostProcess) == 0x000518, "Member 'AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C::PostProcess' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C, SweepDuration) == 0x000520, "Member 'AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C::SweepDuration' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C, SweepDelayHandle) == 0x000528, "Member 'AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C::SweepDelayHandle' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C, SweepRadius) == 0x000530, "Member 'AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C::SweepRadius' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C, LocalPlayerLocation) == 0x000538, "Member 'AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C::LocalPlayerLocation' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C, PlayerPawnAthena) == 0x000550, "Member 'AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C::PlayerPawnAthena' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C, DelayBeforeSweep) == 0x000558, "Member 'AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C::DelayBeforeSweep' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C, DelayBeforeSweepHandle) == 0x000560, "Member 'AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C::DelayBeforeSweepHandle' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C, StencilDuration) == 0x000568, "Member 'AGCN_Athena_Interrogation_Reveal_Stencil_Latent_C::StencilDuration' has a wrong offset!");

}

