#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Athena_MultiInteract

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GCNL_Athena_MultiInteract.GCNL_Athena_MultiInteract_C.ExecuteUbergraph_GCNL_Athena_MultiInteract
// 0x0468 (0x0468 - 0x0000)
struct GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget_2;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_2;                         // 0x0030(0x00D0)(ConstParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             K2Node_Event_ParticleComponents_2;                 // 0x0100(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents_2;                    // 0x0110(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    K2Node_Event_BurstCameraShakeInstance_1;           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance_1;                 // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_MyTarget_1;                           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0138(0x00D0)(ConstParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             K2Node_Event_ParticleComponents_1;                 // 0x0208(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents_1;                    // 0x0218(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    K2Node_Event_BurstCameraShakeInstance;             // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance;                   // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0240(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0258(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x025C(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0260(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0280(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x02A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x02B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0310(0x00D0)(ConstParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             K2Node_Event_ParticleComponents;                   // 0x03E0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x03F0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0409(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x040A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40B[0x1];                                      // 0x040B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_411[0x3];                                      // 0x0411(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InteractingActorCount;          // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_MultiInteractMultiplier;        // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_InteractingDuration;            // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0420(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0430(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_441[0x3];                                      // 0x0441(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 InteractingActorCount, float MultiInteractMultiplier, float InteractingDuration)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0448(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 InteractingActorCount, float MultiInteractMultiplier, float InteractingDuration)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0454(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract) == 0x000008, "Wrong alignment on GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract");
static_assert(sizeof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract) == 0x000468, "Wrong size on GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, EntryPoint) == 0x000000, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_IsValid_ReturnValue_2) == 0x000021, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_IsValid_ReturnValue_3) == 0x000022, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_IsValid_ReturnValue_4) == 0x000023, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_Event_MyTarget_2) == 0x000028, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_Event_MyTarget_2' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_Event_Parameters_2) == 0x000030, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_Event_Parameters_2' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_Event_ParticleComponents_2) == 0x000100, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_Event_ParticleComponents_2' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_Event_AudioComponents_2) == 0x000110, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_Event_AudioComponents_2' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_Event_BurstCameraShakeInstance_1) == 0x000120, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_Event_BurstCameraShakeInstance_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_Event_BurstDecalInstance_1) == 0x000128, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_Event_BurstDecalInstance_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_Event_MyTarget_1) == 0x000130, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_Event_MyTarget_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_Event_Parameters_1) == 0x000138, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_Event_ParticleComponents_1) == 0x000208, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_Event_ParticleComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_Event_AudioComponents_1) == 0x000218, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_Event_AudioComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_Event_BurstCameraShakeInstance) == 0x000228, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_Event_BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_Event_BurstDecalInstance) == 0x000230, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_Event_BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000238, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x00023C, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000240, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000258, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x00025C, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000260, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000280, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_Location) == 0x0002A0, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_Normal) == 0x0002B8, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_Instigator) == 0x0002D0, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x0002D8, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0002E0, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0002E8, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0002F0, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0002F4, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0002F8, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x000300, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_Event_MyTarget) == 0x000308, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_Event_Parameters) == 0x000310, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_Event_ParticleComponents) == 0x0003E0, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_Event_AudioComponents) == 0x0003F0, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000400, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_DynamicCast_bSuccess) == 0x000408, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_IsValid_ReturnValue_5) == 0x000409, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_K2_AttachToComponent_ReturnValue) == 0x00040A, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_RandomFloatInRange_ReturnValue) == 0x00040C, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000410, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_CustomEvent_InteractingActorCount) == 0x000414, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_CustomEvent_InteractingActorCount' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_CustomEvent_MultiInteractMultiplier) == 0x000418, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_CustomEvent_MultiInteractMultiplier' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_CustomEvent_InteractingDuration) == 0x00041C, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_CustomEvent_InteractingDuration' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_CreateDelegate_OutputDelegate) == 0x000420, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00042C, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000430, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_MapRangeClamped_ReturnValue) == 0x000438, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00043C, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_IsValid_ReturnValue_6) == 0x000440, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000444, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_CreateDelegate_OutputDelegate_1) == 0x000448, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, K2Node_CreateDelegate_OutputDelegate_2) == 0x000454, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract, CallFunc_FInterpTo_ReturnValue) == 0x000460, "Member 'GCNL_Athena_MultiInteract_C_ExecuteUbergraph_GCNL_Athena_MultiInteract::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");

// Function GCNL_Athena_MultiInteract.GCNL_Athena_MultiInteract_C.OnActorCountChanged
// 0x000C (0x000C - 0x0000)
struct GCNL_Athena_MultiInteract_C_OnActorCountChanged final
{
public:
	int32                                         InteractingActorCount;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MultiInteractMultiplier;                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InteractingDuration;                               // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_MultiInteract_C_OnActorCountChanged) == 0x000004, "Wrong alignment on GCNL_Athena_MultiInteract_C_OnActorCountChanged");
static_assert(sizeof(GCNL_Athena_MultiInteract_C_OnActorCountChanged) == 0x00000C, "Wrong size on GCNL_Athena_MultiInteract_C_OnActorCountChanged");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_OnActorCountChanged, InteractingActorCount) == 0x000000, "Member 'GCNL_Athena_MultiInteract_C_OnActorCountChanged::InteractingActorCount' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_OnActorCountChanged, MultiInteractMultiplier) == 0x000004, "Member 'GCNL_Athena_MultiInteract_C_OnActorCountChanged::MultiInteractMultiplier' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_OnActorCountChanged, InteractingDuration) == 0x000008, "Member 'GCNL_Athena_MultiInteract_C_OnActorCountChanged::InteractingDuration' has a wrong offset!");

// Function GCNL_Athena_MultiInteract.GCNL_Athena_MultiInteract_C.OnApplicationGeneric
// 0x0108 (0x0108 - 0x0000)
struct GCNL_Athena_MultiInteract_C_OnApplicationGeneric final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             ParticleComponents;                                // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00E8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00F8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x0100(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_MultiInteract_C_OnApplicationGeneric) == 0x000008, "Wrong alignment on GCNL_Athena_MultiInteract_C_OnApplicationGeneric");
static_assert(sizeof(GCNL_Athena_MultiInteract_C_OnApplicationGeneric) == 0x000108, "Wrong size on GCNL_Athena_MultiInteract_C_OnApplicationGeneric");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_OnApplicationGeneric, MyTarget) == 0x000000, "Member 'GCNL_Athena_MultiInteract_C_OnApplicationGeneric::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_OnApplicationGeneric, Parameters) == 0x000008, "Member 'GCNL_Athena_MultiInteract_C_OnApplicationGeneric::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_OnApplicationGeneric, ParticleComponents) == 0x0000D8, "Member 'GCNL_Athena_MultiInteract_C_OnApplicationGeneric::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_OnApplicationGeneric, AudioComponents) == 0x0000E8, "Member 'GCNL_Athena_MultiInteract_C_OnApplicationGeneric::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_OnApplicationGeneric, BurstCameraShakeInstance) == 0x0000F8, "Member 'GCNL_Athena_MultiInteract_C_OnApplicationGeneric::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_OnApplicationGeneric, BurstDecalInstance) == 0x000100, "Member 'GCNL_Athena_MultiInteract_C_OnApplicationGeneric::BurstDecalInstance' has a wrong offset!");

// Function GCNL_Athena_MultiInteract.GCNL_Athena_MultiInteract_C.OnLoopingStartGeneric
// 0x00F8 (0x00F8 - 0x0000)
struct GCNL_Athena_MultiInteract_C_OnLoopingStartGeneric final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             ParticleComponents;                                // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00E8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCNL_Athena_MultiInteract_C_OnLoopingStartGeneric) == 0x000008, "Wrong alignment on GCNL_Athena_MultiInteract_C_OnLoopingStartGeneric");
static_assert(sizeof(GCNL_Athena_MultiInteract_C_OnLoopingStartGeneric) == 0x0000F8, "Wrong size on GCNL_Athena_MultiInteract_C_OnLoopingStartGeneric");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_OnLoopingStartGeneric, MyTarget) == 0x000000, "Member 'GCNL_Athena_MultiInteract_C_OnLoopingStartGeneric::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_OnLoopingStartGeneric, Parameters) == 0x000008, "Member 'GCNL_Athena_MultiInteract_C_OnLoopingStartGeneric::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_OnLoopingStartGeneric, ParticleComponents) == 0x0000D8, "Member 'GCNL_Athena_MultiInteract_C_OnLoopingStartGeneric::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_OnLoopingStartGeneric, AudioComponents) == 0x0000E8, "Member 'GCNL_Athena_MultiInteract_C_OnLoopingStartGeneric::AudioComponents' has a wrong offset!");

// Function GCNL_Athena_MultiInteract.GCNL_Athena_MultiInteract_C.OnRemovalGeneric
// 0x0108 (0x0108 - 0x0000)
struct GCNL_Athena_MultiInteract_C_OnRemovalGeneric final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             ParticleComponents;                                // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00E8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00F8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x0100(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_MultiInteract_C_OnRemovalGeneric) == 0x000008, "Wrong alignment on GCNL_Athena_MultiInteract_C_OnRemovalGeneric");
static_assert(sizeof(GCNL_Athena_MultiInteract_C_OnRemovalGeneric) == 0x000108, "Wrong size on GCNL_Athena_MultiInteract_C_OnRemovalGeneric");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_OnRemovalGeneric, MyTarget) == 0x000000, "Member 'GCNL_Athena_MultiInteract_C_OnRemovalGeneric::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_OnRemovalGeneric, Parameters) == 0x000008, "Member 'GCNL_Athena_MultiInteract_C_OnRemovalGeneric::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MultiInteract_C_OnRemovalGeneric, ParticleComponents) == 0x0000D8, "Member 'GCNL_Athena_MultiInteract_C_OnRemovalGeneric::ParticleComponents' has a wrong offset!");
