#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Athena_VictoryCrown_CrownWearer_Looping

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GCNL_Athena_VictoryCrown_CrownWearer_Looping.GCNL_Athena_VictoryCrown_CrownWearer_Looping_C.ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping
// 0x03C0 (0x03C0 - 0x0000)
struct GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TArray<EFortTeamAffiliation>                  K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
	class AActor*                                 K2Node_Event_MyTarget_2;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_2;                         // 0x0030(0x00D0)(ConstParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             K2Node_Event_ParticleComponents_2;                 // 0x0100(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents_2;                    // 0x0110(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    K2Node_Event_BurstCameraShakeInstance_1;           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance_1;                 // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0130(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetValueAsBool_ReturnValue;               // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_3;            // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_4;            // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0158(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_MyTarget_1;                           // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0170(0x00D0)(ConstParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             K2Node_Event_ParticleComponents_1;                 // 0x0240(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents_1;                    // 0x0250(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    K2Node_Event_BurstCameraShakeInstance;             // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance;                   // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue; // 0x0278(0x0010)(ReferenceParm)
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0290(0x00D0)(ConstParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             K2Node_Event_ParticleComponents;                   // 0x0360(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x0370(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x3];                                      // 0x0381(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetVisualVolume_NewParam1;                // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0388(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetActorTeam_ReturnValue;                 // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x03A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue_1;                  // 0x03AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AB[0x5];                                      // 0x03AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     CallFunc_Array_Get_Item;                           // 0x03B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping) == 0x000008, "Wrong alignment on GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping");
static_assert(sizeof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping) == 0x0003C0, "Wrong size on GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, EntryPoint) == 0x000000, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, Temp_object_Variable) == 0x000008, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, K2Node_MakeArray_Array) == 0x000018, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, K2Node_Event_MyTarget_2) == 0x000028, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::K2Node_Event_MyTarget_2' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, K2Node_Event_Parameters_2) == 0x000030, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::K2Node_Event_Parameters_2' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, K2Node_Event_ParticleComponents_2) == 0x000100, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::K2Node_Event_ParticleComponents_2' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, K2Node_Event_AudioComponents_2) == 0x000110, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::K2Node_Event_AudioComponents_2' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, K2Node_Event_BurstCameraShakeInstance_1) == 0x000120, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::K2Node_Event_BurstCameraShakeInstance_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, K2Node_Event_BurstDecalInstance_1) == 0x000128, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::K2Node_Event_BurstDecalInstance_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, K2Node_CreateDelegate_OutputDelegate) == 0x000130, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x00013C, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, CallFunc_GetValueAtLevel_ReturnValue) == 0x000140, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, CallFunc_GetValueAsBool_ReturnValue) == 0x000144, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::CallFunc_GetValueAsBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000148, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x00014C, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, CallFunc_GetValueAtLevel_ReturnValue_3) == 0x000150, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::CallFunc_GetValueAtLevel_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, CallFunc_GetValueAtLevel_ReturnValue_4) == 0x000154, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::CallFunc_GetValueAtLevel_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000158, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000160, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000164, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, K2Node_Event_MyTarget_1) == 0x000168, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::K2Node_Event_MyTarget_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, K2Node_Event_Parameters_1) == 0x000170, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, K2Node_Event_ParticleComponents_1) == 0x000240, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::K2Node_Event_ParticleComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, K2Node_Event_AudioComponents_1) == 0x000250, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::K2Node_Event_AudioComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, K2Node_Event_BurstCameraShakeInstance) == 0x000260, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::K2Node_Event_BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, K2Node_Event_BurstDecalInstance) == 0x000268, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::K2Node_Event_BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000270, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, CallFunc_GetLocalFortPlayerControllers_ReturnValue) == 0x000278, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::CallFunc_GetLocalFortPlayerControllers_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, K2Node_Event_MyTarget) == 0x000288, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, K2Node_Event_Parameters) == 0x000290, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, K2Node_Event_ParticleComponents) == 0x000360, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, K2Node_Event_AudioComponents) == 0x000370, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, CallFunc_Array_Contains_ReturnValue) == 0x000380, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, CallFunc_GetVisualVolume_NewParam1) == 0x000384, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::CallFunc_GetVisualVolume_NewParam1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000388, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0003A0, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x0003A4, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, CallFunc_GetActorTeam_ReturnValue) == 0x0003A8, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, CallFunc_IsPlaying_ReturnValue) == 0x0003A9, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, CallFunc_IsPlaying_ReturnValue_1) == 0x0003AA, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::CallFunc_IsPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, CallFunc_Array_Get_Item) == 0x0003B0, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, CallFunc_IsValid_ReturnValue) == 0x0003B8, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, CallFunc_IsValid_ReturnValue_1) == 0x0003B9, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function GCNL_Athena_VictoryCrown_CrownWearer_Looping.GCNL_Athena_VictoryCrown_CrownWearer_Looping_C.GetVisualVolume
// 0x0018 (0x0018 - 0x0000)
struct GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_GetVisualVolume final
{
public:
	bool                                          IsFirstPerson;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NewParam1;                                         // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_GetVisualVolume) == 0x000004, "Wrong alignment on GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_GetVisualVolume");
static_assert(sizeof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_GetVisualVolume) == 0x000018, "Wrong size on GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_GetVisualVolume");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_GetVisualVolume, IsFirstPerson) == 0x000000, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_GetVisualVolume::IsFirstPerson' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_GetVisualVolume, NewParam1) == 0x000004, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_GetVisualVolume::NewParam1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_GetVisualVolume, Temp_bool_Variable) == 0x000008, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_GetVisualVolume::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_GetVisualVolume, CallFunc_GetValueAtLevel_ReturnValue) == 0x00000C, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_GetVisualVolume::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_GetVisualVolume, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000010, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_GetVisualVolume::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_GetVisualVolume, K2Node_Select_Default) == 0x000014, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_GetVisualVolume::K2Node_Select_Default' has a wrong offset!");

// Function GCNL_Athena_VictoryCrown_CrownWearer_Looping.GCNL_Athena_VictoryCrown_CrownWearer_Looping_C.OnApplicationGeneric
// 0x0108 (0x0108 - 0x0000)
struct GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnApplicationGeneric final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             ParticleComponents;                                // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00E8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00F8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x0100(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnApplicationGeneric) == 0x000008, "Wrong alignment on GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnApplicationGeneric");
static_assert(sizeof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnApplicationGeneric) == 0x000108, "Wrong size on GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnApplicationGeneric");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnApplicationGeneric, MyTarget) == 0x000000, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnApplicationGeneric::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnApplicationGeneric, Parameters) == 0x000008, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnApplicationGeneric::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnApplicationGeneric, ParticleComponents) == 0x0000D8, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnApplicationGeneric::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnApplicationGeneric, AudioComponents) == 0x0000E8, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnApplicationGeneric::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnApplicationGeneric, BurstCameraShakeInstance) == 0x0000F8, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnApplicationGeneric::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnApplicationGeneric, BurstDecalInstance) == 0x000100, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnApplicationGeneric::BurstDecalInstance' has a wrong offset!");

// Function GCNL_Athena_VictoryCrown_CrownWearer_Looping.GCNL_Athena_VictoryCrown_CrownWearer_Looping_C.OnLoopingStartGeneric
// 0x00F8 (0x00F8 - 0x0000)
struct GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnLoopingStartGeneric final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             ParticleComponents;                                // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00E8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnLoopingStartGeneric) == 0x000008, "Wrong alignment on GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnLoopingStartGeneric");
static_assert(sizeof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnLoopingStartGeneric) == 0x0000F8, "Wrong size on GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnLoopingStartGeneric");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnLoopingStartGeneric, MyTarget) == 0x000000, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnLoopingStartGeneric::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnLoopingStartGeneric, Parameters) == 0x000008, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnLoopingStartGeneric::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnLoopingStartGeneric, ParticleComponents) == 0x0000D8, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnLoopingStartGeneric::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnLoopingStartGeneric, AudioComponents) == 0x0000E8, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnLoopingStartGeneric::AudioComponents' has a wrong offset!");

// Function GCNL_Athena_VictoryCrown_CrownWearer_Looping.GCNL_Athena_VictoryCrown_CrownWearer_Looping_C.OnRemovalGeneric
// 0x0108 (0x0108 - 0x0000)
struct GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnRemovalGeneric final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             ParticleComponents;                                // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00E8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00F8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x0100(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnRemovalGeneric) == 0x000008, "Wrong alignment on GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnRemovalGeneric");
static_assert(sizeof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnRemovalGeneric) == 0x000108, "Wrong size on GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnRemovalGeneric");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnRemovalGeneric, MyTarget) == 0x000000, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnRemovalGeneric::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnRemovalGeneric, Parameters) == 0x000008, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnRemovalGeneric::Parameters' has a wrong offset!");
