#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_VisualState_ElementAttached_Fire

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"
#include "B_Enum_PlayerFireStates_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_VisualState_ElementAttached_Fire.GCNL_VisualState_ElementAttached_Fire_C
// 0x0048 (0x0990 - 0x0948)
class AGCNL_VisualState_ElementAttached_Fire_C : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0948(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        OnFireAudioComponent;                              // 0x0950(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundOnPlayerLoop;                                 // 0x0958(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 PawnSkeletalMesh;                                  // 0x0960(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              Pawn;                                              // 0x0968(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           FadeBodyFXTimerHandle;                             // 0x0970(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         FadeInDuration;                                    // 0x0978(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EB_Enum_PlayerFireStates                      PlayerFireState;                                   // 0x097C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_97D[0x3];                                      // 0x097D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      BodyFXParticleSystem;                              // 0x0980(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeOutDuration;                                   // 0x0988(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EB_Enum_PlayerFireStates                      PreviousPlayerFireState;                           // 0x098C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bOnFire;                                           // 0x098D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ActivateBodyFX();
	void ClearAllHandles();
	void DeactivateBodyFX();
	void ExecuteUbergraph_GCNL_VisualState_ElementAttached_Fire(int32 EntryPoint);
	void FadeBodyFXOut();
	void FadeOnFireAudioComponent();
	void GetNiagaraSystemTemplate(class UNiagaraSystem** NiagaraSystem);
	void GetPlayerFireState(EB_Enum_PlayerFireStates* PlayerState);
	void GetPlayerFireStateInternal(EB_Enum_PlayerFireStates* PlayerState);
	void OnApplication(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UMatineeCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void OnRemoval(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UMatineeCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void SetBodyFXParameters(EB_Enum_PlayerFireStates PreviousPlayerFireState_0);
	void SetTargetPawn(class AFortPawn* TargetPawn);
	void UpdatePlayerVisualsByState(EB_Enum_PlayerFireStates PlayerState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_VisualState_ElementAttached_Fire_C">();
	}
	static class AGCNL_VisualState_ElementAttached_Fire_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_VisualState_ElementAttached_Fire_C>();
	}
};
static_assert(alignof(AGCNL_VisualState_ElementAttached_Fire_C) == 0x000008, "Wrong alignment on AGCNL_VisualState_ElementAttached_Fire_C");
static_assert(sizeof(AGCNL_VisualState_ElementAttached_Fire_C) == 0x000990, "Wrong size on AGCNL_VisualState_ElementAttached_Fire_C");
static_assert(offsetof(AGCNL_VisualState_ElementAttached_Fire_C, UberGraphFrame) == 0x000948, "Member 'AGCNL_VisualState_ElementAttached_Fire_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCNL_VisualState_ElementAttached_Fire_C, OnFireAudioComponent) == 0x000950, "Member 'AGCNL_VisualState_ElementAttached_Fire_C::OnFireAudioComponent' has a wrong offset!");
static_assert(offsetof(AGCNL_VisualState_ElementAttached_Fire_C, SoundOnPlayerLoop) == 0x000958, "Member 'AGCNL_VisualState_ElementAttached_Fire_C::SoundOnPlayerLoop' has a wrong offset!");
static_assert(offsetof(AGCNL_VisualState_ElementAttached_Fire_C, PawnSkeletalMesh) == 0x000960, "Member 'AGCNL_VisualState_ElementAttached_Fire_C::PawnSkeletalMesh' has a wrong offset!");
static_assert(offsetof(AGCNL_VisualState_ElementAttached_Fire_C, Pawn) == 0x000968, "Member 'AGCNL_VisualState_ElementAttached_Fire_C::Pawn' has a wrong offset!");
static_assert(offsetof(AGCNL_VisualState_ElementAttached_Fire_C, FadeBodyFXTimerHandle) == 0x000970, "Member 'AGCNL_VisualState_ElementAttached_Fire_C::FadeBodyFXTimerHandle' has a wrong offset!");
static_assert(offsetof(AGCNL_VisualState_ElementAttached_Fire_C, FadeInDuration) == 0x000978, "Member 'AGCNL_VisualState_ElementAttached_Fire_C::FadeInDuration' has a wrong offset!");
static_assert(offsetof(AGCNL_VisualState_ElementAttached_Fire_C, PlayerFireState) == 0x00097C, "Member 'AGCNL_VisualState_ElementAttached_Fire_C::PlayerFireState' has a wrong offset!");
static_assert(offsetof(AGCNL_VisualState_ElementAttached_Fire_C, BodyFXParticleSystem) == 0x000980, "Member 'AGCNL_VisualState_ElementAttached_Fire_C::BodyFXParticleSystem' has a wrong offset!");
static_assert(offsetof(AGCNL_VisualState_ElementAttached_Fire_C, FadeOutDuration) == 0x000988, "Member 'AGCNL_VisualState_ElementAttached_Fire_C::FadeOutDuration' has a wrong offset!");
static_assert(offsetof(AGCNL_VisualState_ElementAttached_Fire_C, PreviousPlayerFireState) == 0x00098C, "Member 'AGCNL_VisualState_ElementAttached_Fire_C::PreviousPlayerFireState' has a wrong offset!");
static_assert(offsetof(AGCNL_VisualState_ElementAttached_Fire_C, bOnFire) == 0x00098D, "Member 'AGCNL_VisualState_ElementAttached_Fire_C::bOnFire' has a wrong offset!");

}

