#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GiftingUI

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "FortniteUI_classes.hpp"
#include "GiftingUI_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonUILegacy_classes.hpp"
#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"
#include "SocialUMG_classes.hpp"


namespace SDK
{

// Class GiftingUI.AthenaGiftConfirmedPanel
// 0x0028 (0x03E0 - 0x03B8)
class UAthenaGiftConfirmedPanel final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3B8[0x18];                                     // 0x03B8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class URichTextBlock*                         Text_RecipientInfo;                                // 0x03D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_Back;                                       // 0x03D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftConfirmedPanel">();
	}
	static class UAthenaGiftConfirmedPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftConfirmedPanel>();
	}
};
static_assert(alignof(UAthenaGiftConfirmedPanel) == 0x000008, "Wrong alignment on UAthenaGiftConfirmedPanel");
static_assert(sizeof(UAthenaGiftConfirmedPanel) == 0x0003E0, "Wrong size on UAthenaGiftConfirmedPanel");
static_assert(offsetof(UAthenaGiftConfirmedPanel, Text_RecipientInfo) == 0x0003D0, "Member 'UAthenaGiftConfirmedPanel::Text_RecipientInfo' has a wrong offset!");
static_assert(offsetof(UAthenaGiftConfirmedPanel, Button_Back) == 0x0003D8, "Member 'UAthenaGiftConfirmedPanel::Button_Back' has a wrong offset!");

// Class GiftingUI.AthenaGiftingConfirmationScreen
// 0x0158 (0x0510 - 0x03B8)
class UAthenaGiftingConfirmationScreen final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3B8[0x30];                                     // 0x03B8(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreFrontOfferInfo*               PresentedGiftableOfferInfo;                        // 0x03E8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortStoreFrontOfferInfo*               PresentedOptionalTokenOfferInfo;                   // 0x03F0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3F8[0xBC];                                     // 0x03F8(0x00BC)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinGiftSubmissionDelay;                            // 0x04B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MaxGiftSubmissionDelay;                            // 0x04B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4BC[0x14];                                     // 0x04BC(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    Button_WrapOptions;                                // 0x04D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_Back;                                       // 0x04D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_MobileClose;                                // 0x04E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_MtxWallet;                                  // 0x04E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaGiftingPurchasePanel*            Panel_GiftingPurchase;                             // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaGiftingWrapOptionsPanel*         Panel_WrapOptions;                                 // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaGiftConfirmedPanel*              Panel_GiftConfirmed;                               // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaGiftingErrorsPanel*              Panel_GiftingErrors;                               // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Dismiss();
	void HandleGiftSent(bool bSuccess, const TArray<class FString>& IneligibleAccounts, const TArray<class FString>& ErrorCodes);
	void HandleTokenOfferPurchaseComplete(bool bSuccess, const TArray<struct FPurchasedItemInfo>& PurchasedItems);
	void OnPresentationModeChanged(EGiftingPresentationMode NewMode);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftingConfirmationScreen">();
	}
	static class UAthenaGiftingConfirmationScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftingConfirmationScreen>();
	}
};
static_assert(alignof(UAthenaGiftingConfirmationScreen) == 0x000008, "Wrong alignment on UAthenaGiftingConfirmationScreen");
static_assert(sizeof(UAthenaGiftingConfirmationScreen) == 0x000510, "Wrong size on UAthenaGiftingConfirmationScreen");
static_assert(offsetof(UAthenaGiftingConfirmationScreen, PresentedGiftableOfferInfo) == 0x0003E8, "Member 'UAthenaGiftingConfirmationScreen::PresentedGiftableOfferInfo' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingConfirmationScreen, PresentedOptionalTokenOfferInfo) == 0x0003F0, "Member 'UAthenaGiftingConfirmationScreen::PresentedOptionalTokenOfferInfo' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingConfirmationScreen, MinGiftSubmissionDelay) == 0x0004B4, "Member 'UAthenaGiftingConfirmationScreen::MinGiftSubmissionDelay' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingConfirmationScreen, MaxGiftSubmissionDelay) == 0x0004B8, "Member 'UAthenaGiftingConfirmationScreen::MaxGiftSubmissionDelay' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingConfirmationScreen, Button_WrapOptions) == 0x0004D0, "Member 'UAthenaGiftingConfirmationScreen::Button_WrapOptions' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingConfirmationScreen, Button_Back) == 0x0004D8, "Member 'UAthenaGiftingConfirmationScreen::Button_Back' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingConfirmationScreen, Button_MobileClose) == 0x0004E0, "Member 'UAthenaGiftingConfirmationScreen::Button_MobileClose' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingConfirmationScreen, Button_MtxWallet) == 0x0004E8, "Member 'UAthenaGiftingConfirmationScreen::Button_MtxWallet' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingConfirmationScreen, Panel_GiftingPurchase) == 0x0004F0, "Member 'UAthenaGiftingConfirmationScreen::Panel_GiftingPurchase' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingConfirmationScreen, Panel_WrapOptions) == 0x0004F8, "Member 'UAthenaGiftingConfirmationScreen::Panel_WrapOptions' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingConfirmationScreen, Panel_GiftConfirmed) == 0x000500, "Member 'UAthenaGiftingConfirmationScreen::Panel_GiftConfirmed' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingConfirmationScreen, Panel_GiftingErrors) == 0x000508, "Member 'UAthenaGiftingConfirmationScreen::Panel_GiftingErrors' has a wrong offset!");

// Class GiftingUI.AthenaGiftingErrorsPanel
// 0x0060 (0x0418 - 0x03B8)
class UAthenaGiftingErrorsPanel final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3B8[0x30];                                     // 0x03B8(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class URichTextBlock*                         Text_RecipientInfo;                                // 0x03E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URichTextBlock*                         Text_Title;                                        // 0x03F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_MobileClose;                                // 0x03F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_Back;                                       // 0x0400(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_Continue;                                   // 0x0408(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTileView*                              TileView_Items;                                    // 0x0410(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void UpdateGiftEligibility(bool bStillGiftable);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftingErrorsPanel">();
	}
	static class UAthenaGiftingErrorsPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftingErrorsPanel>();
	}
};
static_assert(alignof(UAthenaGiftingErrorsPanel) == 0x000008, "Wrong alignment on UAthenaGiftingErrorsPanel");
static_assert(sizeof(UAthenaGiftingErrorsPanel) == 0x000418, "Wrong size on UAthenaGiftingErrorsPanel");
static_assert(offsetof(UAthenaGiftingErrorsPanel, Text_RecipientInfo) == 0x0003E8, "Member 'UAthenaGiftingErrorsPanel::Text_RecipientInfo' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingErrorsPanel, Text_Title) == 0x0003F0, "Member 'UAthenaGiftingErrorsPanel::Text_Title' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingErrorsPanel, Button_MobileClose) == 0x0003F8, "Member 'UAthenaGiftingErrorsPanel::Button_MobileClose' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingErrorsPanel, Button_Back) == 0x000400, "Member 'UAthenaGiftingErrorsPanel::Button_Back' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingErrorsPanel, Button_Continue) == 0x000408, "Member 'UAthenaGiftingErrorsPanel::Button_Continue' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingErrorsPanel, TileView_Items) == 0x000410, "Member 'UAthenaGiftingErrorsPanel::TileView_Items' has a wrong offset!");

// Class GiftingUI.AthenaGiftingPriceWidget
// 0x0020 (0x02C0 - 0x02A0)
class UAthenaGiftingPriceWidget final : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                       Text_RealMoneyPrice;                               // 0x02A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_FinalPrice;                                   // 0x02A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_RegularPrice;                                 // 0x02B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Overlay_SalePrice;                                 // 0x02B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetPresentationMode(EGiftingPricePresentationMode Mode);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftingPriceWidget">();
	}
	static class UAthenaGiftingPriceWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftingPriceWidget>();
	}
};
static_assert(alignof(UAthenaGiftingPriceWidget) == 0x000008, "Wrong alignment on UAthenaGiftingPriceWidget");
static_assert(sizeof(UAthenaGiftingPriceWidget) == 0x0002C0, "Wrong size on UAthenaGiftingPriceWidget");
static_assert(offsetof(UAthenaGiftingPriceWidget, Text_RealMoneyPrice) == 0x0002A0, "Member 'UAthenaGiftingPriceWidget::Text_RealMoneyPrice' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingPriceWidget, Text_FinalPrice) == 0x0002A8, "Member 'UAthenaGiftingPriceWidget::Text_FinalPrice' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingPriceWidget, Text_RegularPrice) == 0x0002B0, "Member 'UAthenaGiftingPriceWidget::Text_RegularPrice' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingPriceWidget, Overlay_SalePrice) == 0x0002B8, "Member 'UAthenaGiftingPriceWidget::Overlay_SalePrice' has a wrong offset!");

// Class GiftingUI.AthenaGiftingPurchaseButton
// 0x0010 (0x1000 - 0x0FF0)
class UAthenaGiftingPurchaseButton final : public UCommonButtonLegacy
{
public:
	class UAthenaGiftingPriceWidget*              Widget_Price;                                      // 0x0FE8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_Title;                                        // 0x0FF0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_FF8[0x8];                                      // 0x0FF8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftingPurchaseButton">();
	}
	static class UAthenaGiftingPurchaseButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftingPurchaseButton>();
	}
};
static_assert(alignof(UAthenaGiftingPurchaseButton) == 0x000010, "Wrong alignment on UAthenaGiftingPurchaseButton");
static_assert(sizeof(UAthenaGiftingPurchaseButton) == 0x001000, "Wrong size on UAthenaGiftingPurchaseButton");
static_assert(offsetof(UAthenaGiftingPurchaseButton, Widget_Price) == 0x000FE8, "Member 'UAthenaGiftingPurchaseButton::Widget_Price' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingPurchaseButton, Text_Title) == 0x000FF0, "Member 'UAthenaGiftingPurchaseButton::Text_Title' has a wrong offset!");

// Class GiftingUI.AthenaGiftingPurchasePanel
// 0x0048 (0x0400 - 0x03B8)
class UAthenaGiftingPurchasePanel final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3B8[0x18];                                     // 0x03B8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaGiftingPurchaseButton*           Button_PurchaseGift;                               // 0x03D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortSocialAvatarIcon*                  Avatar_MemberIcon;                                 // 0x03D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_SocialNameInfo;                               // 0x03E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ItemsCount;                                   // 0x03E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_OfferName;                                    // 0x03F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTileView*                              TileView_Items;                                    // 0x03F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void PlayIntroAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftingPurchasePanel">();
	}
	static class UAthenaGiftingPurchasePanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftingPurchasePanel>();
	}
};
static_assert(alignof(UAthenaGiftingPurchasePanel) == 0x000008, "Wrong alignment on UAthenaGiftingPurchasePanel");
static_assert(sizeof(UAthenaGiftingPurchasePanel) == 0x000400, "Wrong size on UAthenaGiftingPurchasePanel");
static_assert(offsetof(UAthenaGiftingPurchasePanel, Button_PurchaseGift) == 0x0003D0, "Member 'UAthenaGiftingPurchasePanel::Button_PurchaseGift' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingPurchasePanel, Avatar_MemberIcon) == 0x0003D8, "Member 'UAthenaGiftingPurchasePanel::Avatar_MemberIcon' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingPurchasePanel, Text_SocialNameInfo) == 0x0003E0, "Member 'UAthenaGiftingPurchasePanel::Text_SocialNameInfo' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingPurchasePanel, Text_ItemsCount) == 0x0003E8, "Member 'UAthenaGiftingPurchasePanel::Text_ItemsCount' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingPurchasePanel, Text_OfferName) == 0x0003F0, "Member 'UAthenaGiftingPurchasePanel::Text_OfferName' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingPurchasePanel, TileView_Items) == 0x0003F8, "Member 'UAthenaGiftingPurchasePanel::TileView_Items' has a wrong offset!");

// Class GiftingUI.AthenaGiftingScreen
// 0x01E0 (0x0848 - 0x0668)
class UAthenaGiftingScreen final : public UFortItemPreviewScreen
{
public:
	uint8                                         Pad_668[0x8];                                      // 0x0668(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGiftingUserSearchWidget*           SearchWidget_SocialSearchWidget;                   // 0x0670(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortGiftingSocialUserListView*         ListView_Recipients;                               // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTileView*                              TileView_Items;                                    // 0x0680(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Back;                                       // 0x0688(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_MobileClose;                                // 0x0690(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_GiftingPolicy;                              // 0x0698(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_CameraControl;                              // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_OfferName;                                    // 0x06A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_VBucksOffCount;                               // 0x06B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ShownItemIndex;                               // 0x06B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   Text_NoContent;                                    // 0x06C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_OfferItemOwnedCount;                      // 0x06C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Container_VBucksOffViolator;                       // 0x06D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_GiftCount;                                // 0x06D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaGiftingPriceWidget*              Widget_Price;                                      // 0x06E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaLockerItemInfo*                  Widget_ItemInfo;                                   // 0x06E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                       EntryBox_FilterTabs;                               // 0x06F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonActionWidget*                    ActionWidget_FilterTabsPrevious;                   // 0x06F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonActionWidget*                    ActionWidget_FilterTabsNext;                       // 0x0700(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaGiftingConfirmationScreen*       ActivatableWidget_GiftingConfirmation;             // 0x0708(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ItemCyclingInterval;                               // 0x0710(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_714[0x4];                                      // 0x0714(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    FilterTabsPreviousAction;                          // 0x0718(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    FilterTabsNextAction;                              // 0x0728(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPrivate)
	class FText                                   RegularGiftingPolicy;                              // 0x0738(0x0018)(Edit, NativeAccessSpecifierPrivate)
	class FText                                   BattlePassGiftingPolicy;                           // 0x0750(0x0018)(Edit, NativeAccessSpecifierPrivate)
	uint8                                         Pad_768[0x60];                                     // 0x0768(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UCommonButtonLegacy*, EFilterType> FilterMap;                                         // 0x07C8(0x0050)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class UCommonButtonGroupLegacy*               FilterGroup;                                       // 0x0818(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UFortItemDefinition*>            ItemDefinitions;                                   // 0x0820(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class UFortItemDefinition*                    PresentedItemDefinition;                           // 0x0830(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortStoreFrontOfferInfo*               GiftableOfferInfo;                                 // 0x0838(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortStoreFrontOfferInfo*               OptionalTokenOfferInfo;                            // 0x0840(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnFilterChanged(EFilterType FilterType);
	void OnFriendSelectionChanged();
	void OnPartyListUpdated(bool bEmpty);
	void OnPresentationModeChanged(EGiftingScreenPresentationMode Mode);
	void OnSetupFilterTabButton(class UCommonButtonLegacy* Button, EFilterType FilterType);
	void OnShownItemChanged();
	void OnShowSearchWarningText(bool bShow);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftingScreen">();
	}
	static class UAthenaGiftingScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftingScreen>();
	}
};
static_assert(alignof(UAthenaGiftingScreen) == 0x000008, "Wrong alignment on UAthenaGiftingScreen");
static_assert(sizeof(UAthenaGiftingScreen) == 0x000848, "Wrong size on UAthenaGiftingScreen");
static_assert(offsetof(UAthenaGiftingScreen, SearchWidget_SocialSearchWidget) == 0x000670, "Member 'UAthenaGiftingScreen::SearchWidget_SocialSearchWidget' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, ListView_Recipients) == 0x000678, "Member 'UAthenaGiftingScreen::ListView_Recipients' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, TileView_Items) == 0x000680, "Member 'UAthenaGiftingScreen::TileView_Items' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, Button_Back) == 0x000688, "Member 'UAthenaGiftingScreen::Button_Back' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, Button_MobileClose) == 0x000690, "Member 'UAthenaGiftingScreen::Button_MobileClose' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, Button_GiftingPolicy) == 0x000698, "Member 'UAthenaGiftingScreen::Button_GiftingPolicy' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, Button_CameraControl) == 0x0006A0, "Member 'UAthenaGiftingScreen::Button_CameraControl' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, Text_OfferName) == 0x0006A8, "Member 'UAthenaGiftingScreen::Text_OfferName' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, Text_VBucksOffCount) == 0x0006B0, "Member 'UAthenaGiftingScreen::Text_VBucksOffCount' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, Text_ShownItemIndex) == 0x0006B8, "Member 'UAthenaGiftingScreen::Text_ShownItemIndex' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, Text_NoContent) == 0x0006C0, "Member 'UAthenaGiftingScreen::Text_NoContent' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, RichText_OfferItemOwnedCount) == 0x0006C8, "Member 'UAthenaGiftingScreen::RichText_OfferItemOwnedCount' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, Container_VBucksOffViolator) == 0x0006D0, "Member 'UAthenaGiftingScreen::Container_VBucksOffViolator' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, RichText_GiftCount) == 0x0006D8, "Member 'UAthenaGiftingScreen::RichText_GiftCount' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, Widget_Price) == 0x0006E0, "Member 'UAthenaGiftingScreen::Widget_Price' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, Widget_ItemInfo) == 0x0006E8, "Member 'UAthenaGiftingScreen::Widget_ItemInfo' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, EntryBox_FilterTabs) == 0x0006F0, "Member 'UAthenaGiftingScreen::EntryBox_FilterTabs' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, ActionWidget_FilterTabsPrevious) == 0x0006F8, "Member 'UAthenaGiftingScreen::ActionWidget_FilterTabsPrevious' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, ActionWidget_FilterTabsNext) == 0x000700, "Member 'UAthenaGiftingScreen::ActionWidget_FilterTabsNext' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, ActivatableWidget_GiftingConfirmation) == 0x000708, "Member 'UAthenaGiftingScreen::ActivatableWidget_GiftingConfirmation' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, ItemCyclingInterval) == 0x000710, "Member 'UAthenaGiftingScreen::ItemCyclingInterval' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, FilterTabsPreviousAction) == 0x000718, "Member 'UAthenaGiftingScreen::FilterTabsPreviousAction' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, FilterTabsNextAction) == 0x000728, "Member 'UAthenaGiftingScreen::FilterTabsNextAction' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, RegularGiftingPolicy) == 0x000738, "Member 'UAthenaGiftingScreen::RegularGiftingPolicy' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, BattlePassGiftingPolicy) == 0x000750, "Member 'UAthenaGiftingScreen::BattlePassGiftingPolicy' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, FilterMap) == 0x0007C8, "Member 'UAthenaGiftingScreen::FilterMap' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, FilterGroup) == 0x000818, "Member 'UAthenaGiftingScreen::FilterGroup' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, ItemDefinitions) == 0x000820, "Member 'UAthenaGiftingScreen::ItemDefinitions' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, PresentedItemDefinition) == 0x000830, "Member 'UAthenaGiftingScreen::PresentedItemDefinition' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, GiftableOfferInfo) == 0x000838, "Member 'UAthenaGiftingScreen::GiftableOfferInfo' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, OptionalTokenOfferInfo) == 0x000840, "Member 'UAthenaGiftingScreen::OptionalTokenOfferInfo' has a wrong offset!");

// Class GiftingUI.AthenaGiftingWrapOptionsPanel
// 0x0068 (0x0420 - 0x03B8)
class UAthenaGiftingWrapOptionsPanel final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3B8[0x28];                                     // 0x03B8(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UFortGiftBoxItemDefinition>> GiftBoxes;                              // 0x03E0(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UFortGiftBoxItemDefinition*>     GiftBoxItemDefs;                                   // 0x03F0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_400[0x10];                                     // 0x0400(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    Button_ConfirmWrap;                                // 0x0410(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTileView*                              TileView_WrapOptions;                              // 0x0418(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftingWrapOptionsPanel">();
	}
	static class UAthenaGiftingWrapOptionsPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftingWrapOptionsPanel>();
	}
};
static_assert(alignof(UAthenaGiftingWrapOptionsPanel) == 0x000008, "Wrong alignment on UAthenaGiftingWrapOptionsPanel");
static_assert(sizeof(UAthenaGiftingWrapOptionsPanel) == 0x000420, "Wrong size on UAthenaGiftingWrapOptionsPanel");
static_assert(offsetof(UAthenaGiftingWrapOptionsPanel, GiftBoxes) == 0x0003E0, "Member 'UAthenaGiftingWrapOptionsPanel::GiftBoxes' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingWrapOptionsPanel, GiftBoxItemDefs) == 0x0003F0, "Member 'UAthenaGiftingWrapOptionsPanel::GiftBoxItemDefs' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingWrapOptionsPanel, Button_ConfirmWrap) == 0x000410, "Member 'UAthenaGiftingWrapOptionsPanel::Button_ConfirmWrap' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingWrapOptionsPanel, TileView_WrapOptions) == 0x000418, "Member 'UAthenaGiftingWrapOptionsPanel::TileView_WrapOptions' has a wrong offset!");

// Class GiftingUI.FortGiftingSocialUserListEntry
// 0x00F0 (0x10F0 - 0x1000)
class UFortGiftingSocialUserListEntry final : public USocialListEntryBase
{
public:
	uint8                                         Pad_1000[0xC0];                                    // 0x1000(0x00C0)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSocialAvatarIcon*                  Avatar_MemberIcon;                                 // 0x10C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USocialNameTextBlock*                   Text_SocialName;                                   // 0x10C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_EligibilityStatus;                        // 0x10D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_OwnedItems;                               // 0x10D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaGiftingPriceWidget*              Widget_Price;                                      // 0x10E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_10E8[0x8];                                     // 0x10E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnHighlightedStateChanged(bool bInIsHighlighted, bool bPlayAnimation);
	void BP_OnTouchSelectionConfirmed();
	void OnRecipientStatusUpdated();
	void OnUserItemSet();
	void SetPresentationMode(ERecipientPresentationMode Mode);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGiftingSocialUserListEntry">();
	}
	static class UFortGiftingSocialUserListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGiftingSocialUserListEntry>();
	}
};
static_assert(alignof(UFortGiftingSocialUserListEntry) == 0x000010, "Wrong alignment on UFortGiftingSocialUserListEntry");
static_assert(sizeof(UFortGiftingSocialUserListEntry) == 0x0010F0, "Wrong size on UFortGiftingSocialUserListEntry");
static_assert(offsetof(UFortGiftingSocialUserListEntry, Avatar_MemberIcon) == 0x0010C0, "Member 'UFortGiftingSocialUserListEntry::Avatar_MemberIcon' has a wrong offset!");
static_assert(offsetof(UFortGiftingSocialUserListEntry, Text_SocialName) == 0x0010C8, "Member 'UFortGiftingSocialUserListEntry::Text_SocialName' has a wrong offset!");
static_assert(offsetof(UFortGiftingSocialUserListEntry, RichText_EligibilityStatus) == 0x0010D0, "Member 'UFortGiftingSocialUserListEntry::RichText_EligibilityStatus' has a wrong offset!");
static_assert(offsetof(UFortGiftingSocialUserListEntry, RichText_OwnedItems) == 0x0010D8, "Member 'UFortGiftingSocialUserListEntry::RichText_OwnedItems' has a wrong offset!");
static_assert(offsetof(UFortGiftingSocialUserListEntry, Widget_Price) == 0x0010E0, "Member 'UFortGiftingSocialUserListEntry::Widget_Price' has a wrong offset!");

// Class GiftingUI.FortGiftingSocialUserListView
// 0x00F8 (0x0428 - 0x0330)
class UFortGiftingSocialUserListView final : public USocialUserListViewBase
{
public:
	float                                         RefreshRecipientStatusDelay;                       // 0x0330(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_334[0xF4];                                     // 0x0334(0x00F4)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGiftingSocialUserListView">();
	}
	static class UFortGiftingSocialUserListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGiftingSocialUserListView>();
	}
};
static_assert(alignof(UFortGiftingSocialUserListView) == 0x000008, "Wrong alignment on UFortGiftingSocialUserListView");
static_assert(sizeof(UFortGiftingSocialUserListView) == 0x000428, "Wrong size on UFortGiftingSocialUserListView");
static_assert(offsetof(UFortGiftingSocialUserListView, RefreshRecipientStatusDelay) == 0x000330, "Member 'UFortGiftingSocialUserListView::RefreshRecipientStatusDelay' has a wrong offset!");

// Class GiftingUI.FortGiftingUserSearchWidget
// 0x0048 (0x02E8 - 0x02A0)
class UFortGiftingUserSearchWidget final : public UCommonUserWidget
{
public:
	class UEditableText*                          EditableText_SearchFriends;                        // 0x02A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_ClearQuery;                                 // 0x02A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_SubmitQuery;                                // 0x02B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2B8[0x30];                                     // 0x02B8(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleSearchFriendsTextChanged(const class FText& Text);
	void HandleSearchFriendsTextEntered(const class FText& Text, ETextCommit CommitMethod);
	void OnSearchCommit(bool bSearchStringShort);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGiftingUserSearchWidget">();
	}
	static class UFortGiftingUserSearchWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGiftingUserSearchWidget>();
	}
};
static_assert(alignof(UFortGiftingUserSearchWidget) == 0x000008, "Wrong alignment on UFortGiftingUserSearchWidget");
static_assert(sizeof(UFortGiftingUserSearchWidget) == 0x0002E8, "Wrong size on UFortGiftingUserSearchWidget");
static_assert(offsetof(UFortGiftingUserSearchWidget, EditableText_SearchFriends) == 0x0002A0, "Member 'UFortGiftingUserSearchWidget::EditableText_SearchFriends' has a wrong offset!");
static_assert(offsetof(UFortGiftingUserSearchWidget, Button_ClearQuery) == 0x0002A8, "Member 'UFortGiftingUserSearchWidget::Button_ClearQuery' has a wrong offset!");
static_assert(offsetof(UFortGiftingUserSearchWidget, Button_SubmitQuery) == 0x0002B0, "Member 'UFortGiftingUserSearchWidget::Button_SubmitQuery' has a wrong offset!");

// Class GiftingUI.FortGiftingWrapOptionListEntry
// 0x0010 (0x1000 - 0x0FF0)
class UFortGiftingWrapOptionListEntry final : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_FE8[0x8];                                      // 0x0FE8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGiftBoxItemDefinition*             GiftBoxDefinition;                                 // 0x0FF0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonLazyImage*                       Image_Gift;                                        // 0x0FF8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGiftingWrapOptionListEntry">();
	}
	static class UFortGiftingWrapOptionListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGiftingWrapOptionListEntry>();
	}
};
static_assert(alignof(UFortGiftingWrapOptionListEntry) == 0x000010, "Wrong alignment on UFortGiftingWrapOptionListEntry");
static_assert(sizeof(UFortGiftingWrapOptionListEntry) == 0x001000, "Wrong size on UFortGiftingWrapOptionListEntry");
static_assert(offsetof(UFortGiftingWrapOptionListEntry, GiftBoxDefinition) == 0x000FF0, "Member 'UFortGiftingWrapOptionListEntry::GiftBoxDefinition' has a wrong offset!");
static_assert(offsetof(UFortGiftingWrapOptionListEntry, Image_Gift) == 0x000FF8, "Member 'UFortGiftingWrapOptionListEntry::Image_Gift' has a wrong offset!");

// Class GiftingUI.FortGiftingData
// 0x0028 (0x0508 - 0x04E0)
class UFortGiftingData final : public UFortGameFeatureData
{
public:
	TSoftClassPtr<class UClass>                   GiftingScreenClass;                                // 0x04E0(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGiftingData">();
	}
	static class UFortGiftingData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGiftingData>();
	}
};
static_assert(alignof(UFortGiftingData) == 0x000008, "Wrong alignment on UFortGiftingData");
static_assert(sizeof(UFortGiftingData) == 0x000508, "Wrong size on UFortGiftingData");
static_assert(offsetof(UFortGiftingData, GiftingScreenClass) == 0x0004E0, "Member 'UFortGiftingData::GiftingScreenClass' has a wrong offset!");

}

