#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HousepartyWelcomeToast

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HousepartyWelcomeToast.HousepartyWelcomeToast_C
// 0x0030 (0x02E0 - 0x02B0)
class UHousepartyWelcomeToast_C final : public UFortToastWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image;                                             // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_97;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_343;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_StreamGameToFriends;                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_HousepartyWelcomeToast(int32 EntryPoint);
	void OnInitialized();
	void OnSetToast(class UFortUINotification* ToastNotification);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HousepartyWelcomeToast_C">();
	}
	static class UHousepartyWelcomeToast_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHousepartyWelcomeToast_C>();
	}
};
static_assert(alignof(UHousepartyWelcomeToast_C) == 0x000008, "Wrong alignment on UHousepartyWelcomeToast_C");
static_assert(sizeof(UHousepartyWelcomeToast_C) == 0x0002E0, "Wrong size on UHousepartyWelcomeToast_C");
static_assert(offsetof(UHousepartyWelcomeToast_C, UberGraphFrame) == 0x0002B0, "Member 'UHousepartyWelcomeToast_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHousepartyWelcomeToast_C, Image) == 0x0002B8, "Member 'UHousepartyWelcomeToast_C::Image' has a wrong offset!");
static_assert(offsetof(UHousepartyWelcomeToast_C, Image_1) == 0x0002C0, "Member 'UHousepartyWelcomeToast_C::Image_1' has a wrong offset!");
static_assert(offsetof(UHousepartyWelcomeToast_C, Image_97) == 0x0002C8, "Member 'UHousepartyWelcomeToast_C::Image_97' has a wrong offset!");
static_assert(offsetof(UHousepartyWelcomeToast_C, Image_343) == 0x0002D0, "Member 'UHousepartyWelcomeToast_C::Image_343' has a wrong offset!");
static_assert(offsetof(UHousepartyWelcomeToast_C, Text_StreamGameToFriends) == 0x0002D8, "Member 'UHousepartyWelcomeToast_C::Text_StreamGameToFriends' has a wrong offset!");

}

