#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HousepartyMicToast

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HousepartyMicToast.HousepartyMicToast_C
// 0x0058 (0x0308 - 0x02B0)
class UHousepartyMicToast_C final : public UFortToastWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_SimplePopup;                                  // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 NotificationImage;                                 // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Description;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Title;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   M_Param_ColorA;                                    // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   M_Param_ColorB;                                    // 0x02DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   M_Param_Progress;                                  // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ColorB;                                            // 0x02E4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ColorA;                                            // 0x02F4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CollapseOnAnimationFinish;                         // 0x0304(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_HousepartyMicToast(int32 EntryPoint);
	void OnPlayCloseAnimation();
	void OnPlayOpenAnimation();
	void OnSetToast(class UFortUINotification* ToastNotification);
	void Popup_Animation_Finished();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HousepartyMicToast_C">();
	}
	static class UHousepartyMicToast_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHousepartyMicToast_C>();
	}
};
static_assert(alignof(UHousepartyMicToast_C) == 0x000008, "Wrong alignment on UHousepartyMicToast_C");
static_assert(sizeof(UHousepartyMicToast_C) == 0x000308, "Wrong size on UHousepartyMicToast_C");
static_assert(offsetof(UHousepartyMicToast_C, UberGraphFrame) == 0x0002B0, "Member 'UHousepartyMicToast_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHousepartyMicToast_C, Anim_SimplePopup) == 0x0002B8, "Member 'UHousepartyMicToast_C::Anim_SimplePopup' has a wrong offset!");
static_assert(offsetof(UHousepartyMicToast_C, NotificationImage) == 0x0002C0, "Member 'UHousepartyMicToast_C::NotificationImage' has a wrong offset!");
static_assert(offsetof(UHousepartyMicToast_C, Text_Description) == 0x0002C8, "Member 'UHousepartyMicToast_C::Text_Description' has a wrong offset!");
static_assert(offsetof(UHousepartyMicToast_C, Text_Title) == 0x0002D0, "Member 'UHousepartyMicToast_C::Text_Title' has a wrong offset!");
static_assert(offsetof(UHousepartyMicToast_C, M_Param_ColorA) == 0x0002D8, "Member 'UHousepartyMicToast_C::M_Param_ColorA' has a wrong offset!");
static_assert(offsetof(UHousepartyMicToast_C, M_Param_ColorB) == 0x0002DC, "Member 'UHousepartyMicToast_C::M_Param_ColorB' has a wrong offset!");
static_assert(offsetof(UHousepartyMicToast_C, M_Param_Progress) == 0x0002E0, "Member 'UHousepartyMicToast_C::M_Param_Progress' has a wrong offset!");
static_assert(offsetof(UHousepartyMicToast_C, ColorB) == 0x0002E4, "Member 'UHousepartyMicToast_C::ColorB' has a wrong offset!");
static_assert(offsetof(UHousepartyMicToast_C, ColorA) == 0x0002F4, "Member 'UHousepartyMicToast_C::ColorA' has a wrong offset!");
static_assert(offsetof(UHousepartyMicToast_C, CollapseOnAnimationFinish) == 0x000304, "Member 'UHousepartyMicToast_C::CollapseOnAnimationFinish' has a wrong offset!");

}

