#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemShopPipButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemShopPipButton.ItemShopPipButton_C
// 0x0030 (0x10B0 - 0x1080)
class UItemShopPipButton_C final : public UFortTextButton
{
public:
	uint8                                         Pad_1078[0x8];                                     // 0x1078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1080(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x1088(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x1090(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BacchusMobileShadow;                               // 0x1098(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PIP;                                               // 0x10A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnDeselected();
	void BP_OnSelected();
	void Construct();
	void ExecuteUbergraph_ItemShopPipButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemShopPipButton_C">();
	}
	static class UItemShopPipButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemShopPipButton_C>();
	}
};
static_assert(alignof(UItemShopPipButton_C) == 0x000010, "Wrong alignment on UItemShopPipButton_C");
static_assert(sizeof(UItemShopPipButton_C) == 0x0010B0, "Wrong size on UItemShopPipButton_C");
static_assert(offsetof(UItemShopPipButton_C, UberGraphFrame) == 0x001080, "Member 'UItemShopPipButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemShopPipButton_C, Hover) == 0x001088, "Member 'UItemShopPipButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UItemShopPipButton_C, Selected) == 0x001090, "Member 'UItemShopPipButton_C::Selected' has a wrong offset!");
static_assert(offsetof(UItemShopPipButton_C, BacchusMobileShadow) == 0x001098, "Member 'UItemShopPipButton_C::BacchusMobileShadow' has a wrong offset!");
static_assert(offsetof(UItemShopPipButton_C, PIP) == 0x0010A0, "Member 'UItemShopPipButton_C::PIP' has a wrong offset!");

}

