#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KoalaHUDWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "KoalaUI_structs.hpp"
#include "KoalaUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass KoalaHUDWidget.KoalaHUDWidget_C
// 0x0140 (0x05C0 - 0x0480)
class UKoalaHUDWidget_C final : public UKoalaHUDWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CapturedStateSpin;                                 // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowTriangles;                                     // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       StartFromCreating;                                 // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CreatingToUploading;                               // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CreatingFromReminder;                              // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TextUpdate;                                        // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SuccessAnim;                                       // 0x04B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Outro;                                             // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          Border_Background;                                 // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BottomRimShine;                                    // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CapturedState;                                     // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CapturedState_Inner;                               // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_TouchArea;                            // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ContentOverlay;                                    // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FlashIntro;                                        // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortHUDElementWrapper_C*               FortHUDElementWrapper;                             // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Failure;                                     // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Glow;                                        // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PostpartyLogo;                               // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Spark;                                       // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Spark_1;                                     // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Success;                                     // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageTriangleR;                                    // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Captured;                                  // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_ClipAction;                                // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Success;                                   // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_Reminder;                              // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonAnimatedSwitcher*                RightsideSwitcher;                                 // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ClipStatus;                                   // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopRimShine;                                       // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           ReminderTimerHandle;                               // 0x0580(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         ReminderTime;                                      // 0x0588(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ElapsedReminderTime;                               // 0x058C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           FadeoutTimerHandle;                                // 0x0590(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   DefaultStatusText;                                 // 0x0598(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	EKoalaClipStatus                              CurrentWidgetStatus;                               // 0x05B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowing;                                          // 0x05B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKoalaClipStatus                              TestWidgetStatus;                                  // 0x05B2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPlayingIntro;                                     // 0x05B3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowingReminderState;                             // 0x05B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowingCreatedSequence;                           // 0x05B5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVar_0;                                          // 0x05B6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B7[0x1];                                      // 0x05B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         In_Clip_ID;                                        // 0x05B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AdjustForSafeFrame();
	void BP_OnActivated();
	void Construct();
	void DelayedFadeout(float Delay);
	void ExecuteUbergraph_KoalaHUDWidget(int32 EntryPoint);
	void FadeOut();
	void Finished_158152154EE67EEBA4C9129C4E90DE14();
	void Finished_2DFE13D84392EF528498D49C068A1D80();
	struct FEventReply On_CommonBorder_TouchArea_MouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnAvailabilityChanged(EKoalaAvailability Availability);
	void OnClipStatusChanged(int32 InClipID, EKoalaClipStatus InClipStatus, float InUploadProgress);
	void OnConnectionChanged(EKoalaConnectionStatus InStatus);
	void OnCreateClipComplete(bool bSuccess);
	void OnInputComplete();
	void OnInputProgress(float Progress);
	void OnRecordingStatusChanged(EKoalaRecording InRecordingStatus);
	void OnReminderTimerStarted(float Time);
	void PlayIntro(bool bQuickIntro);
	void PlayOutro();
	void PreConstruct(bool IsDesignTime);
	void ResetReminderProgress();
	void SequenceEvent__ENTRYPOINTKoalaHUDWidget_0();
	void SetNotificationVisuals(int32 InClipID);
	void ShouldBlockUpdate(EKoalaClipStatus NewState, bool* BlockUpdate);
	void StopCapturedStateSpin();
	void TimerTick();
	void TriggerCapturedStateSpin();
	void UpdateState(EKoalaClipStatus NewState);
	void UpdateText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"KoalaHUDWidget_C">();
	}
	static class UKoalaHUDWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKoalaHUDWidget_C>();
	}
};
static_assert(alignof(UKoalaHUDWidget_C) == 0x000008, "Wrong alignment on UKoalaHUDWidget_C");
static_assert(sizeof(UKoalaHUDWidget_C) == 0x0005C0, "Wrong size on UKoalaHUDWidget_C");
static_assert(offsetof(UKoalaHUDWidget_C, UberGraphFrame) == 0x000480, "Member 'UKoalaHUDWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, CapturedStateSpin) == 0x000488, "Member 'UKoalaHUDWidget_C::CapturedStateSpin' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, ShowTriangles) == 0x000490, "Member 'UKoalaHUDWidget_C::ShowTriangles' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, StartFromCreating) == 0x000498, "Member 'UKoalaHUDWidget_C::StartFromCreating' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, CreatingToUploading) == 0x0004A0, "Member 'UKoalaHUDWidget_C::CreatingToUploading' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, CreatingFromReminder) == 0x0004A8, "Member 'UKoalaHUDWidget_C::CreatingFromReminder' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, TextUpdate) == 0x0004B0, "Member 'UKoalaHUDWidget_C::TextUpdate' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, SuccessAnim) == 0x0004B8, "Member 'UKoalaHUDWidget_C::SuccessAnim' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, Outro) == 0x0004C0, "Member 'UKoalaHUDWidget_C::Outro' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, Intro) == 0x0004C8, "Member 'UKoalaHUDWidget_C::Intro' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, Border_Background) == 0x0004D0, "Member 'UKoalaHUDWidget_C::Border_Background' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, BottomRimShine) == 0x0004D8, "Member 'UKoalaHUDWidget_C::BottomRimShine' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, CapturedState) == 0x0004E0, "Member 'UKoalaHUDWidget_C::CapturedState' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, CapturedState_Inner) == 0x0004E8, "Member 'UKoalaHUDWidget_C::CapturedState_Inner' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, CommonBorder_TouchArea) == 0x0004F0, "Member 'UKoalaHUDWidget_C::CommonBorder_TouchArea' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, ContentOverlay) == 0x0004F8, "Member 'UKoalaHUDWidget_C::ContentOverlay' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, FlashIntro) == 0x000500, "Member 'UKoalaHUDWidget_C::FlashIntro' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, FortHUDElementWrapper) == 0x000508, "Member 'UKoalaHUDWidget_C::FortHUDElementWrapper' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, Image_Failure) == 0x000510, "Member 'UKoalaHUDWidget_C::Image_Failure' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, Image_Glow) == 0x000518, "Member 'UKoalaHUDWidget_C::Image_Glow' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, Image_PostpartyLogo) == 0x000520, "Member 'UKoalaHUDWidget_C::Image_PostpartyLogo' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, Image_Spark) == 0x000528, "Member 'UKoalaHUDWidget_C::Image_Spark' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, Image_Spark_1) == 0x000530, "Member 'UKoalaHUDWidget_C::Image_Spark_1' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, Image_Success) == 0x000538, "Member 'UKoalaHUDWidget_C::Image_Success' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, ImageTriangleR) == 0x000540, "Member 'UKoalaHUDWidget_C::ImageTriangleR' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, Overlay_Captured) == 0x000548, "Member 'UKoalaHUDWidget_C::Overlay_Captured' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, Overlay_ClipAction) == 0x000550, "Member 'UKoalaHUDWidget_C::Overlay_ClipAction' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, Overlay_Success) == 0x000558, "Member 'UKoalaHUDWidget_C::Overlay_Success' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, ProgressBar_Reminder) == 0x000560, "Member 'UKoalaHUDWidget_C::ProgressBar_Reminder' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, RightsideSwitcher) == 0x000568, "Member 'UKoalaHUDWidget_C::RightsideSwitcher' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, Text_ClipStatus) == 0x000570, "Member 'UKoalaHUDWidget_C::Text_ClipStatus' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, TopRimShine) == 0x000578, "Member 'UKoalaHUDWidget_C::TopRimShine' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, ReminderTimerHandle) == 0x000580, "Member 'UKoalaHUDWidget_C::ReminderTimerHandle' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, ReminderTime) == 0x000588, "Member 'UKoalaHUDWidget_C::ReminderTime' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, ElapsedReminderTime) == 0x00058C, "Member 'UKoalaHUDWidget_C::ElapsedReminderTime' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, FadeoutTimerHandle) == 0x000590, "Member 'UKoalaHUDWidget_C::FadeoutTimerHandle' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, DefaultStatusText) == 0x000598, "Member 'UKoalaHUDWidget_C::DefaultStatusText' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, CurrentWidgetStatus) == 0x0005B0, "Member 'UKoalaHUDWidget_C::CurrentWidgetStatus' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, bShowing) == 0x0005B1, "Member 'UKoalaHUDWidget_C::bShowing' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, TestWidgetStatus) == 0x0005B2, "Member 'UKoalaHUDWidget_C::TestWidgetStatus' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, bPlayingIntro) == 0x0005B3, "Member 'UKoalaHUDWidget_C::bPlayingIntro' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, bShowingReminderState) == 0x0005B4, "Member 'UKoalaHUDWidget_C::bShowingReminderState' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, bShowingCreatedSequence) == 0x0005B5, "Member 'UKoalaHUDWidget_C::bShowingCreatedSequence' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, NewVar_0) == 0x0005B6, "Member 'UKoalaHUDWidget_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget_C, In_Clip_ID) == 0x0005B8, "Member 'UKoalaHUDWidget_C::In_Clip_ID' has a wrong offset!");

}

