#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mechanical_Engineer_Female_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Mechanical_Engineer_Female_AnimBP.Mechanical_Engineer_Female_AnimBP_C
// 0x1120 (0x17A0 - 0x0680)
class UMechanical_Engineer_Female_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0680(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0688(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0690(0x0008)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0698(0x00C0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0758(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0778(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0798(0x0020)()
	uint8                                         Pad_7B8[0x8];                                      // 0x07B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x07C0(0x0510)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x0CD0(0x0980)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x1650(0x0128)()
	struct FRotator                               gear_rot;                                          // 0x1778(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class USkeletalMeshComponent*                 skel_mesh;                                         // 0x1790(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_Mechanical_Engineer_Female_AnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void BlueprintInitializeAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mechanical_Engineer_Female_AnimBP_C">();
	}
	static class UMechanical_Engineer_Female_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMechanical_Engineer_Female_AnimBP_C>();
	}
};
static_assert(alignof(UMechanical_Engineer_Female_AnimBP_C) == 0x000010, "Wrong alignment on UMechanical_Engineer_Female_AnimBP_C");
static_assert(sizeof(UMechanical_Engineer_Female_AnimBP_C) == 0x0017A0, "Wrong size on UMechanical_Engineer_Female_AnimBP_C");
static_assert(offsetof(UMechanical_Engineer_Female_AnimBP_C, UberGraphFrame) == 0x000680, "Member 'UMechanical_Engineer_Female_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMechanical_Engineer_Female_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000688, "Member 'UMechanical_Engineer_Female_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UMechanical_Engineer_Female_AnimBP_C, AnimBlueprintExtension_Base) == 0x000690, "Member 'UMechanical_Engineer_Female_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UMechanical_Engineer_Female_AnimBP_C, AnimGraphNode_LinkedInputPose) == 0x000698, "Member 'UMechanical_Engineer_Female_AnimBP_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UMechanical_Engineer_Female_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000758, "Member 'UMechanical_Engineer_Female_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UMechanical_Engineer_Female_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000778, "Member 'UMechanical_Engineer_Female_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UMechanical_Engineer_Female_AnimBP_C, AnimGraphNode_Root) == 0x000798, "Member 'UMechanical_Engineer_Female_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UMechanical_Engineer_Female_AnimBP_C, AnimGraphNode_AnimDynamics) == 0x0007C0, "Member 'UMechanical_Engineer_Female_AnimBP_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UMechanical_Engineer_Female_AnimBP_C, AnimGraphNode_RigidBody) == 0x000CD0, "Member 'UMechanical_Engineer_Female_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UMechanical_Engineer_Female_AnimBP_C, AnimGraphNode_ModifyBone) == 0x001650, "Member 'UMechanical_Engineer_Female_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UMechanical_Engineer_Female_AnimBP_C, gear_rot) == 0x001778, "Member 'UMechanical_Engineer_Female_AnimBP_C::gear_rot' has a wrong offset!");
static_assert(offsetof(UMechanical_Engineer_Female_AnimBP_C, skel_mesh) == 0x001790, "Member 'UMechanical_Engineer_Female_AnimBP_C::skel_mesh' has a wrong offset!");

}

