#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MTXButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MTXButton.MTXButton_C
// 0x0040 (0x1030 - 0x0FF0)
class UMTXButton_C final : public UFortMTXButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0FF0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover_Grow;                                        // 0x0FF8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover_Bounce;                                      // 0x1000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x1008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                AmountColor;                                       // 0x1010(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ButtonBacking;                                     // 0x1018(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Vbucks;                                      // 0x1020(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               VariableSize;                                      // 0x1028(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MTXButton(int32 EntryPoint);
	void Construct();
	void BP_OnUnhovered();
	void BP_OnHovered();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MTXButton_C">();
	}
	static class UMTXButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMTXButton_C>();
	}
};
static_assert(alignof(UMTXButton_C) == 0x000010, "Wrong alignment on UMTXButton_C");
static_assert(sizeof(UMTXButton_C) == 0x001030, "Wrong size on UMTXButton_C");
static_assert(offsetof(UMTXButton_C, UberGraphFrame) == 0x000FF0, "Member 'UMTXButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMTXButton_C, Hover_Grow) == 0x000FF8, "Member 'UMTXButton_C::Hover_Grow' has a wrong offset!");
static_assert(offsetof(UMTXButton_C, Hover_Bounce) == 0x001000, "Member 'UMTXButton_C::Hover_Bounce' has a wrong offset!");
static_assert(offsetof(UMTXButton_C, Hover) == 0x001008, "Member 'UMTXButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UMTXButton_C, AmountColor) == 0x001010, "Member 'UMTXButton_C::AmountColor' has a wrong offset!");
static_assert(offsetof(UMTXButton_C, ButtonBacking) == 0x001018, "Member 'UMTXButton_C::ButtonBacking' has a wrong offset!");
static_assert(offsetof(UMTXButton_C, Image_Vbucks) == 0x001020, "Member 'UMTXButton_C::Image_Vbucks' has a wrong offset!");
static_assert(offsetof(UMTXButton_C, VariableSize) == 0x001028, "Member 'UMTXButton_C::VariableSize' has a wrong offset!");

}

