#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NevadaRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "NevadaRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// Class NevadaRuntime.FortCameraMode_Nevada
// 0x0070 (0x1260 - 0x11F0)
class UFortCameraMode_Nevada final : public UFortCameraMode_AthenaVehicle
{
public:
	uint8                                         Pad_11F0[0x28];                                    // 0x11F0(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                TractorBeamCameraOffset;                           // 0x1218(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         TractorBeamCameraLerpTime;                         // 0x1230(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         TractorBeamCameraExtraPitch;                       // 0x1234(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         TractorBeamInactiveCameraExtraPitch;               // 0x1238(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         TractorBeamCameraPositionResetDelay;               // 0x123C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MinPitchForOffset;                                 // 0x1240(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MaxPitchForOffset;                                 // 0x1244(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                ExtraOffset;                                       // 0x1248(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCameraMode_Nevada">();
	}
	static class UFortCameraMode_Nevada* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCameraMode_Nevada>();
	}
};
static_assert(alignof(UFortCameraMode_Nevada) == 0x000010, "Wrong alignment on UFortCameraMode_Nevada");
static_assert(sizeof(UFortCameraMode_Nevada) == 0x001260, "Wrong size on UFortCameraMode_Nevada");
static_assert(offsetof(UFortCameraMode_Nevada, TractorBeamCameraOffset) == 0x001218, "Member 'UFortCameraMode_Nevada::TractorBeamCameraOffset' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Nevada, TractorBeamCameraLerpTime) == 0x001230, "Member 'UFortCameraMode_Nevada::TractorBeamCameraLerpTime' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Nevada, TractorBeamCameraExtraPitch) == 0x001234, "Member 'UFortCameraMode_Nevada::TractorBeamCameraExtraPitch' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Nevada, TractorBeamInactiveCameraExtraPitch) == 0x001238, "Member 'UFortCameraMode_Nevada::TractorBeamInactiveCameraExtraPitch' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Nevada, TractorBeamCameraPositionResetDelay) == 0x00123C, "Member 'UFortCameraMode_Nevada::TractorBeamCameraPositionResetDelay' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Nevada, MinPitchForOffset) == 0x001240, "Member 'UFortCameraMode_Nevada::MinPitchForOffset' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Nevada, MaxPitchForOffset) == 0x001244, "Member 'UFortCameraMode_Nevada::MaxPitchForOffset' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Nevada, ExtraOffset) == 0x001248, "Member 'UFortCameraMode_Nevada::ExtraOffset' has a wrong offset!");

// Class NevadaRuntime.FortNevadaAudioController
// 0x00C8 (0x0338 - 0x0270)
class AFortNevadaAudioController final : public AActor
{
public:
	struct FVector2D                              SpeedRangeMap;                                     // 0x0270(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              TurningRangeMap;                                   // 0x0280(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              AcceleratingRangeMap;                              // 0x0290(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              BrakingRangeMap;                                   // 0x02A0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              PassByRangeMap;                                    // 0x02B0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              LFORangeMap;                                       // 0x02C0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortNevadaVehicle*                     Vehicle;                                           // 0x02D0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortLayeredAudioComponent*             LayeredAudioComponent;                             // 0x02D8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SpeedParamValue;                                   // 0x02E0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SpeedParamValuePrev;                               // 0x02E4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AcceleratingParamValue;                            // 0x02E8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BrakingParamValue;                                 // 0x02EC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                ForwardVector;                                     // 0x02F0(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                ForwardVectorPrev;                                 // 0x0308(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TurningParamValue;                                 // 0x0320(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PassByParamValue;                                  // 0x0324(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LocallyControlledParamValue;                       // 0x0328(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LFOParamValue;                                     // 0x032C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_330[0x8];                                      // 0x0330(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_Init();
	void BP_Update();
	void CacheReferences(class UFortLayeredAudioComponent* InLayeredAudioComponent);
	void Init(class AFortNevadaVehicle* InVehicle);
	void Update();

	class AFortNevadaVehicle* GetVehicleActor() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortNevadaAudioController">();
	}
	static class AFortNevadaAudioController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortNevadaAudioController>();
	}
};
static_assert(alignof(AFortNevadaAudioController) == 0x000008, "Wrong alignment on AFortNevadaAudioController");
static_assert(sizeof(AFortNevadaAudioController) == 0x000338, "Wrong size on AFortNevadaAudioController");
static_assert(offsetof(AFortNevadaAudioController, SpeedRangeMap) == 0x000270, "Member 'AFortNevadaAudioController::SpeedRangeMap' has a wrong offset!");
static_assert(offsetof(AFortNevadaAudioController, TurningRangeMap) == 0x000280, "Member 'AFortNevadaAudioController::TurningRangeMap' has a wrong offset!");
static_assert(offsetof(AFortNevadaAudioController, AcceleratingRangeMap) == 0x000290, "Member 'AFortNevadaAudioController::AcceleratingRangeMap' has a wrong offset!");
static_assert(offsetof(AFortNevadaAudioController, BrakingRangeMap) == 0x0002A0, "Member 'AFortNevadaAudioController::BrakingRangeMap' has a wrong offset!");
static_assert(offsetof(AFortNevadaAudioController, PassByRangeMap) == 0x0002B0, "Member 'AFortNevadaAudioController::PassByRangeMap' has a wrong offset!");
static_assert(offsetof(AFortNevadaAudioController, LFORangeMap) == 0x0002C0, "Member 'AFortNevadaAudioController::LFORangeMap' has a wrong offset!");
static_assert(offsetof(AFortNevadaAudioController, Vehicle) == 0x0002D0, "Member 'AFortNevadaAudioController::Vehicle' has a wrong offset!");
static_assert(offsetof(AFortNevadaAudioController, LayeredAudioComponent) == 0x0002D8, "Member 'AFortNevadaAudioController::LayeredAudioComponent' has a wrong offset!");
static_assert(offsetof(AFortNevadaAudioController, SpeedParamValue) == 0x0002E0, "Member 'AFortNevadaAudioController::SpeedParamValue' has a wrong offset!");
static_assert(offsetof(AFortNevadaAudioController, SpeedParamValuePrev) == 0x0002E4, "Member 'AFortNevadaAudioController::SpeedParamValuePrev' has a wrong offset!");
static_assert(offsetof(AFortNevadaAudioController, AcceleratingParamValue) == 0x0002E8, "Member 'AFortNevadaAudioController::AcceleratingParamValue' has a wrong offset!");
static_assert(offsetof(AFortNevadaAudioController, BrakingParamValue) == 0x0002EC, "Member 'AFortNevadaAudioController::BrakingParamValue' has a wrong offset!");
static_assert(offsetof(AFortNevadaAudioController, ForwardVector) == 0x0002F0, "Member 'AFortNevadaAudioController::ForwardVector' has a wrong offset!");
static_assert(offsetof(AFortNevadaAudioController, ForwardVectorPrev) == 0x000308, "Member 'AFortNevadaAudioController::ForwardVectorPrev' has a wrong offset!");
static_assert(offsetof(AFortNevadaAudioController, TurningParamValue) == 0x000320, "Member 'AFortNevadaAudioController::TurningParamValue' has a wrong offset!");
static_assert(offsetof(AFortNevadaAudioController, PassByParamValue) == 0x000324, "Member 'AFortNevadaAudioController::PassByParamValue' has a wrong offset!");
static_assert(offsetof(AFortNevadaAudioController, LocallyControlledParamValue) == 0x000328, "Member 'AFortNevadaAudioController::LocallyControlledParamValue' has a wrong offset!");
static_assert(offsetof(AFortNevadaAudioController, LFOParamValue) == 0x00032C, "Member 'AFortNevadaAudioController::LFOParamValue' has a wrong offset!");

// Class NevadaRuntime.FortNevadaVehicle
// 0x0600 (0x1EE0 - 0x18E0)
class AFortNevadaVehicle final : public AFortAthenaSKVehicle
{
public:
	struct FNevadaState                           ServerReplicatedState;                             // 0x18D8(0x0014)(Net, Transient, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_18EC[0x4];                                     // 0x18EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortNevadaVehicleConfigs*              FortNevadaVehicleConfigs;                          // 0x18F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class AFortNevadaAudioController> FortNevadaAudioControllerClass;                    // 0x18F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UChildActorComponent*                   AudioControllerActor;                              // 0x1900(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortNevadaAudioController*             FortNevadaAudioController;                         // 0x1908(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVehicleGamepadLiftInputs              LiftInputs;                                        // 0x1910(0x0008)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         LastBatteryRegenTickTime;                          // 0x1918(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBoostThrust;                                      // 0x191C(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBoostDrag;                                        // 0x191D(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBoostInputReleased;                               // 0x191E(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseTractorBeamUprightForce;                       // 0x191F(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDeadBattery;                                      // 0x1920(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1921[0x3];                                     // 0x1921(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TractorBeamExtraLengthForExtents;                  // 0x1924(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                CrashingDesiredUp;                                 // 0x1928(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BoostStartTime;                                    // 0x1940(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BoostPitchAlpha;                                   // 0x1944(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BoostChargeProgress;                               // 0x1948(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         BoostChargesAvailable;                             // 0x194C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                CachedBoostMoveDir;                                // 0x1950(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CurrentStateStartTime;                             // 0x1968(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         HeightAtLandingTime;                               // 0x196C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CrashingScrapingTime;                              // 0x1970(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CrashingNotMovingTimer;                            // 0x1974(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AltimeterTraceHitDistance;                         // 0x1978(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TractorBeamAppliedForceMagnitude;                  // 0x197C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AnimParamDriverSeatLeftRight;                      // 0x1980(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AnimParamDriverSeatForwardBack;                    // 0x1984(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bForceNegativeLift;                                // 0x1988(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bForcePositiveLift;                                // 0x1989(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInitialLift;                                      // 0x198A(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ENevadaFlightStates                           CurrentVehicleState;                               // 0x198B(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_198C[0x4C];                                    // 0x198C(0x004C)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class ALandscapeProxy>         CachedLandscapeProxy;                              // 0x19D8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortCameraMode_AthenaVehicle> PassengerCameraModeClass;                       // 0x19E0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTractorBeamChargeStarted;                         // 0x19E8(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_19E9[0x7];                                     // 0x19E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTowhookParams                         TowhookParams;                                     // 0x19F0(0x00D0)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class AFortAthenaVehicle>         AttachedPawnHiddenVehicle;                         // 0x1AC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UPrimitiveComponent>     TractorBeamAttachedPrimitive;                      // 0x1AC8(0x0008)(ExportObject, Net, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, RepNotify, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortAthenaVehicle*                     SpawnedTractorBeamVictimVehicle;                   // 0x1AD0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UPrimitiveComponent>     PreviousTractorBeamAttachedPrimitive;              // 0x1AD8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class AActor*>                         TractorBeamTargetedActors;                         // 0x1AE0(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, RepNotify, Protected, NativeAccessSpecifierProtected)
	TArray<class AActor*>                         PreviouslyTargetedActors;                          // 0x1AF0(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class AActor*                                 TractorBeamAttachedActor;                          // 0x1B00(0x0008)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AActor*                                 TractorBeamTargetedActor;                          // 0x1B08(0x0008)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                TractorBeamTargetPosition;                         // 0x1B10(0x0018)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1B28[0x1];                                     // 0x1B28(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bBeamButtonReleased;                               // 0x1B29(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1B2A[0x6];                                     // 0x1B2A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      TractorBeamObjectsTypes;                           // 0x1B30(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  DisallowedBeamTags;                                // 0x1B40(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  AlwaysAllowedBeamTags;                             // 0x1B60(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1B80[0x98];                                    // 0x1B80(0x0098)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         TractorBeamFX_Unattached;                          // 0x1C18(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraSystem*                         TractorBeamFX_Attached;                            // 0x1C20(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraComponent*                      BeamPSC;                                           // 0x1C28(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C30[0x50];                                    // 0x1C30(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	ETractorBeamState                             TractorBeamState;                                  // 0x1C80(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C81[0x27];                                    // 0x1C81(0x0027)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TractorBeamDeactivationTimestamp;                  // 0x1CA8(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TractorBeamDisruptedTimestamp;                     // 0x1CAC(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1CB0[0x80];                                    // 0x1CB0(0x0080)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CockpitHealth;                                     // 0x1D30(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Native_CockpitEnabled;                             // 0x1D34(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LastCockpitHealthTickTime;                         // 0x1D38(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LastCockpitDamageTime;                             // 0x1D3C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CockpitDissolveStartTime;                          // 0x1D40(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D44[0x4];                                     // 0x1D44(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         CockpitMaxHealth;                                  // 0x1D48(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         CockpitHealthTickRate;                             // 0x1D70(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         CockpitHealthPerTick;                              // 0x1D98(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         CockpitRegenDelay;                                 // 0x1DC0(0x0028)(Edit, NativeAccessSpecifierPublic)
	class UCurveFloat*                            CockpitHitMaterialWobble;                          // 0x1DE8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LastDamageAlpha;                                   // 0x1DF0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDissolvingCockpit;                                // 0x1DF4(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRestoringCockpit;                                 // 0x1DF5(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCockpitWobble;                                    // 0x1DF6(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1DF7[0x1];                                     // 0x1DF7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   NativeComp_ShieldMesh;                             // 0x1DF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               Native_CockpitMaterial;                            // 0x1E00(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               Native_EnergyRingMatInstance;                      // 0x1E08(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               Native_EnergyFieldMatInstance;                     // 0x1E10(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAudioComponent*                        NativeComp_DamageStateLastLife;                    // 0x1E18(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAudioComponent*                        NativeComp_DamageState;                            // 0x1E20(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Native_LastHitLocation;                            // 0x1E28(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Native_LastHitNormal;                              // 0x1E40(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraComponent*                      NativeComp_DamageStateFX;                          // 0x1E58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraComponent*                      NativeComp_HologramScreen;                         // 0x1E60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraComponent*                      NativeComp_SpeedLines;                             // 0x1E68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     Native_EnergyRingMat;                              // 0x1E70(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     Native_EnergyFieldMat;                             // 0x1E78(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraSystem*                         NativeSys_DamageStateFX;                           // 0x1E80(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraSystem*                         NativeSys_CockpitDestroyed;                        // 0x1E88(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             CockpitDamagedSound;                               // 0x1E90(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             CockpitDestroyedSound;                             // 0x1E98(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             CockpitRespawnSound;                               // 0x1EA0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             Native_DamageStateSound;                           // 0x1EA8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             Native_DamageStateLastLifeSound;                   // 0x1EB0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UForceFeedbackEffect*                   CockpitDeactivatedForceFeedback;                   // 0x1EB8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UMatineeCameraShake>        CockpitDestroyedCamShake;                          // 0x1EC0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class AActor>>             TractorBeamDisallowedClasses;                      // 0x1EC8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_1ED8[0x8];                                     // 0x1ED8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddPhysicsImpulseToTractorBeamAttachedActor(const struct FVector& Impulse, class FName BoneName, bool bVelChange);
	void DisruptTractorBeam();
	void EnablePilotBubbleCollisionOnServer(bool bNewCollisionEnabled);
	void GetDriverSeatRotationAnimParams(float* OutLeftRight, float* OutForwardBack);
	void NativeToggleCockpit(bool bEnable);
	void OnAttachedActorDestroyed(class AActor* DestroyedActor);
	void OnAttachedActorDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void OnBatteryRegen(float Newcharge);
	void OnBoostChargeRefilled();
	void OnBoostFinished();
	void OnBoostStarted();
	void OnCrashedImpact();
	void OnCrashingStarted();
	void OnNewVehicleState(ENevadaFlightStates NewVehicleState);
	void OnOutOfBattery();
	void OnRebootFinished();
	void OnRebootStarted();
	void OnRep_NevadaState(const struct FNevadaState& PrevState);
	void OnRep_ReplicatedTargetedActors();
	void OnRep_TargetedActorChanged();
	void OnRep_TractorBeamAttached();
	void OnRep_TractorBeamChargeStarted();
	void OnRep_TractorBeamState(const ETractorBeamState PreviousState);
	void OnStartAscend();
	void OnStartDescend();
	void OnTargetedActorChanged(class AActor* NewTargetedActor);
	void OnTractorBeamActivated();
	void OnTractorBeamAttached();
	void OnTractorBeamChargeStarted();
	void OnTractorBeamDeactivated(const struct FVector& LastBeamPosition);
	void OnTractorBeamDetached(class AActor* DetachedActor, const struct FVector& LastBeamPosition);
	void SetAttachedPawnAddedVelocity(const struct FVector& AddedVelocity);
	void SetCannonEnabled(const bool bEnabled);
	void SetTractorBeamEnabled(const bool bEnabled);
	void SetTractorBeamInactive();

	class AFortNevadaAudioController* GetAudioController() const;
	float GetBatteryCharge() const;
	float GetBoostChargeProgress() const;
	int32 GetBoostChargesAvailable() const;
	float GetBoostChargeTimeRemaining() const;
	ENevadaFlightStates GetCurrentVehicleState() const;
	float GetEnergyCanonChargePercent() const;
	int32 GetNumRebootsAvailable() const;
	struct FVector GetTractorBeamAttachLocation() const;
	bool IsTractorBeamActive() const;
	bool IsTractorBeamAttached() const;
	bool IsTractorBeamDisrupted() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortNevadaVehicle">();
	}
	static class AFortNevadaVehicle* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortNevadaVehicle>();
	}
};
static_assert(alignof(AFortNevadaVehicle) == 0x000010, "Wrong alignment on AFortNevadaVehicle");
static_assert(sizeof(AFortNevadaVehicle) == 0x001EE0, "Wrong size on AFortNevadaVehicle");
static_assert(offsetof(AFortNevadaVehicle, ServerReplicatedState) == 0x0018D8, "Member 'AFortNevadaVehicle::ServerReplicatedState' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, FortNevadaVehicleConfigs) == 0x0018F0, "Member 'AFortNevadaVehicle::FortNevadaVehicleConfigs' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, FortNevadaAudioControllerClass) == 0x0018F8, "Member 'AFortNevadaVehicle::FortNevadaAudioControllerClass' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, AudioControllerActor) == 0x001900, "Member 'AFortNevadaVehicle::AudioControllerActor' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, FortNevadaAudioController) == 0x001908, "Member 'AFortNevadaVehicle::FortNevadaAudioController' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, LiftInputs) == 0x001910, "Member 'AFortNevadaVehicle::LiftInputs' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, LastBatteryRegenTickTime) == 0x001918, "Member 'AFortNevadaVehicle::LastBatteryRegenTickTime' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, bBoostThrust) == 0x00191C, "Member 'AFortNevadaVehicle::bBoostThrust' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, bBoostDrag) == 0x00191D, "Member 'AFortNevadaVehicle::bBoostDrag' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, bBoostInputReleased) == 0x00191E, "Member 'AFortNevadaVehicle::bBoostInputReleased' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, bUseTractorBeamUprightForce) == 0x00191F, "Member 'AFortNevadaVehicle::bUseTractorBeamUprightForce' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, bDeadBattery) == 0x001920, "Member 'AFortNevadaVehicle::bDeadBattery' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, TractorBeamExtraLengthForExtents) == 0x001924, "Member 'AFortNevadaVehicle::TractorBeamExtraLengthForExtents' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, CrashingDesiredUp) == 0x001928, "Member 'AFortNevadaVehicle::CrashingDesiredUp' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, BoostStartTime) == 0x001940, "Member 'AFortNevadaVehicle::BoostStartTime' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, BoostPitchAlpha) == 0x001944, "Member 'AFortNevadaVehicle::BoostPitchAlpha' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, BoostChargeProgress) == 0x001948, "Member 'AFortNevadaVehicle::BoostChargeProgress' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, BoostChargesAvailable) == 0x00194C, "Member 'AFortNevadaVehicle::BoostChargesAvailable' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, CachedBoostMoveDir) == 0x001950, "Member 'AFortNevadaVehicle::CachedBoostMoveDir' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, CurrentStateStartTime) == 0x001968, "Member 'AFortNevadaVehicle::CurrentStateStartTime' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, HeightAtLandingTime) == 0x00196C, "Member 'AFortNevadaVehicle::HeightAtLandingTime' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, CrashingScrapingTime) == 0x001970, "Member 'AFortNevadaVehicle::CrashingScrapingTime' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, CrashingNotMovingTimer) == 0x001974, "Member 'AFortNevadaVehicle::CrashingNotMovingTimer' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, AltimeterTraceHitDistance) == 0x001978, "Member 'AFortNevadaVehicle::AltimeterTraceHitDistance' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, TractorBeamAppliedForceMagnitude) == 0x00197C, "Member 'AFortNevadaVehicle::TractorBeamAppliedForceMagnitude' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, AnimParamDriverSeatLeftRight) == 0x001980, "Member 'AFortNevadaVehicle::AnimParamDriverSeatLeftRight' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, AnimParamDriverSeatForwardBack) == 0x001984, "Member 'AFortNevadaVehicle::AnimParamDriverSeatForwardBack' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, bForceNegativeLift) == 0x001988, "Member 'AFortNevadaVehicle::bForceNegativeLift' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, bForcePositiveLift) == 0x001989, "Member 'AFortNevadaVehicle::bForcePositiveLift' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, bInitialLift) == 0x00198A, "Member 'AFortNevadaVehicle::bInitialLift' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, CurrentVehicleState) == 0x00198B, "Member 'AFortNevadaVehicle::CurrentVehicleState' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, CachedLandscapeProxy) == 0x0019D8, "Member 'AFortNevadaVehicle::CachedLandscapeProxy' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, PassengerCameraModeClass) == 0x0019E0, "Member 'AFortNevadaVehicle::PassengerCameraModeClass' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, bTractorBeamChargeStarted) == 0x0019E8, "Member 'AFortNevadaVehicle::bTractorBeamChargeStarted' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, TowhookParams) == 0x0019F0, "Member 'AFortNevadaVehicle::TowhookParams' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, AttachedPawnHiddenVehicle) == 0x001AC0, "Member 'AFortNevadaVehicle::AttachedPawnHiddenVehicle' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, TractorBeamAttachedPrimitive) == 0x001AC8, "Member 'AFortNevadaVehicle::TractorBeamAttachedPrimitive' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, SpawnedTractorBeamVictimVehicle) == 0x001AD0, "Member 'AFortNevadaVehicle::SpawnedTractorBeamVictimVehicle' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, PreviousTractorBeamAttachedPrimitive) == 0x001AD8, "Member 'AFortNevadaVehicle::PreviousTractorBeamAttachedPrimitive' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, TractorBeamTargetedActors) == 0x001AE0, "Member 'AFortNevadaVehicle::TractorBeamTargetedActors' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, PreviouslyTargetedActors) == 0x001AF0, "Member 'AFortNevadaVehicle::PreviouslyTargetedActors' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, TractorBeamAttachedActor) == 0x001B00, "Member 'AFortNevadaVehicle::TractorBeamAttachedActor' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, TractorBeamTargetedActor) == 0x001B08, "Member 'AFortNevadaVehicle::TractorBeamTargetedActor' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, TractorBeamTargetPosition) == 0x001B10, "Member 'AFortNevadaVehicle::TractorBeamTargetPosition' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, bBeamButtonReleased) == 0x001B29, "Member 'AFortNevadaVehicle::bBeamButtonReleased' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, TractorBeamObjectsTypes) == 0x001B30, "Member 'AFortNevadaVehicle::TractorBeamObjectsTypes' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, DisallowedBeamTags) == 0x001B40, "Member 'AFortNevadaVehicle::DisallowedBeamTags' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, AlwaysAllowedBeamTags) == 0x001B60, "Member 'AFortNevadaVehicle::AlwaysAllowedBeamTags' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, TractorBeamFX_Unattached) == 0x001C18, "Member 'AFortNevadaVehicle::TractorBeamFX_Unattached' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, TractorBeamFX_Attached) == 0x001C20, "Member 'AFortNevadaVehicle::TractorBeamFX_Attached' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, BeamPSC) == 0x001C28, "Member 'AFortNevadaVehicle::BeamPSC' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, TractorBeamState) == 0x001C80, "Member 'AFortNevadaVehicle::TractorBeamState' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, TractorBeamDeactivationTimestamp) == 0x001CA8, "Member 'AFortNevadaVehicle::TractorBeamDeactivationTimestamp' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, TractorBeamDisruptedTimestamp) == 0x001CAC, "Member 'AFortNevadaVehicle::TractorBeamDisruptedTimestamp' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, CockpitHealth) == 0x001D30, "Member 'AFortNevadaVehicle::CockpitHealth' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, Native_CockpitEnabled) == 0x001D34, "Member 'AFortNevadaVehicle::Native_CockpitEnabled' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, LastCockpitHealthTickTime) == 0x001D38, "Member 'AFortNevadaVehicle::LastCockpitHealthTickTime' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, LastCockpitDamageTime) == 0x001D3C, "Member 'AFortNevadaVehicle::LastCockpitDamageTime' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, CockpitDissolveStartTime) == 0x001D40, "Member 'AFortNevadaVehicle::CockpitDissolveStartTime' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, CockpitMaxHealth) == 0x001D48, "Member 'AFortNevadaVehicle::CockpitMaxHealth' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, CockpitHealthTickRate) == 0x001D70, "Member 'AFortNevadaVehicle::CockpitHealthTickRate' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, CockpitHealthPerTick) == 0x001D98, "Member 'AFortNevadaVehicle::CockpitHealthPerTick' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, CockpitRegenDelay) == 0x001DC0, "Member 'AFortNevadaVehicle::CockpitRegenDelay' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, CockpitHitMaterialWobble) == 0x001DE8, "Member 'AFortNevadaVehicle::CockpitHitMaterialWobble' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, LastDamageAlpha) == 0x001DF0, "Member 'AFortNevadaVehicle::LastDamageAlpha' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, bDissolvingCockpit) == 0x001DF4, "Member 'AFortNevadaVehicle::bDissolvingCockpit' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, bRestoringCockpit) == 0x001DF5, "Member 'AFortNevadaVehicle::bRestoringCockpit' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, bCockpitWobble) == 0x001DF6, "Member 'AFortNevadaVehicle::bCockpitWobble' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, NativeComp_ShieldMesh) == 0x001DF8, "Member 'AFortNevadaVehicle::NativeComp_ShieldMesh' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, Native_CockpitMaterial) == 0x001E00, "Member 'AFortNevadaVehicle::Native_CockpitMaterial' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, Native_EnergyRingMatInstance) == 0x001E08, "Member 'AFortNevadaVehicle::Native_EnergyRingMatInstance' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, Native_EnergyFieldMatInstance) == 0x001E10, "Member 'AFortNevadaVehicle::Native_EnergyFieldMatInstance' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, NativeComp_DamageStateLastLife) == 0x001E18, "Member 'AFortNevadaVehicle::NativeComp_DamageStateLastLife' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, NativeComp_DamageState) == 0x001E20, "Member 'AFortNevadaVehicle::NativeComp_DamageState' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, Native_LastHitLocation) == 0x001E28, "Member 'AFortNevadaVehicle::Native_LastHitLocation' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, Native_LastHitNormal) == 0x001E40, "Member 'AFortNevadaVehicle::Native_LastHitNormal' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, NativeComp_DamageStateFX) == 0x001E58, "Member 'AFortNevadaVehicle::NativeComp_DamageStateFX' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, NativeComp_HologramScreen) == 0x001E60, "Member 'AFortNevadaVehicle::NativeComp_HologramScreen' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, NativeComp_SpeedLines) == 0x001E68, "Member 'AFortNevadaVehicle::NativeComp_SpeedLines' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, Native_EnergyRingMat) == 0x001E70, "Member 'AFortNevadaVehicle::Native_EnergyRingMat' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, Native_EnergyFieldMat) == 0x001E78, "Member 'AFortNevadaVehicle::Native_EnergyFieldMat' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, NativeSys_DamageStateFX) == 0x001E80, "Member 'AFortNevadaVehicle::NativeSys_DamageStateFX' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, NativeSys_CockpitDestroyed) == 0x001E88, "Member 'AFortNevadaVehicle::NativeSys_CockpitDestroyed' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, CockpitDamagedSound) == 0x001E90, "Member 'AFortNevadaVehicle::CockpitDamagedSound' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, CockpitDestroyedSound) == 0x001E98, "Member 'AFortNevadaVehicle::CockpitDestroyedSound' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, CockpitRespawnSound) == 0x001EA0, "Member 'AFortNevadaVehicle::CockpitRespawnSound' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, Native_DamageStateSound) == 0x001EA8, "Member 'AFortNevadaVehicle::Native_DamageStateSound' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, Native_DamageStateLastLifeSound) == 0x001EB0, "Member 'AFortNevadaVehicle::Native_DamageStateLastLifeSound' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, CockpitDeactivatedForceFeedback) == 0x001EB8, "Member 'AFortNevadaVehicle::CockpitDeactivatedForceFeedback' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, CockpitDestroyedCamShake) == 0x001EC0, "Member 'AFortNevadaVehicle::CockpitDestroyedCamShake' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, TractorBeamDisallowedClasses) == 0x001EC8, "Member 'AFortNevadaVehicle::TractorBeamDisallowedClasses' has a wrong offset!");

// Class NevadaRuntime.FortNevadaVehicleAnimInstance
// 0x00F0 (0x0690 - 0x05A0)
class UFortNevadaVehicleAnimInstance final : public UFortVehicleAnimInstance
{
public:
	class AFortNevadaVehicle*                     NevadaVehicle;                                     // 0x05A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTractorBeam_IsAttached;                           // 0x05A8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTractorBeam_IsCharging;                           // 0x05A9(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTractorBeam_IsActive;                             // 0x05AA(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTractorBeam_IsInactive;                           // 0x05AB(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTractorBeam_IsOn;                                 // 0x05AC(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTractorBeam_HasTarget;                            // 0x05AD(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTractorBeam_ShouldApplyCustomAO;                  // 0x05AE(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5AF[0x1];                                      // 0x05AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TractorBeam_LookAtPitch;                           // 0x05B0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TractorBeam_LookAtYaw;                             // 0x05B4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LeanLeftRight;                                     // 0x05B8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LeanForwardBackward;                               // 0x05BC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LeanValue;                                         // 0x05C0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PreviousLeanValue;                                 // 0x05C4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VelocityZValue;                                    // 0x05C8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LeanDelta;                                         // 0x05CC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTurnAgain;                                        // 0x05D0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHadDriver;                                        // 0x05D1(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bJustGotDriver;                                    // 0x05D2(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bJustLostDriver;                                   // 0x05D3(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWasBoosting;                                      // 0x05D4(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBoosting;                                       // 0x05D5(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5D6[0x2];                                      // 0x05D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
