#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptionsMenuHeader

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass OptionsMenuHeader.OptionsMenuHeader_C
// 0x0030 (0x02D0 - 0x02A0)
class UOptionsMenuHeader_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_0;                                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxContainer;                                  // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                SpacerBottom;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextHeader;                                        // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         FontSizeMobile;                                    // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESettingType                                  LocalSettingType;                                  // 0x02CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void Center_On_Widget();
	void CenterOnWidget_1();
	void Construct();
	void ExecuteUbergraph_OptionsMenuHeader(int32 EntryPoint);
	void HandlePawnSet();
	void OnListItemObjectSet(class UObject* ListItemObject);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void SetFontSize(class UCommonTextBlock* Text, int32 DefaultSize, int32 MobileSize);
	void UpdateSize();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OptionsMenuHeader_C">();
	}
	static class UOptionsMenuHeader_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptionsMenuHeader_C>();
	}
};
static_assert(alignof(UOptionsMenuHeader_C) == 0x000008, "Wrong alignment on UOptionsMenuHeader_C");
static_assert(sizeof(UOptionsMenuHeader_C) == 0x0002D0, "Wrong size on UOptionsMenuHeader_C");
static_assert(offsetof(UOptionsMenuHeader_C, UberGraphFrame) == 0x0002A0, "Member 'UOptionsMenuHeader_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UOptionsMenuHeader_C, Image_0) == 0x0002A8, "Member 'UOptionsMenuHeader_C::Image_0' has a wrong offset!");
static_assert(offsetof(UOptionsMenuHeader_C, SizeBoxContainer) == 0x0002B0, "Member 'UOptionsMenuHeader_C::SizeBoxContainer' has a wrong offset!");
static_assert(offsetof(UOptionsMenuHeader_C, SpacerBottom) == 0x0002B8, "Member 'UOptionsMenuHeader_C::SpacerBottom' has a wrong offset!");
static_assert(offsetof(UOptionsMenuHeader_C, TextHeader) == 0x0002C0, "Member 'UOptionsMenuHeader_C::TextHeader' has a wrong offset!");
static_assert(offsetof(UOptionsMenuHeader_C, FontSizeMobile) == 0x0002C8, "Member 'UOptionsMenuHeader_C::FontSizeMobile' has a wrong offset!");
static_assert(offsetof(UOptionsMenuHeader_C, LocalSettingType) == 0x0002CC, "Member 'UOptionsMenuHeader_C::LocalSettingType' has a wrong offset!");

}

