#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PageNavigatorPipButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PageNavigatorPipButton.PageNavigatorPipButton_C
// 0x0040 (0x10C0 - 0x1080)
class UPageNavigatorPipButton_C final : public UFortTextButton
{
public:
	uint8                                         Pad_1078[0x8];                                     // 0x1078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1080(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x1088(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x1090(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BacchusMobileShadow;                               // 0x1098(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget_RightStick;                     // 0x10A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PIP;                                               // 0x10A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               RSContainer;                                       // 0x10B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnDeselected();
	void BP_OnSelected();
	void Construct();
	void ExecuteUbergraph_PageNavigatorPipButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Set_Pip_Colors(const struct FLinearColor& Base_Color, const struct FLinearColor& Hover_Color, const struct FLinearColor& Select_Color);
	void SetRightStickIconAllowed(bool Allowed);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PageNavigatorPipButton_C">();
	}
	static class UPageNavigatorPipButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPageNavigatorPipButton_C>();
	}
};
static_assert(alignof(UPageNavigatorPipButton_C) == 0x000010, "Wrong alignment on UPageNavigatorPipButton_C");
static_assert(sizeof(UPageNavigatorPipButton_C) == 0x0010C0, "Wrong size on UPageNavigatorPipButton_C");
static_assert(offsetof(UPageNavigatorPipButton_C, UberGraphFrame) == 0x001080, "Member 'UPageNavigatorPipButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPageNavigatorPipButton_C, Hover) == 0x001088, "Member 'UPageNavigatorPipButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UPageNavigatorPipButton_C, Selected) == 0x001090, "Member 'UPageNavigatorPipButton_C::Selected' has a wrong offset!");
static_assert(offsetof(UPageNavigatorPipButton_C, BacchusMobileShadow) == 0x001098, "Member 'UPageNavigatorPipButton_C::BacchusMobileShadow' has a wrong offset!");
static_assert(offsetof(UPageNavigatorPipButton_C, CommonActionWidget_RightStick) == 0x0010A0, "Member 'UPageNavigatorPipButton_C::CommonActionWidget_RightStick' has a wrong offset!");
static_assert(offsetof(UPageNavigatorPipButton_C, PIP) == 0x0010A8, "Member 'UPageNavigatorPipButton_C::PIP' has a wrong offset!");
static_assert(offsetof(UPageNavigatorPipButton_C, RSContainer) == 0x0010B0, "Member 'UPageNavigatorPipButton_C::RSContainer' has a wrong offset!");

}

