#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PanelButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUILegacy_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PanelButton.PanelButton_C
// 0x0050 (0x1040 - 0x0FF0)
class UPanelButton_C final : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_FE8[0x8];                                      // 0x0FE8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0FF0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNamedSlot*                             ContentSlot;                                       // 0x0FF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 ControllerInputStyle;                              // 0x1000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UClass*                                 MouseKeyboardStyle;                                // 0x1008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          InputActionHorizontalAlignment;                    // 0x1010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            InputActionVerticalAlignment;                      // 0x1011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1012[0x6];                                     // 0x1012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              InputActionRenderTranslation;                      // 0x1018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InputActionUseRimBrush;                            // 0x1028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1029[0x7];                                     // 0x1029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              InputActionRimBrushSize;                           // 0x1030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__CommonActionWidgetAction_K2Node_ComponentBoundEvent_0_OnInputMethodChanged__DelegateSignature(bool bUsingGamepad);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_PanelButton(int32 EntryPoint);
	void InitializeButton();
	void OnActionComplete();
	void OnActionProgress(float HeldPercent);
	void OnTriggeredInputActionChanged(const struct FDataTableRowHandle& NewTriggeredAction);
	void PreConstruct(bool IsDesignTime);
	void UpdateInputActionLayout();
	void UpdateStyle(bool bUsingGamepad);
	void UpdateTextAndStyle();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PanelButton_C">();
	}
	static class UPanelButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPanelButton_C>();
	}
};
static_assert(alignof(UPanelButton_C) == 0x000010, "Wrong alignment on UPanelButton_C");
static_assert(sizeof(UPanelButton_C) == 0x001040, "Wrong size on UPanelButton_C");
static_assert(offsetof(UPanelButton_C, UberGraphFrame) == 0x000FF0, "Member 'UPanelButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPanelButton_C, ContentSlot) == 0x000FF8, "Member 'UPanelButton_C::ContentSlot' has a wrong offset!");
static_assert(offsetof(UPanelButton_C, ControllerInputStyle) == 0x001000, "Member 'UPanelButton_C::ControllerInputStyle' has a wrong offset!");
static_assert(offsetof(UPanelButton_C, MouseKeyboardStyle) == 0x001008, "Member 'UPanelButton_C::MouseKeyboardStyle' has a wrong offset!");
static_assert(offsetof(UPanelButton_C, InputActionHorizontalAlignment) == 0x001010, "Member 'UPanelButton_C::InputActionHorizontalAlignment' has a wrong offset!");
static_assert(offsetof(UPanelButton_C, InputActionVerticalAlignment) == 0x001011, "Member 'UPanelButton_C::InputActionVerticalAlignment' has a wrong offset!");
static_assert(offsetof(UPanelButton_C, InputActionRenderTranslation) == 0x001018, "Member 'UPanelButton_C::InputActionRenderTranslation' has a wrong offset!");
static_assert(offsetof(UPanelButton_C, InputActionUseRimBrush) == 0x001028, "Member 'UPanelButton_C::InputActionUseRimBrush' has a wrong offset!");
static_assert(offsetof(UPanelButton_C, InputActionRimBrushSize) == 0x001030, "Member 'UPanelButton_C::InputActionRimBrushSize' has a wrong offset!");

}

