#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PendingAccountMergeNotification

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUILegacy_classes.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PendingAccountMergeNotification.PendingAccountMergeNotification_C
// 0x0030 (0x1020 - 0x0FF0)
class UPendingAccountMergeNotification_C final : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_FE8[0x8];                                      // 0x0FE8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0FF0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0FF8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_1;                                          // 0x1000(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget_48;                             // 0x1008(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_42;                                      // 0x1010(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_45;                                      // 0x1018(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnClicked();
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_PendingAccountMergeNotification(int32 EntryPoint);
	void Hovered(bool IsHovered_0);
	void OnInputChanged(ECommonInputType bNewInputType);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PendingAccountMergeNotification_C">();
	}
	static class UPendingAccountMergeNotification_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPendingAccountMergeNotification_C>();
	}
};
static_assert(alignof(UPendingAccountMergeNotification_C) == 0x000010, "Wrong alignment on UPendingAccountMergeNotification_C");
static_assert(sizeof(UPendingAccountMergeNotification_C) == 0x001020, "Wrong size on UPendingAccountMergeNotification_C");
static_assert(offsetof(UPendingAccountMergeNotification_C, UberGraphFrame) == 0x000FF0, "Member 'UPendingAccountMergeNotification_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPendingAccountMergeNotification_C, Hover) == 0x000FF8, "Member 'UPendingAccountMergeNotification_C::Hover' has a wrong offset!");
static_assert(offsetof(UPendingAccountMergeNotification_C, Border_1) == 0x001000, "Member 'UPendingAccountMergeNotification_C::Border_1' has a wrong offset!");
static_assert(offsetof(UPendingAccountMergeNotification_C, CommonActionWidget_48) == 0x001008, "Member 'UPendingAccountMergeNotification_C::CommonActionWidget_48' has a wrong offset!");
static_assert(offsetof(UPendingAccountMergeNotification_C, TextBlock_42) == 0x001010, "Member 'UPendingAccountMergeNotification_C::TextBlock_42' has a wrong offset!");
static_assert(offsetof(UPendingAccountMergeNotification_C, TextBlock_45) == 0x001018, "Member 'UPendingAccountMergeNotification_C::TextBlock_45' has a wrong offset!");

}

