#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PiPBladeMenuButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PictureInPictureUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PiPBladeMenuButton.PiPBladeMenuButton_C
// 0x0060 (0x1050 - 0x0FF0)
class UPiPBladeMenuButton_C final : public UPictureInPictureBladeMenuButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0FF0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       StatusGrow;                                        // 0x0FF8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x1000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       ButtonText;                                        // 0x1008(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconOff;                                           // 0x1010(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconOn;                                            // 0x1018(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        IconSwitcher;                                      // 0x1020(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       IconTextOff;                                       // 0x1028(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       IconTextOn;                                        // 0x1030(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           RightSideIconTextContent;                          // 0x1038(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Feedback;                                     // 0x1040(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        TextSwitcher;                                      // 0x1048(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_PiPBladeMenuButton(int32 EntryPoint);
	void UpdatePiPStatusBP(const bool LoggedIn, const bool Enabled, const bool ParentalControlsEnabled);
	void UpdateStatus(bool IsEnabled, bool IsLoggedIn, bool IsParentalControlsEnabled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PiPBladeMenuButton_C">();
	}
	static class UPiPBladeMenuButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPiPBladeMenuButton_C>();
	}
};
static_assert(alignof(UPiPBladeMenuButton_C) == 0x000010, "Wrong alignment on UPiPBladeMenuButton_C");
static_assert(sizeof(UPiPBladeMenuButton_C) == 0x001050, "Wrong size on UPiPBladeMenuButton_C");
static_assert(offsetof(UPiPBladeMenuButton_C, UberGraphFrame) == 0x000FF0, "Member 'UPiPBladeMenuButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPiPBladeMenuButton_C, StatusGrow) == 0x000FF8, "Member 'UPiPBladeMenuButton_C::StatusGrow' has a wrong offset!");
static_assert(offsetof(UPiPBladeMenuButton_C, Hover) == 0x001000, "Member 'UPiPBladeMenuButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UPiPBladeMenuButton_C, ButtonText) == 0x001008, "Member 'UPiPBladeMenuButton_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UPiPBladeMenuButton_C, IconOff) == 0x001010, "Member 'UPiPBladeMenuButton_C::IconOff' has a wrong offset!");
static_assert(offsetof(UPiPBladeMenuButton_C, IconOn) == 0x001018, "Member 'UPiPBladeMenuButton_C::IconOn' has a wrong offset!");
static_assert(offsetof(UPiPBladeMenuButton_C, IconSwitcher) == 0x001020, "Member 'UPiPBladeMenuButton_C::IconSwitcher' has a wrong offset!");
static_assert(offsetof(UPiPBladeMenuButton_C, IconTextOff) == 0x001028, "Member 'UPiPBladeMenuButton_C::IconTextOff' has a wrong offset!");
static_assert(offsetof(UPiPBladeMenuButton_C, IconTextOn) == 0x001030, "Member 'UPiPBladeMenuButton_C::IconTextOn' has a wrong offset!");
static_assert(offsetof(UPiPBladeMenuButton_C, RightSideIconTextContent) == 0x001038, "Member 'UPiPBladeMenuButton_C::RightSideIconTextContent' has a wrong offset!");
static_assert(offsetof(UPiPBladeMenuButton_C, Text_Feedback) == 0x001040, "Member 'UPiPBladeMenuButton_C::Text_Feedback' has a wrong offset!");
static_assert(offsetof(UPiPBladeMenuButton_C, TextSwitcher) == 0x001048, "Member 'UPiPBladeMenuButton_C::TextSwitcher' has a wrong offset!");

}

