#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayedBeforeSelect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayedBeforeSelect.PlayedBeforeSelect_C
// 0x0040 (0x0428 - 0x03E8)
class UPlayedBeforeSelect_C final : public UFortPlayedBeforeSelect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_1;                                 // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_6;                                 // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            CommonWidgetSwitcher_InviteOnly;                   // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInviteEventTitle_C*                    InviteEventTitle;                                  // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        LoginType_Switcher;                                // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USignInWidget_C*                        SignInWidget;                                      // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnActivated_1();
	void ExecuteUbergraph_PlayedBeforeSelect(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayedBeforeSelect_C">();
	}
	static class UPlayedBeforeSelect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayedBeforeSelect_C>();
	}
};
static_assert(alignof(UPlayedBeforeSelect_C) == 0x000008, "Wrong alignment on UPlayedBeforeSelect_C");
static_assert(sizeof(UPlayedBeforeSelect_C) == 0x000428, "Wrong size on UPlayedBeforeSelect_C");
static_assert(offsetof(UPlayedBeforeSelect_C, UberGraphFrame) == 0x0003E8, "Member 'UPlayedBeforeSelect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayedBeforeSelect_C, Intro) == 0x0003F0, "Member 'UPlayedBeforeSelect_C::Intro' has a wrong offset!");
static_assert(offsetof(UPlayedBeforeSelect_C, CommonTextBlock_1) == 0x0003F8, "Member 'UPlayedBeforeSelect_C::CommonTextBlock_1' has a wrong offset!");
static_assert(offsetof(UPlayedBeforeSelect_C, CommonTextBlock_6) == 0x000400, "Member 'UPlayedBeforeSelect_C::CommonTextBlock_6' has a wrong offset!");
static_assert(offsetof(UPlayedBeforeSelect_C, CommonWidgetSwitcher_InviteOnly) == 0x000408, "Member 'UPlayedBeforeSelect_C::CommonWidgetSwitcher_InviteOnly' has a wrong offset!");
static_assert(offsetof(UPlayedBeforeSelect_C, InviteEventTitle) == 0x000410, "Member 'UPlayedBeforeSelect_C::InviteEventTitle' has a wrong offset!");
static_assert(offsetof(UPlayedBeforeSelect_C, LoginType_Switcher) == 0x000418, "Member 'UPlayedBeforeSelect_C::LoginType_Switcher' has a wrong offset!");
static_assert(offsetof(UPlayedBeforeSelect_C, SignInWidget) == 0x000420, "Member 'UPlayedBeforeSelect_C::SignInWidget' has a wrong offset!");

}

