#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProgressiveItemWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CrewUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ProgressiveItemWidget.ProgressiveItemWidget_C
// 0x00A0 (0x10B0 - 0x1010)
class UProgressiveItemWidget_C final : public UFortProgressiveItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1010(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Item_Hover;                                        // 0x1018(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover_Burst;                                       // 0x1020(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select;                                            // 0x1028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NotCurrentRow;                                     // 0x1030(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Reveal_Hide;                                       // 0x1038(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GrowTile;                                          // 0x1040(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 DisableTintOverlay;                                // 0x1048(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBox_locks;                                        // 0x1050(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x1058(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_32;                                          // 0x1060(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_RarityStripe;                                // 0x1068(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         ItemCardImage;                                     // 0x1070(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OffscreenOverlay;                                  // 0x1078(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Delayed;                                   // 0x1080(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Widget_ClaimedImage;                               // 0x1088(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Widget_LockedImage;                                // 0x1090(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortItem*                              StrongItemToRepresent;                             // 0x1098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundOnReveal;                                     // 0x10A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Selected;                                          // 0x10A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hovered;                                           // 0x10A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_ProgressiveItemWidget(int32 EntryPoint);
	void OnHighlighted();
	void OnInitialized();
	void OnPeekStateChanged(bool bIsInPeekState);
	void OnStageItemChanged(const struct FProgressiveStageItemInfo& InStageItemInfo);
	void OnUnhighlighted();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ProgressiveItemWidget_C">();
	}
	static class UProgressiveItemWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProgressiveItemWidget_C>();
	}
};
static_assert(alignof(UProgressiveItemWidget_C) == 0x000010, "Wrong alignment on UProgressiveItemWidget_C");
static_assert(sizeof(UProgressiveItemWidget_C) == 0x0010B0, "Wrong size on UProgressiveItemWidget_C");
static_assert(offsetof(UProgressiveItemWidget_C, UberGraphFrame) == 0x001010, "Member 'UProgressiveItemWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UProgressiveItemWidget_C, Item_Hover) == 0x001018, "Member 'UProgressiveItemWidget_C::Item_Hover' has a wrong offset!");
static_assert(offsetof(UProgressiveItemWidget_C, Hover_Burst) == 0x001020, "Member 'UProgressiveItemWidget_C::Hover_Burst' has a wrong offset!");
static_assert(offsetof(UProgressiveItemWidget_C, Select) == 0x001028, "Member 'UProgressiveItemWidget_C::Select' has a wrong offset!");
static_assert(offsetof(UProgressiveItemWidget_C, NotCurrentRow) == 0x001030, "Member 'UProgressiveItemWidget_C::NotCurrentRow' has a wrong offset!");
static_assert(offsetof(UProgressiveItemWidget_C, Reveal_Hide) == 0x001038, "Member 'UProgressiveItemWidget_C::Reveal_Hide' has a wrong offset!");
static_assert(offsetof(UProgressiveItemWidget_C, GrowTile) == 0x001040, "Member 'UProgressiveItemWidget_C::GrowTile' has a wrong offset!");
static_assert(offsetof(UProgressiveItemWidget_C, DisableTintOverlay) == 0x001048, "Member 'UProgressiveItemWidget_C::DisableTintOverlay' has a wrong offset!");
static_assert(offsetof(UProgressiveItemWidget_C, HBox_locks) == 0x001050, "Member 'UProgressiveItemWidget_C::HBox_locks' has a wrong offset!");
static_assert(offsetof(UProgressiveItemWidget_C, Image) == 0x001058, "Member 'UProgressiveItemWidget_C::Image' has a wrong offset!");
static_assert(offsetof(UProgressiveItemWidget_C, Image_32) == 0x001060, "Member 'UProgressiveItemWidget_C::Image_32' has a wrong offset!");
static_assert(offsetof(UProgressiveItemWidget_C, Image_RarityStripe) == 0x001068, "Member 'UProgressiveItemWidget_C::Image_RarityStripe' has a wrong offset!");
static_assert(offsetof(UProgressiveItemWidget_C, ItemCardImage) == 0x001070, "Member 'UProgressiveItemWidget_C::ItemCardImage' has a wrong offset!");
static_assert(offsetof(UProgressiveItemWidget_C, OffscreenOverlay) == 0x001078, "Member 'UProgressiveItemWidget_C::OffscreenOverlay' has a wrong offset!");
static_assert(offsetof(UProgressiveItemWidget_C, Overlay_Delayed) == 0x001080, "Member 'UProgressiveItemWidget_C::Overlay_Delayed' has a wrong offset!");
static_assert(offsetof(UProgressiveItemWidget_C, Widget_ClaimedImage) == 0x001088, "Member 'UProgressiveItemWidget_C::Widget_ClaimedImage' has a wrong offset!");
static_assert(offsetof(UProgressiveItemWidget_C, Widget_LockedImage) == 0x001090, "Member 'UProgressiveItemWidget_C::Widget_LockedImage' has a wrong offset!");
static_assert(offsetof(UProgressiveItemWidget_C, StrongItemToRepresent) == 0x001098, "Member 'UProgressiveItemWidget_C::StrongItemToRepresent' has a wrong offset!");
static_assert(offsetof(UProgressiveItemWidget_C, SoundOnReveal) == 0x0010A0, "Member 'UProgressiveItemWidget_C::SoundOnReveal' has a wrong offset!");
static_assert(offsetof(UProgressiveItemWidget_C, Selected) == 0x0010A8, "Member 'UProgressiveItemWidget_C::Selected' has a wrong offset!");
static_assert(offsetof(UProgressiveItemWidget_C, Hovered) == 0x0010A9, "Member 'UProgressiveItemWidget_C::Hovered' has a wrong offset!");

}

