#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QualityLevelSelectScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass QualityLevelSelectScreen.QualityLevelSelectScreen_C
// 0x0048 (0x0590 - 0x0548)
class UQualityLevelSelectScreen_C final : public UFortQualityLevelSelectScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0548(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0550(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UQualityModeSelectTile_C*               Button_SelectHighQuality_1;                        // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              Footersafezone;                                    // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_93;                                          // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonAnimatedSwitcher*                OptionMessage;                                     // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_QualityLevelCalculated;                       // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_QualityTitle;                                 // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TilesRow;                                          // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_QualityLevelSelectScreen(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"QualityLevelSelectScreen_C">();
	}
	static class UQualityLevelSelectScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQualityLevelSelectScreen_C>();
	}
};
static_assert(alignof(UQualityLevelSelectScreen_C) == 0x000008, "Wrong alignment on UQualityLevelSelectScreen_C");
static_assert(sizeof(UQualityLevelSelectScreen_C) == 0x000590, "Wrong size on UQualityLevelSelectScreen_C");
static_assert(offsetof(UQualityLevelSelectScreen_C, UberGraphFrame) == 0x000548, "Member 'UQualityLevelSelectScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UQualityLevelSelectScreen_C, Intro) == 0x000550, "Member 'UQualityLevelSelectScreen_C::Intro' has a wrong offset!");
static_assert(offsetof(UQualityLevelSelectScreen_C, Button_SelectHighQuality_1) == 0x000558, "Member 'UQualityLevelSelectScreen_C::Button_SelectHighQuality_1' has a wrong offset!");
static_assert(offsetof(UQualityLevelSelectScreen_C, Footersafezone) == 0x000560, "Member 'UQualityLevelSelectScreen_C::Footersafezone' has a wrong offset!");
static_assert(offsetof(UQualityLevelSelectScreen_C, Image_93) == 0x000568, "Member 'UQualityLevelSelectScreen_C::Image_93' has a wrong offset!");
static_assert(offsetof(UQualityLevelSelectScreen_C, OptionMessage) == 0x000570, "Member 'UQualityLevelSelectScreen_C::OptionMessage' has a wrong offset!");
static_assert(offsetof(UQualityLevelSelectScreen_C, Text_QualityLevelCalculated) == 0x000578, "Member 'UQualityLevelSelectScreen_C::Text_QualityLevelCalculated' has a wrong offset!");
static_assert(offsetof(UQualityLevelSelectScreen_C, Text_QualityTitle) == 0x000580, "Member 'UQualityLevelSelectScreen_C::Text_QualityTitle' has a wrong offset!");
static_assert(offsetof(UQualityLevelSelectScreen_C, TilesRow) == 0x000588, "Member 'UQualityLevelSelectScreen_C::TilesRow' has a wrong offset!");

}

