#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RebootVanIndicator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RebootVanIndicator.RebootVanIndicator_C
// 0x0040 (0x0600 - 0x05C0)
class URebootVanIndicator_C final : public UAthenaRebootVanIndicator
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x05C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Nameplate;                                  // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_RebootIcon;                                  // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SmallIndicator;                              // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Van;                                         // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                IndicatorSpacer;                                   // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_RebootVanIndicator(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RebootVanIndicator_C">();
	}
	static class URebootVanIndicator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URebootVanIndicator_C>();
	}
};
static_assert(alignof(URebootVanIndicator_C) == 0x000008, "Wrong alignment on URebootVanIndicator_C");
static_assert(sizeof(URebootVanIndicator_C) == 0x000600, "Wrong size on URebootVanIndicator_C");
static_assert(offsetof(URebootVanIndicator_C, UberGraphFrame) == 0x0005C0, "Member 'URebootVanIndicator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URebootVanIndicator_C, Intro) == 0x0005C8, "Member 'URebootVanIndicator_C::Intro' has a wrong offset!");
static_assert(offsetof(URebootVanIndicator_C, Border_Nameplate) == 0x0005D0, "Member 'URebootVanIndicator_C::Border_Nameplate' has a wrong offset!");
static_assert(offsetof(URebootVanIndicator_C, Icon) == 0x0005D8, "Member 'URebootVanIndicator_C::Icon' has a wrong offset!");
static_assert(offsetof(URebootVanIndicator_C, Image_RebootIcon) == 0x0005E0, "Member 'URebootVanIndicator_C::Image_RebootIcon' has a wrong offset!");
static_assert(offsetof(URebootVanIndicator_C, Image_SmallIndicator) == 0x0005E8, "Member 'URebootVanIndicator_C::Image_SmallIndicator' has a wrong offset!");
static_assert(offsetof(URebootVanIndicator_C, Image_Van) == 0x0005F0, "Member 'URebootVanIndicator_C::Image_Van' has a wrong offset!");
static_assert(offsetof(URebootVanIndicator_C, IndicatorSpacer) == 0x0005F8, "Member 'URebootVanIndicator_C::IndicatorSpacer' has a wrong offset!");

}

