#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReferAFriendEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ReferAFriendEntry.ReferAFriendEntry_C
// 0x0050 (0x1060 - 0x1010)
class UReferAFriendEntry_C final : public UFortReferFriendListEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1010(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x1018(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x1020(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                AnimatedInputBorder;                               // 0x1028(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow;                                             // 0x1030(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      EmptyButtonToEatOneMouseUpEvent;                   // 0x1038(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                EntryBorder;                                       // 0x1040(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Exclamation;                                       // 0x1048(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_MissedInvitesText;                            // 0x1050(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUserActionMenuInputButton_C*           UserActionMenuInputButton;                         // 0x1058(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_ReferAFriendEntry(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ReferAFriendEntry_C">();
	}
	static class UReferAFriendEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReferAFriendEntry_C>();
	}
};
static_assert(alignof(UReferAFriendEntry_C) == 0x000010, "Wrong alignment on UReferAFriendEntry_C");
static_assert(sizeof(UReferAFriendEntry_C) == 0x001060, "Wrong size on UReferAFriendEntry_C");
static_assert(offsetof(UReferAFriendEntry_C, UberGraphFrame) == 0x001010, "Member 'UReferAFriendEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UReferAFriendEntry_C, Selected) == 0x001018, "Member 'UReferAFriendEntry_C::Selected' has a wrong offset!");
static_assert(offsetof(UReferAFriendEntry_C, Hovered) == 0x001020, "Member 'UReferAFriendEntry_C::Hovered' has a wrong offset!");
static_assert(offsetof(UReferAFriendEntry_C, AnimatedInputBorder) == 0x001028, "Member 'UReferAFriendEntry_C::AnimatedInputBorder' has a wrong offset!");
static_assert(offsetof(UReferAFriendEntry_C, Arrow) == 0x001030, "Member 'UReferAFriendEntry_C::Arrow' has a wrong offset!");
static_assert(offsetof(UReferAFriendEntry_C, EmptyButtonToEatOneMouseUpEvent) == 0x001038, "Member 'UReferAFriendEntry_C::EmptyButtonToEatOneMouseUpEvent' has a wrong offset!");
static_assert(offsetof(UReferAFriendEntry_C, EntryBorder) == 0x001040, "Member 'UReferAFriendEntry_C::EntryBorder' has a wrong offset!");
static_assert(offsetof(UReferAFriendEntry_C, Exclamation) == 0x001048, "Member 'UReferAFriendEntry_C::Exclamation' has a wrong offset!");
static_assert(offsetof(UReferAFriendEntry_C, Text_MissedInvitesText) == 0x001050, "Member 'UReferAFriendEntry_C::Text_MissedInvitesText' has a wrong offset!");
static_assert(offsetof(UReferAFriendEntry_C, UserActionMenuInputButton) == 0x001058, "Member 'UReferAFriendEntry_C::UserActionMenuInputButton' has a wrong offset!");

}

