#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShowdownLobbyPanel

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function ShowdownLobbyPanel.ShowdownLobbyPanel_C.BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ShowdownLobbyPanel.ShowdownLobbyPanel_C.BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ShowdownLobbyPanel.ShowdownLobbyPanel_C.BrandingToggle
// 0x0001 (0x0001 - 0x0000)
struct ShowdownLobbyPanel_C_BrandingToggle final
{
public:
	bool                                          hasBranding;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownLobbyPanel_C_BrandingToggle) == 0x000001, "Wrong alignment on ShowdownLobbyPanel_C_BrandingToggle");
static_assert(sizeof(ShowdownLobbyPanel_C_BrandingToggle) == 0x000001, "Wrong size on ShowdownLobbyPanel_C_BrandingToggle");
static_assert(offsetof(ShowdownLobbyPanel_C_BrandingToggle, hasBranding) == 0x000000, "Member 'ShowdownLobbyPanel_C_BrandingToggle::hasBranding' has a wrong offset!");

// Function ShowdownLobbyPanel.ShowdownLobbyPanel_C.EventSwitchUI
// 0x0001 (0x0001 - 0x0000)
struct ShowdownLobbyPanel_C_EventSwitchUI final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownLobbyPanel_C_EventSwitchUI) == 0x000001, "Wrong alignment on ShowdownLobbyPanel_C_EventSwitchUI");
static_assert(sizeof(ShowdownLobbyPanel_C_EventSwitchUI) == 0x000001, "Wrong size on ShowdownLobbyPanel_C_EventSwitchUI");
static_assert(offsetof(ShowdownLobbyPanel_C_EventSwitchUI, bNewInputType) == 0x000000, "Member 'ShowdownLobbyPanel_C_EventSwitchUI::bNewInputType' has a wrong offset!");

// Function ShowdownLobbyPanel.ShowdownLobbyPanel_C.ExecuteUbergraph_ShowdownLobbyPanel
// 0x0150 (0x0150 - 0x0000)
struct ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;            // 0x0010(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_2;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingGamepad_ReturnValue;               // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_3;                             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_1;               // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x005C(0x0014)()
	float                                         K2Node_Select_Default;                             // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0074(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button;                 // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStartTime_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStartTime_ReturnValue_1;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue_1;                 // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue_1;             // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue_2;             // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue_3;             // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00E0(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_4;                             // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_1;          // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_5;                             // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_2;                           // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_hasBranding;                    // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_3;                           // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_4;                           // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x013C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel) == 0x000008, "Wrong alignment on ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel");
static_assert(sizeof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel) == 0x000150, "Wrong size on ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, EntryPoint) == 0x000000, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_CustomEvent_bNewInputType) == 0x000004, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, Temp_byte_Variable) == 0x00001C, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, Temp_byte_Variable_1) == 0x00001D, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, Temp_bool_Variable) == 0x00001E, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, Temp_bool_Variable_1) == 0x00001F, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, Temp_float_Variable) == 0x000020, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, Temp_float_Variable_1) == 0x000024, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, Temp_bool_Variable_2) == 0x000028, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, Temp_bool_Variable_3) == 0x000029, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_GetContext_ReturnValue) == 0x000030, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, Temp_float_Variable_2) == 0x000038, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_IsUsingGamepad_ReturnValue) == 0x00003C, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, Temp_float_Variable_3) == 0x000040, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_ComponentBoundEvent_Button_1) == 0x000048, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000050, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, Temp_bool_Variable_4) == 0x000058, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_MakeStruct_SlateColor) == 0x00005C, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_Select_Default) == 0x000070, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_MakeStruct_Margin) == 0x000074, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_ComponentBoundEvent_Button) == 0x000088, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_GetStartTime_ReturnValue) == 0x000090, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_GetStartTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_GetEndTime_ReturnValue) == 0x000094, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_GetStartTime_ReturnValue_1) == 0x000098, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_GetStartTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_GetEndTime_ReturnValue_1) == 0x00009C, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_GetEndTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_GetContext_ReturnValue_1) == 0x0000A0, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_PauseAnimation_ReturnValue) == 0x0000A8, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_PauseAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_PauseAnimation_ReturnValue_1) == 0x0000AC, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_PauseAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0000B0, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000B4, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_PlayAnimation_ReturnValue) == 0x0000B8, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000C0, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_PauseAnimation_ReturnValue_2) == 0x0000C4, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_PauseAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_PauseAnimation_ReturnValue_3) == 0x0000C8, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_PauseAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x0000CC, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0000D0, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x0000D4, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000D8, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000E0, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x0000F0, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, Temp_float_Variable_4) == 0x0000F8, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::Temp_float_Variable_4' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_Event_IsDesignTime) == 0x0000FC, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_SlotAsOverlaySlot_ReturnValue_1) == 0x000100, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_SlotAsOverlaySlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, Temp_bool_Variable_5) == 0x000108, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, Temp_float_Variable_5) == 0x00010C, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::Temp_float_Variable_5' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_Select_Default_1) == 0x000110, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_PlayAnimation_ReturnValue_2) == 0x000118, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_Select_Default_2) == 0x000120, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_CustomEvent_hasBranding) == 0x000124, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_CustomEvent_hasBranding' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_PlayAnimation_ReturnValue_3) == 0x000128, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_Select_Default_3) == 0x000130, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_Select_Default_4) == 0x000138, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_MakeStruct_Margin_1) == 0x00013C, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_Select_Default_5) == 0x00014C, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_Select_Default_5' has a wrong offset!");

// Function ShowdownLobbyPanel.ShowdownLobbyPanel_C.InputTypeChanged
// 0x0001 (0x0001 - 0x0000)
struct ShowdownLobbyPanel_C_InputTypeChanged final
{
public:
	bool                                          isGamepad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownLobbyPanel_C_InputTypeChanged) == 0x000001, "Wrong alignment on ShowdownLobbyPanel_C_InputTypeChanged");
static_assert(sizeof(ShowdownLobbyPanel_C_InputTypeChanged) == 0x000001, "Wrong size on ShowdownLobbyPanel_C_InputTypeChanged");
static_assert(offsetof(ShowdownLobbyPanel_C_InputTypeChanged, isGamepad) == 0x000000, "Member 'ShowdownLobbyPanel_C_InputTypeChanged::isGamepad' has a wrong offset!");

// Function ShowdownLobbyPanel.ShowdownLobbyPanel_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ShowdownLobbyPanel_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownLobbyPanel_C_PreConstruct) == 0x000001, "Wrong alignment on ShowdownLobbyPanel_C_PreConstruct");
static_assert(sizeof(ShowdownLobbyPanel_C_PreConstruct) == 0x000001, "Wrong size on ShowdownLobbyPanel_C_PreConstruct");
static_assert(offsetof(ShowdownLobbyPanel_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ShowdownLobbyPanel_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ShowdownLobbyPanel.ShowdownLobbyPanel_C.Refresh
// 0x03A8 (0x03A8 - 0x0000)
struct ShowdownLobbyPanel_C_Refresh final
{
public:
	EFortShowdownEventState                       Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0038(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0050(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0068(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x0080(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x00A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UsesScheduledMatchmaking_ReturnValue;     // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UsesScheduledMatchmaking_ReturnValue_1;   // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UsesScheduledMatchmaking_ReturnValue_2;   // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AE[0x2];                                       // 0x00AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTournamentSeriesId_ReturnValue;        // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentEventScore_ReturnValue;         // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTournamentPinUnlockScore_ReturnValue;  // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWorldCupQualifierEvent_ReturnValue;     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortShowdownEventState                       CallFunc_GetEventTimeState_ReturnValue;            // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoCalloutMFARequirement_ReturnValue;      // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoCalloutMFARequirement_ReturnValue_1;    // 0x00D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D7[0x1];                                       // 0x00D7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTournamentPinUnlockScore_ReturnValue_1; // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTournamentMatchCap_ReturnValue;        // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentEventTeamNumMatchesPlayed_ReturnValue; // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTournamentMatchCap_ReturnValue_1;      // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0100(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0150(0x0010)(ReferenceParm)
	int32                                         CallFunc_GetCurrentEventTeamNumMatchesPlayed_ReturnValue_1; // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0168(0x0018)()
	int32                                         CallFunc_GetTournamentMatchCap_ReturnValue_2;      // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x018B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x018E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18F[0x1];                                      // 0x018F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_2;                           // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0198(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x01B0(0x0018)()
	int32                                         CallFunc_GetCurrentEventScore_ReturnValue_1;       // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_3;                           // 0x01D0(0x0018)()
	int32                                         CallFunc_GetBestEventScore_ReturnValue;            // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0200(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0250(0x0010)(ReferenceParm)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0268(0x0018)()
	int32                                         CallFunc_GetCurrentEventScore_ReturnValue_2;       // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0288(0x0018)()
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue;               // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStartTime_ReturnValue;                 // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x02B4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_PauseAnimation_ReturnValue_1;             // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_2;                             // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x02E0(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x02F8(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue_1;                // 0x0310(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue_2;                // 0x0328(0x0018)()
	int32                                         CallFunc_GetTournamentPinUnlockScore_ReturnValue_2; // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_2;        // 0x0344(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_3;        // 0x0345(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0346(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_347[0x1];                                      // 0x0347(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0348(0x0018)()
	class UWidget*                                K2Node_Select_Default_5;                           // 0x0360(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_6;                           // 0x0369(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36A[0x2];                                      // 0x036A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTournamentPinUnlockScore_ReturnValue_3; // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0370(0x0018)()
	class FString                                 CallFunc_GetEventId_ReturnValue;                   // 0x0388(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x0399(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39A[0x2];                                      // 0x039A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_7;                           // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownLobbyPanel_C_Refresh) == 0x000008, "Wrong alignment on ShowdownLobbyPanel_C_Refresh");
static_assert(sizeof(ShowdownLobbyPanel_C_Refresh) == 0x0003A8, "Wrong size on ShowdownLobbyPanel_C_Refresh");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, Temp_byte_Variable) == 0x000000, "Member 'ShowdownLobbyPanel_C_Refresh::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, Temp_text_Variable) == 0x000008, "Member 'ShowdownLobbyPanel_C_Refresh::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, Temp_text_Variable_1) == 0x000020, "Member 'ShowdownLobbyPanel_C_Refresh::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, Temp_text_Variable_2) == 0x000038, "Member 'ShowdownLobbyPanel_C_Refresh::Temp_text_Variable_2' has a wrong offset!");
