#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShowdownScreen

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ShowdownScreen.ShowdownScreen_C.BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ShowdownScreen_C_BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownScreen_C_BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ShowdownScreen_C_BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ShowdownScreen_C_BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ShowdownScreen_C_BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ShowdownScreen_C_BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ShowdownScreen_C_BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ShowdownScreen.ShowdownScreen_C.BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ShowdownScreen_C_BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownScreen_C_BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ShowdownScreen_C_BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ShowdownScreen_C_BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ShowdownScreen_C_BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ShowdownScreen_C_BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ShowdownScreen_C_BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ShowdownScreen.ShowdownScreen_C.BndEvt__ListView_TournamentList_K2Node_ComponentBoundEvent_5_OnListItemSelectionChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct ShowdownScreen_C_BndEvt__ListView_TournamentList_K2Node_ComponentBoundEvent_5_OnListItemSelectionChangedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownScreen_C_BndEvt__ListView_TournamentList_K2Node_ComponentBoundEvent_5_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on ShowdownScreen_C_BndEvt__ListView_TournamentList_K2Node_ComponentBoundEvent_5_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(sizeof(ShowdownScreen_C_BndEvt__ListView_TournamentList_K2Node_ComponentBoundEvent_5_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000010, "Wrong size on ShowdownScreen_C_BndEvt__ListView_TournamentList_K2Node_ComponentBoundEvent_5_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(offsetof(ShowdownScreen_C_BndEvt__ListView_TournamentList_K2Node_ComponentBoundEvent_5_OnListItemSelectionChangedDynamic__DelegateSignature, Item) == 0x000000, "Member 'ShowdownScreen_C_BndEvt__ListView_TournamentList_K2Node_ComponentBoundEvent_5_OnListItemSelectionChangedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_BndEvt__ListView_TournamentList_K2Node_ComponentBoundEvent_5_OnListItemSelectionChangedDynamic__DelegateSignature, bIsSelected) == 0x000008, "Member 'ShowdownScreen_C_BndEvt__ListView_TournamentList_K2Node_ComponentBoundEvent_5_OnListItemSelectionChangedDynamic__DelegateSignature::bIsSelected' has a wrong offset!");

// Function ShowdownScreen.ShowdownScreen_C.ExecuteUbergraph_ShowdownScreen
// 0x01D0 (0x01D0 - 0x0000)
struct ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UShowdownTournamentTile_C*              K2Node_DynamicCast_AsShowdown_Tournament_Tile;     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTournamentListEntryData*               CallFunc_GetTournamentListEntryData_ReturnValue;   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_1;               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button;                 // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bUsingGamepad;                        // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_GetSafeZonePadding_SafePadding;           // 0x0050(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSafeZonePadding_SafePaddingScale;      // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector4                               CallFunc_GetSafeZonePadding_SpillOverPadding;      // 0x0080(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector4_X;                           // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector4_Y;                           // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector4_Z;                           // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector4_W;                           // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_CustomEvent_CurrentWidget;                  // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_3;        // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00D8(0x0040)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x011C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bFrontIsSelected;                     // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEndIsSelected;                       // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12E[0x2];                                      // 0x012E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0130(0x0010)(NoDestructor)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle_1;            // 0x0140(0x0010)(NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_162[0x2];                                      // 0x0162(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetIndexForItem_ReturnValue;              // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumItems_ReturnValue;                  // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0175(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_176[0x2];                                      // 0x0176(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x017D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17E[0x2];                                      // 0x017E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetEntryAtIndex_ReturnValue;              // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UShowdownTournamentTile_C*              K2Node_DynamicCast_AsShowdown_Tournament_Tile_1;   // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UShowdownTournamentTile_C*              K2Node_DynamicCast_AsShowdown_Tournament_Tile_2;   // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected;            // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumItems_ReturnValue_1;                // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_1;                           // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen) == 0x000010, "Wrong alignment on ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen");
static_assert(sizeof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen) == 0x0001D0, "Wrong size on ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, EntryPoint) == 0x000000, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, Temp_byte_Variable) == 0x000004, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, Temp_int_Variable) == 0x000008, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, K2Node_DynamicCast_AsShowdown_Tournament_Tile) == 0x000010, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::K2Node_DynamicCast_AsShowdown_Tournament_Tile' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, CallFunc_GetTournamentListEntryData_ReturnValue) == 0x000020, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::CallFunc_GetTournamentListEntryData_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, K2Node_Event_IsDesignTime) == 0x00002C, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, K2Node_ComponentBoundEvent_Button_1) == 0x000038, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, K2Node_ComponentBoundEvent_Button) == 0x000040, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, K2Node_Event_bUsingGamepad) == 0x000048, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::K2Node_Event_bUsingGamepad' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, CallFunc_GetSafeZonePadding_SafePadding) == 0x000050, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::CallFunc_GetSafeZonePadding_SafePadding' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, CallFunc_GetSafeZonePadding_SafePaddingScale) == 0x000070, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::CallFunc_GetSafeZonePadding_SafePaddingScale' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, CallFunc_GetSafeZonePadding_SpillOverPadding) == 0x000080, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::CallFunc_GetSafeZonePadding_SpillOverPadding' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, CallFunc_BreakVector4_X) == 0x0000A0, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::CallFunc_BreakVector4_X' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, CallFunc_BreakVector4_Y) == 0x0000A4, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::CallFunc_BreakVector4_Y' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, CallFunc_BreakVector4_Z) == 0x0000A8, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::CallFunc_BreakVector4_Z' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, CallFunc_BreakVector4_W) == 0x0000AC, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::CallFunc_BreakVector4_W' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x0000B0, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, Temp_byte_Variable_1) == 0x0000B8, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, K2Node_CustomEvent_CurrentWidget) == 0x0000C0, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::K2Node_CustomEvent_CurrentWidget' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000C8, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x0000CC, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x0000D0, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, CallFunc_Subtract_FloatFloat_ReturnValue_3) == 0x0000D4, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::CallFunc_Subtract_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, K2Node_Event_MyGeometry) == 0x0000D8, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, K2Node_Event_InDeltaTime) == 0x000118, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, K2Node_MakeStruct_Margin) == 0x00011C, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, K2Node_Event_bFrontIsSelected) == 0x00012C, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::K2Node_Event_bFrontIsSelected' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, K2Node_Event_bEndIsSelected) == 0x00012D, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::K2Node_Event_bEndIsSelected' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, K2Node_MakeStruct_DataTableRowHandle) == 0x000130, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, K2Node_MakeStruct_DataTableRowHandle_1) == 0x000140, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::K2Node_MakeStruct_DataTableRowHandle_1' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, Temp_bool_Variable) == 0x000150, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, CallFunc_GetContext_ReturnValue) == 0x000158, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, K2Node_Select_Default) == 0x000160, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, Temp_bool_Variable_1) == 0x000161, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, CallFunc_GetIndexForItem_ReturnValue) == 0x000164, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::CallFunc_GetIndexForItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, CallFunc_GetNumItems_ReturnValue) == 0x000168, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::CallFunc_GetNumItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, CallFunc_Add_IntInt_ReturnValue_1) == 0x00016C, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, CallFunc_Subtract_IntInt_ReturnValue) == 0x000170, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, CallFunc_Greater_IntInt_ReturnValue) == 0x000174, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000175, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000178, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, CallFunc_Less_IntInt_ReturnValue) == 0x00017C, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, CallFunc_BooleanOR_ReturnValue) == 0x00017D, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, CallFunc_GetEntryAtIndex_ReturnValue) == 0x000180, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::CallFunc_GetEntryAtIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, K2Node_DynamicCast_AsShowdown_Tournament_Tile_1) == 0x000188, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::K2Node_DynamicCast_AsShowdown_Tournament_Tile_1' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, K2Node_DynamicCast_bSuccess_1) == 0x000190, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, K2Node_DynamicCast_AsShowdown_Tournament_Tile_2) == 0x000198, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::K2Node_DynamicCast_AsShowdown_Tournament_Tile_2' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, K2Node_DynamicCast_bSuccess_2) == 0x0001A0, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, K2Node_ComponentBoundEvent_Item) == 0x0001A8, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::K2Node_ComponentBoundEvent_Item' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, K2Node_ComponentBoundEvent_bIsSelected) == 0x0001B0, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::K2Node_ComponentBoundEvent_bIsSelected' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, CallFunc_GetNumItems_ReturnValue_1) == 0x0001B4, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::CallFunc_GetNumItems_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0001B8, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, K2Node_Select_Default_1) == 0x0001C0, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen, CallFunc_BooleanAND_ReturnValue) == 0x0001C8, "Member 'ShowdownScreen_C_ExecuteUbergraph_ShowdownScreen::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function ShowdownScreen.ShowdownScreen_C.OnInputModeChanged
// 0x0001 (0x0001 - 0x0000)
struct ShowdownScreen_C_OnInputModeChanged final
{
public:
	bool                                          bUsingGamepad;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownScreen_C_OnInputModeChanged) == 0x000001, "Wrong alignment on ShowdownScreen_C_OnInputModeChanged");
static_assert(sizeof(ShowdownScreen_C_OnInputModeChanged) == 0x000001, "Wrong size on ShowdownScreen_C_OnInputModeChanged");
static_assert(offsetof(ShowdownScreen_C_OnInputModeChanged, bUsingGamepad) == 0x000000, "Member 'ShowdownScreen_C_OnInputModeChanged::bUsingGamepad' has a wrong offset!");

// Function ShowdownScreen.ShowdownScreen_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ShowdownScreen_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownScreen_C_PreConstruct) == 0x000001, "Wrong alignment on ShowdownScreen_C_PreConstruct");
static_assert(sizeof(ShowdownScreen_C_PreConstruct) == 0x000001, "Wrong size on ShowdownScreen_C_PreConstruct");
static_assert(offsetof(ShowdownScreen_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ShowdownScreen_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ShowdownScreen.ShowdownScreen_C.SelectedEndTournament
// 0x0001 (0x0001 - 0x0000)
struct ShowdownScreen_C_SelectedEndTournament final
{
public:
	bool                                          bEndIsSelected;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownScreen_C_SelectedEndTournament) == 0x000001, "Wrong alignment on ShowdownScreen_C_SelectedEndTournament");
static_assert(sizeof(ShowdownScreen_C_SelectedEndTournament) == 0x000001, "Wrong size on ShowdownScreen_C_SelectedEndTournament");
static_assert(offsetof(ShowdownScreen_C_SelectedEndTournament, bEndIsSelected) == 0x000000, "Member 'ShowdownScreen_C_SelectedEndTournament::bEndIsSelected' has a wrong offset!");

// Function ShowdownScreen.ShowdownScreen_C.SelectedFrontTournament
// 0x0001 (0x0001 - 0x0000)
struct ShowdownScreen_C_SelectedFrontTournament final
{
public:
	bool                                          bFrontIsSelected;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownScreen_C_SelectedFrontTournament) == 0x000001, "Wrong alignment on ShowdownScreen_C_SelectedFrontTournament");
static_assert(sizeof(ShowdownScreen_C_SelectedFrontTournament) == 0x000001, "Wrong size on ShowdownScreen_C_SelectedFrontTournament");
static_assert(offsetof(ShowdownScreen_C_SelectedFrontTournament, bFrontIsSelected) == 0x000000, "Member 'ShowdownScreen_C_SelectedFrontTournament::bFrontIsSelected' has a wrong offset!");

// Function ShowdownScreen.ShowdownScreen_C.Tick
// 0x0048 (0x0048 - 0x0000)
struct ShowdownScreen_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownScreen_C_Tick) == 0x000008, "Wrong alignment on ShowdownScreen_C_Tick");
static_assert(sizeof(ShowdownScreen_C_Tick) == 0x000048, "Wrong size on ShowdownScreen_C_Tick");
static_assert(offsetof(ShowdownScreen_C_Tick, MyGeometry) == 0x000000, "Member 'ShowdownScreen_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(ShowdownScreen_C_Tick, InDeltaTime) == 0x000040, "Member 'ShowdownScreen_C_Tick::InDeltaTime' has a wrong offset!");

// Function ShowdownScreen.ShowdownScreen_C.TournamentListSelect
// 0x0008 (0x0008 - 0x0000)
struct ShowdownScreen_C_TournamentListSelect final
{
public:
	class UWidget*                                CurrentWidget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownScreen_C_TournamentListSelect) == 0x000008, "Wrong alignment on ShowdownScreen_C_TournamentListSelect");
static_assert(sizeof(ShowdownScreen_C_TournamentListSelect) == 0x000008, "Wrong size on ShowdownScreen_C_TournamentListSelect");
static_assert(offsetof(ShowdownScreen_C_TournamentListSelect, CurrentWidget) == 0x000000, "Member 'ShowdownScreen_C_TournamentListSelect::CurrentWidget' has a wrong offset!");

}

