#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShowdownEventTile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUILegacy_classes.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ShowdownEventTile.ShowdownEventTile_C
// 0x00B0 (0x10A0 - 0x0FF0)
class UShowdownEventTile_C final : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_FE8[0x8];                                      // 0x0FE8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0FF0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Focus_Violator;                                    // 0x0FF8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x1000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Focus;                                             // 0x1008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TransitionSize;                                    // 0x1010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x1018(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_InputContainer;                       // 0x1020(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x1028(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Ended;                                       // 0x1030(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Focus;                                       // 0x1038(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Hover;                                       // 0x1040(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Tail;                                        // 0x1048(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShowdownEventTile_RoundBreak_C*        ShowdownEventTile_RoundBreak;                      // 0x1050(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShowdownEventTileInfo_C*               ShowdownEventTileInfo;                             // 0x1058(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShowdownEventTileViolator_C*           Violator;                                          // 0x1060(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 EventId;                                           // 0x1068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          isEnded;                                           // 0x1078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLive;                                            // 0x1079(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_107A[0x6];                                     // 0x107A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnWindowSelected;                                  // 0x1080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FString                                 TournamentId;                                      // 0x1090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)

public:
	void BP_OnClicked();
	void BP_OnDeselected();
	void BP_OnHovered();
	void BP_OnSelected();
	void BP_OnUnhovered();
	void Construct();
	void EventColorize(const struct FFortTournamentDisplayInfo& DisplayInfo);
	void EventColorizeDispatch(const struct FFortTournamentDisplayInfo& DisplayInfo);
	void EventIntro(int32 Index_0);
	void EventMultiRoundStyle();
	void EventResize(bool Out);
	void EventSetState(EFortShowdownEventState EventState);
	void ExecuteUbergraph_ShowdownEventTile(int32 EntryPoint);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void SetData(const class FString& TournamentInfo, const class FString& EventInfo);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ShowdownEventTile_C">();
	}
	static class UShowdownEventTile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShowdownEventTile_C>();
	}
};
static_assert(alignof(UShowdownEventTile_C) == 0x000010, "Wrong alignment on UShowdownEventTile_C");
static_assert(sizeof(UShowdownEventTile_C) == 0x0010A0, "Wrong size on UShowdownEventTile_C");
static_assert(offsetof(UShowdownEventTile_C, UberGraphFrame) == 0x000FF0, "Member 'UShowdownEventTile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UShowdownEventTile_C, Focus_Violator) == 0x000FF8, "Member 'UShowdownEventTile_C::Focus_Violator' has a wrong offset!");
static_assert(offsetof(UShowdownEventTile_C, Hover) == 0x001000, "Member 'UShowdownEventTile_C::Hover' has a wrong offset!");
static_assert(offsetof(UShowdownEventTile_C, Focus) == 0x001008, "Member 'UShowdownEventTile_C::Focus' has a wrong offset!");
static_assert(offsetof(UShowdownEventTile_C, TransitionSize) == 0x001010, "Member 'UShowdownEventTile_C::TransitionSize' has a wrong offset!");
static_assert(offsetof(UShowdownEventTile_C, Intro) == 0x001018, "Member 'UShowdownEventTile_C::Intro' has a wrong offset!");
static_assert(offsetof(UShowdownEventTile_C, CommonBorder_InputContainer) == 0x001020, "Member 'UShowdownEventTile_C::CommonBorder_InputContainer' has a wrong offset!");
static_assert(offsetof(UShowdownEventTile_C, Image_BG) == 0x001028, "Member 'UShowdownEventTile_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UShowdownEventTile_C, Image_Ended) == 0x001030, "Member 'UShowdownEventTile_C::Image_Ended' has a wrong offset!");
static_assert(offsetof(UShowdownEventTile_C, Image_Focus) == 0x001038, "Member 'UShowdownEventTile_C::Image_Focus' has a wrong offset!");
static_assert(offsetof(UShowdownEventTile_C, Image_Hover) == 0x001040, "Member 'UShowdownEventTile_C::Image_Hover' has a wrong offset!");
static_assert(offsetof(UShowdownEventTile_C, Image_Tail) == 0x001048, "Member 'UShowdownEventTile_C::Image_Tail' has a wrong offset!");
static_assert(offsetof(UShowdownEventTile_C, ShowdownEventTile_RoundBreak) == 0x001050, "Member 'UShowdownEventTile_C::ShowdownEventTile_RoundBreak' has a wrong offset!");
static_assert(offsetof(UShowdownEventTile_C, ShowdownEventTileInfo) == 0x001058, "Member 'UShowdownEventTile_C::ShowdownEventTileInfo' has a wrong offset!");
static_assert(offsetof(UShowdownEventTile_C, Violator) == 0x001060, "Member 'UShowdownEventTile_C::Violator' has a wrong offset!");
static_assert(offsetof(UShowdownEventTile_C, EventId) == 0x001068, "Member 'UShowdownEventTile_C::EventId' has a wrong offset!");
static_assert(offsetof(UShowdownEventTile_C, isEnded) == 0x001078, "Member 'UShowdownEventTile_C::isEnded' has a wrong offset!");
static_assert(offsetof(UShowdownEventTile_C, IsLive) == 0x001079, "Member 'UShowdownEventTile_C::IsLive' has a wrong offset!");
static_assert(offsetof(UShowdownEventTile_C, OnWindowSelected) == 0x001080, "Member 'UShowdownEventTile_C::OnWindowSelected' has a wrong offset!");
static_assert(offsetof(UShowdownEventTile_C, TournamentId) == 0x001090, "Member 'UShowdownEventTile_C::TournamentId' has a wrong offset!");

}

