#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarInteraction_Profile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarInteraction_Profile.SidebarInteraction_Profile_C
// 0x0060 (0x1110 - 0x10B0)
class USidebarInteraction_Profile_C final : public UFortSidebarSocialInteractionButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x10B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHover;                                           // 0x10B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 EncourageEpicFriend;                               // 0x10C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arrow;                                       // 0x10C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuAnchor*                            MenuAnchor_Actions;                                // 0x10D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x10D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           EncourageEpicFriend_IdleColor;                     // 0x10E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EncourageEpicFriend_HoveredColor;                  // 0x10F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           AddFriendColor;                                    // 0x1100(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_SidebarInteraction_Profile(int32 EntryPoint);
	void OnInitialized();
	void OnInteractionSet();
	void SetArrow();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarInteraction_Profile_C">();
	}
	static class USidebarInteraction_Profile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarInteraction_Profile_C>();
	}
};
static_assert(alignof(USidebarInteraction_Profile_C) == 0x000010, "Wrong alignment on USidebarInteraction_Profile_C");
static_assert(sizeof(USidebarInteraction_Profile_C) == 0x001110, "Wrong size on USidebarInteraction_Profile_C");
static_assert(offsetof(USidebarInteraction_Profile_C, UberGraphFrame) == 0x0010B0, "Member 'USidebarInteraction_Profile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarInteraction_Profile_C, OnHover) == 0x0010B8, "Member 'USidebarInteraction_Profile_C::OnHover' has a wrong offset!");
static_assert(offsetof(USidebarInteraction_Profile_C, EncourageEpicFriend) == 0x0010C0, "Member 'USidebarInteraction_Profile_C::EncourageEpicFriend' has a wrong offset!");
static_assert(offsetof(USidebarInteraction_Profile_C, Image_Arrow) == 0x0010C8, "Member 'USidebarInteraction_Profile_C::Image_Arrow' has a wrong offset!");
static_assert(offsetof(USidebarInteraction_Profile_C, MenuAnchor_Actions) == 0x0010D0, "Member 'USidebarInteraction_Profile_C::MenuAnchor_Actions' has a wrong offset!");
static_assert(offsetof(USidebarInteraction_Profile_C, SizeBox_0) == 0x0010D8, "Member 'USidebarInteraction_Profile_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(USidebarInteraction_Profile_C, EncourageEpicFriend_IdleColor) == 0x0010E0, "Member 'USidebarInteraction_Profile_C::EncourageEpicFriend_IdleColor' has a wrong offset!");
static_assert(offsetof(USidebarInteraction_Profile_C, EncourageEpicFriend_HoveredColor) == 0x0010F0, "Member 'USidebarInteraction_Profile_C::EncourageEpicFriend_HoveredColor' has a wrong offset!");
static_assert(offsetof(USidebarInteraction_Profile_C, AddFriendColor) == 0x001100, "Member 'USidebarInteraction_Profile_C::AddFriendColor' has a wrong offset!");

}

