#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarAthenaLeaveButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarAthenaLeaveButton.SidebarAthenaLeaveButton_C
// 0x0020 (0x1160 - 0x1140)
class USidebarAthenaLeaveButton_C final : public UFortMainMenuLeaveButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1140(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hovered;                                           // 0x1148(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                ButtonBackground;                                  // 0x1150(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInterface*                     ButtonMaterial;                                    // 0x1158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_SidebarAthenaLeaveButton(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarAthenaLeaveButton_C">();
	}
	static class USidebarAthenaLeaveButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarAthenaLeaveButton_C>();
	}
};
static_assert(alignof(USidebarAthenaLeaveButton_C) == 0x000010, "Wrong alignment on USidebarAthenaLeaveButton_C");
static_assert(sizeof(USidebarAthenaLeaveButton_C) == 0x001160, "Wrong size on USidebarAthenaLeaveButton_C");
static_assert(offsetof(USidebarAthenaLeaveButton_C, UberGraphFrame) == 0x001140, "Member 'USidebarAthenaLeaveButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarAthenaLeaveButton_C, Hovered) == 0x001148, "Member 'USidebarAthenaLeaveButton_C::Hovered' has a wrong offset!");
static_assert(offsetof(USidebarAthenaLeaveButton_C, ButtonBackground) == 0x001150, "Member 'USidebarAthenaLeaveButton_C::ButtonBackground' has a wrong offset!");
static_assert(offsetof(USidebarAthenaLeaveButton_C, ButtonMaterial) == 0x001158, "Member 'USidebarAthenaLeaveButton_C::ButtonMaterial' has a wrong offset!");

}

