#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarReferAFriendEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarReferAFriendEntry.SidebarReferAFriendEntry_C
// 0x0040 (0x1050 - 0x1010)
class USidebarReferAFriendEntry_C final : public UFortReferFriendListEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1010(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x1018(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x1020(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UIconTextButton_C*                      EmptyButtonToEatOneMouseUpEvent;                   // 0x1028(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                EntryBorder;                                       // 0x1030(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_MissedInvitesText;                            // 0x1038(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_MissedInvitesText_Hover;                      // 0x1040(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_SidebarReferAFriendEntry(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarReferAFriendEntry_C">();
	}
	static class USidebarReferAFriendEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarReferAFriendEntry_C>();
	}
};
static_assert(alignof(USidebarReferAFriendEntry_C) == 0x000010, "Wrong alignment on USidebarReferAFriendEntry_C");
static_assert(sizeof(USidebarReferAFriendEntry_C) == 0x001050, "Wrong size on USidebarReferAFriendEntry_C");
static_assert(offsetof(USidebarReferAFriendEntry_C, UberGraphFrame) == 0x001010, "Member 'USidebarReferAFriendEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarReferAFriendEntry_C, Selected) == 0x001018, "Member 'USidebarReferAFriendEntry_C::Selected' has a wrong offset!");
static_assert(offsetof(USidebarReferAFriendEntry_C, Hovered) == 0x001020, "Member 'USidebarReferAFriendEntry_C::Hovered' has a wrong offset!");
static_assert(offsetof(USidebarReferAFriendEntry_C, EmptyButtonToEatOneMouseUpEvent) == 0x001028, "Member 'USidebarReferAFriendEntry_C::EmptyButtonToEatOneMouseUpEvent' has a wrong offset!");
static_assert(offsetof(USidebarReferAFriendEntry_C, EntryBorder) == 0x001030, "Member 'USidebarReferAFriendEntry_C::EntryBorder' has a wrong offset!");
static_assert(offsetof(USidebarReferAFriendEntry_C, Text_MissedInvitesText) == 0x001038, "Member 'USidebarReferAFriendEntry_C::Text_MissedInvitesText' has a wrong offset!");
static_assert(offsetof(USidebarReferAFriendEntry_C, Text_MissedInvitesText_Hover) == 0x001040, "Member 'USidebarReferAFriendEntry_C::Text_MissedInvitesText_Hover' has a wrong offset!");

}

