#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarReferAFriendActionMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarReferAFriendActionMenu.SidebarReferAFriendActionMenu_C
// 0x0040 (0x0440 - 0x0400)
class USidebarReferAFriendActionMenu_C final : public UFortReferFriendActionMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ConfirmationOpened;                                // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Opened;                                            // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock;                               // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock_143;                           // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_AddFriendsQR;                                // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PartyUpQR;                                   // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_QR;                                 // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SidebarReferAFriendActionMenu(int32 EntryPoint);
	struct FEventReply OnKeyUp(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void OnOpened();
	void OnRequestOriginChanged(EReferFriendOrigin RequestOrigin);
	void Set_QRt_Image(EReferFriendOrigin Origin);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarReferAFriendActionMenu_C">();
	}
	static class USidebarReferAFriendActionMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarReferAFriendActionMenu_C>();
	}
};
static_assert(alignof(USidebarReferAFriendActionMenu_C) == 0x000008, "Wrong alignment on USidebarReferAFriendActionMenu_C");
static_assert(sizeof(USidebarReferAFriendActionMenu_C) == 0x000440, "Wrong size on USidebarReferAFriendActionMenu_C");
static_assert(offsetof(USidebarReferAFriendActionMenu_C, UberGraphFrame) == 0x000400, "Member 'USidebarReferAFriendActionMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarReferAFriendActionMenu_C, ConfirmationOpened) == 0x000408, "Member 'USidebarReferAFriendActionMenu_C::ConfirmationOpened' has a wrong offset!");
static_assert(offsetof(USidebarReferAFriendActionMenu_C, Opened) == 0x000410, "Member 'USidebarReferAFriendActionMenu_C::Opened' has a wrong offset!");
static_assert(offsetof(USidebarReferAFriendActionMenu_C, CommonRichTextBlock) == 0x000418, "Member 'USidebarReferAFriendActionMenu_C::CommonRichTextBlock' has a wrong offset!");
static_assert(offsetof(USidebarReferAFriendActionMenu_C, CommonRichTextBlock_143) == 0x000420, "Member 'USidebarReferAFriendActionMenu_C::CommonRichTextBlock_143' has a wrong offset!");
static_assert(offsetof(USidebarReferAFriendActionMenu_C, Image_AddFriendsQR) == 0x000428, "Member 'USidebarReferAFriendActionMenu_C::Image_AddFriendsQR' has a wrong offset!");
static_assert(offsetof(USidebarReferAFriendActionMenu_C, Image_PartyUpQR) == 0x000430, "Member 'USidebarReferAFriendActionMenu_C::Image_PartyUpQR' has a wrong offset!");
static_assert(offsetof(USidebarReferAFriendActionMenu_C, WidgetSwitcher_QR) == 0x000438, "Member 'USidebarReferAFriendActionMenu_C::WidgetSwitcher_QR' has a wrong offset!");

}

