#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarConfirmationButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUILegacy_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarConfirmationButton.SidebarConfirmationButton_C
// 0x0040 (0x1030 - 0x0FF0)
class USidebarConfirmationButton_C final : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_FE8[0x8];                                      // 0x0FE8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0FF0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHover;                                           // 0x0FF8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UMenuAnchor*                            MenuAnchor_Actions;                                // 0x1000(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_InteractionName;                              // 0x1008(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsAccept;                                         // 0x1010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1011[0x7];                                     // 0x1011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DisplayText;                                       // 0x1018(0x0018)(Edit, BlueprintVisible)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_SidebarConfirmationButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarConfirmationButton_C">();
	}
	static class USidebarConfirmationButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarConfirmationButton_C>();
	}
};
static_assert(alignof(USidebarConfirmationButton_C) == 0x000010, "Wrong alignment on USidebarConfirmationButton_C");
static_assert(sizeof(USidebarConfirmationButton_C) == 0x001030, "Wrong size on USidebarConfirmationButton_C");
static_assert(offsetof(USidebarConfirmationButton_C, UberGraphFrame) == 0x000FF0, "Member 'USidebarConfirmationButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarConfirmationButton_C, OnHover) == 0x000FF8, "Member 'USidebarConfirmationButton_C::OnHover' has a wrong offset!");
static_assert(offsetof(USidebarConfirmationButton_C, MenuAnchor_Actions) == 0x001000, "Member 'USidebarConfirmationButton_C::MenuAnchor_Actions' has a wrong offset!");
static_assert(offsetof(USidebarConfirmationButton_C, Text_InteractionName) == 0x001008, "Member 'USidebarConfirmationButton_C::Text_InteractionName' has a wrong offset!");
static_assert(offsetof(USidebarConfirmationButton_C, bIsAccept) == 0x001010, "Member 'USidebarConfirmationButton_C::bIsAccept' has a wrong offset!");
static_assert(offsetof(USidebarConfirmationButton_C, DisplayText) == 0x001018, "Member 'USidebarConfirmationButton_C::DisplayText' has a wrong offset!");

}

