#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialPanel_FriendLinkButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SocialPanel_FriendLinkButton.SocialPanel_FriendLinkButton_C
// 0x0050 (0x1040 - 0x0FF0)
class USocialPanel_FriendLinkButton_C final : public UFortSocialPanelView_FriendLinkButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0FF0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnCopied;                                          // 0x0FF8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHovered;                                         // 0x1000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UMenuAnchor*                            MenuAnchor_Actions;                                // 0x1008(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       SharingIcon;                                       // 0x1010(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            Switcher_CopyState;                                // 0x1018(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_CopyConfirmed;                                // 0x1020(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_FriendLinkInstructions;                       // 0x1028(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_LinkPrompt;                                   // 0x1030(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_SocialPanel_FriendLinkButton(int32 EntryPoint);
	void OnCopiedToClipboard();
	void OnShareButtonTypeSet(EFriendLinkShareButtonType Type);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SocialPanel_FriendLinkButton_C">();
	}
	static class USocialPanel_FriendLinkButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialPanel_FriendLinkButton_C>();
	}
};
static_assert(alignof(USocialPanel_FriendLinkButton_C) == 0x000010, "Wrong alignment on USocialPanel_FriendLinkButton_C");
static_assert(sizeof(USocialPanel_FriendLinkButton_C) == 0x001040, "Wrong size on USocialPanel_FriendLinkButton_C");
static_assert(offsetof(USocialPanel_FriendLinkButton_C, UberGraphFrame) == 0x000FF0, "Member 'USocialPanel_FriendLinkButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendLinkButton_C, OnCopied) == 0x000FF8, "Member 'USocialPanel_FriendLinkButton_C::OnCopied' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendLinkButton_C, OnHovered) == 0x001000, "Member 'USocialPanel_FriendLinkButton_C::OnHovered' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendLinkButton_C, MenuAnchor_Actions) == 0x001008, "Member 'USocialPanel_FriendLinkButton_C::MenuAnchor_Actions' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendLinkButton_C, SharingIcon) == 0x001010, "Member 'USocialPanel_FriendLinkButton_C::SharingIcon' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendLinkButton_C, Switcher_CopyState) == 0x001018, "Member 'USocialPanel_FriendLinkButton_C::Switcher_CopyState' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendLinkButton_C, Text_CopyConfirmed) == 0x001020, "Member 'USocialPanel_FriendLinkButton_C::Text_CopyConfirmed' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendLinkButton_C, Text_FriendLinkInstructions) == 0x001028, "Member 'USocialPanel_FriendLinkButton_C::Text_FriendLinkInstructions' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendLinkButton_C, Text_LinkPrompt) == 0x001030, "Member 'USocialPanel_FriendLinkButton_C::Text_LinkPrompt' has a wrong offset!");

}

