#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialButton_Sidebar

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SocialButton_Sidebar.SocialButton_Sidebar_C.ExecuteUbergraph_SocialButton_Sidebar
// 0x0088 (0x0088 - 0x0000)
struct SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_2;                             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue_1;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue_1;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue_2;               // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      CallFunc_SelectMaterialInstance_ReturnValue;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_1;                           // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_FriendsOnline;                        // 0x0080(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar) == 0x000008, "Wrong alignment on SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar");
static_assert(sizeof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar) == 0x000088, "Wrong size on SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, EntryPoint) == 0x000000, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::EntryPoint' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, Temp_bool_Variable) == 0x000004, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, Temp_float_Variable) == 0x000008, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, Temp_float_Variable_1) == 0x00000C, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, Temp_bool_Variable_1) == 0x000010, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, Temp_byte_Variable) == 0x000011, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, Temp_byte_Variable_1) == 0x000012, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000018, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, CallFunc_IsMobileGame_ReturnValue) == 0x000020, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000028, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, Temp_float_Variable_2) == 0x000030, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, CallFunc_BooleanAND_ReturnValue) == 0x000034, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, CallFunc_PlayAnimationForward_ReturnValue) == 0x000038, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, CallFunc_IsMobileGame_ReturnValue_1) == 0x000040, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::CallFunc_IsMobileGame_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, CallFunc_GetRuntimeOptions_ReturnValue_1) == 0x000048, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::CallFunc_GetRuntimeOptions_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, CallFunc_BooleanAND_ReturnValue_1) == 0x000050, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, CallFunc_IsMobileGame_ReturnValue_2) == 0x000051, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::CallFunc_IsMobileGame_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, CallFunc_SelectMaterialInstance_ReturnValue) == 0x000058, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::CallFunc_SelectMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, K2Node_Select_Default) == 0x000060, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, CallFunc_SelectColor_ReturnValue) == 0x000064, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, Temp_float_Variable_3) == 0x000074, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, Temp_bool_Variable_2) == 0x000078, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, K2Node_Event_IsDesignTime) == 0x000079, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, K2Node_Select_Default_1) == 0x00007C, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, K2Node_Event_FriendsOnline) == 0x000080, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::K2Node_Event_FriendsOnline' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, CallFunc_Greater_IntInt_ReturnValue) == 0x000084, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar, K2Node_Select_Default_2) == 0x000085, "Member 'SocialButton_Sidebar_C_ExecuteUbergraph_SocialButton_Sidebar::K2Node_Select_Default_2' has a wrong offset!");

// Function SocialButton_Sidebar.SocialButton_Sidebar_C.OnNumFriendsTextUpdated
// 0x0004 (0x0004 - 0x0000)
struct SocialButton_Sidebar_C_OnNumFriendsTextUpdated final
{
public:
	int32                                         FriendsOnline;                                     // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialButton_Sidebar_C_OnNumFriendsTextUpdated) == 0x000004, "Wrong alignment on SocialButton_Sidebar_C_OnNumFriendsTextUpdated");
static_assert(sizeof(SocialButton_Sidebar_C_OnNumFriendsTextUpdated) == 0x000004, "Wrong size on SocialButton_Sidebar_C_OnNumFriendsTextUpdated");
static_assert(offsetof(SocialButton_Sidebar_C_OnNumFriendsTextUpdated, FriendsOnline) == 0x000000, "Member 'SocialButton_Sidebar_C_OnNumFriendsTextUpdated::FriendsOnline' has a wrong offset!");

// Function SocialButton_Sidebar.SocialButton_Sidebar_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SocialButton_Sidebar_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialButton_Sidebar_C_PreConstruct) == 0x000001, "Wrong alignment on SocialButton_Sidebar_C_PreConstruct");
static_assert(sizeof(SocialButton_Sidebar_C_PreConstruct) == 0x000001, "Wrong size on SocialButton_Sidebar_C_PreConstruct");
static_assert(offsetof(SocialButton_Sidebar_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'SocialButton_Sidebar_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

