#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SocialButton.SocialButton_C
// 0x0070 (0x1080 - 0x1010)
class USocialButton_C final : public UFortSocialButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1010(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Indentifier_Outro;                                 // 0x1018(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Indentifier_Intro;                                 // 0x1020(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover_Grow;                                        // 0x1028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover_Bounce;                                      // 0x1030(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x1038(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortPlayerBanner*                      Banner_MemberBanner;                               // 0x1040(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ButtonBacking;                                     // 0x1048(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                IconColor;                                         // 0x1050(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       Image_FriendIcon;                                  // 0x1058(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LeaderIcon;                                  // 0x1060(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                NumFriendsColor;                                   // 0x1068(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PlayerIdentifier_Bkg;                              // 0x1070(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               VariableSize;                                      // 0x1078(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_SocialButton(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SocialButton_C">();
	}
	static class USocialButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialButton_C>();
	}
};
static_assert(alignof(USocialButton_C) == 0x000010, "Wrong alignment on USocialButton_C");
static_assert(sizeof(USocialButton_C) == 0x001080, "Wrong size on USocialButton_C");
static_assert(offsetof(USocialButton_C, UberGraphFrame) == 0x001010, "Member 'USocialButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USocialButton_C, Indentifier_Outro) == 0x001018, "Member 'USocialButton_C::Indentifier_Outro' has a wrong offset!");
static_assert(offsetof(USocialButton_C, Indentifier_Intro) == 0x001020, "Member 'USocialButton_C::Indentifier_Intro' has a wrong offset!");
static_assert(offsetof(USocialButton_C, Hover_Grow) == 0x001028, "Member 'USocialButton_C::Hover_Grow' has a wrong offset!");
static_assert(offsetof(USocialButton_C, Hover_Bounce) == 0x001030, "Member 'USocialButton_C::Hover_Bounce' has a wrong offset!");
static_assert(offsetof(USocialButton_C, Hover) == 0x001038, "Member 'USocialButton_C::Hover' has a wrong offset!");
static_assert(offsetof(USocialButton_C, Banner_MemberBanner) == 0x001040, "Member 'USocialButton_C::Banner_MemberBanner' has a wrong offset!");
static_assert(offsetof(USocialButton_C, ButtonBacking) == 0x001048, "Member 'USocialButton_C::ButtonBacking' has a wrong offset!");
static_assert(offsetof(USocialButton_C, IconColor) == 0x001050, "Member 'USocialButton_C::IconColor' has a wrong offset!");
static_assert(offsetof(USocialButton_C, Image_FriendIcon) == 0x001058, "Member 'USocialButton_C::Image_FriendIcon' has a wrong offset!");
static_assert(offsetof(USocialButton_C, Image_LeaderIcon) == 0x001060, "Member 'USocialButton_C::Image_LeaderIcon' has a wrong offset!");
static_assert(offsetof(USocialButton_C, NumFriendsColor) == 0x001068, "Member 'USocialButton_C::NumFriendsColor' has a wrong offset!");
static_assert(offsetof(USocialButton_C, PlayerIdentifier_Bkg) == 0x001070, "Member 'USocialButton_C::PlayerIdentifier_Bkg' has a wrong offset!");
static_assert(offsetof(USocialButton_C, VariableSize) == 0x001078, "Member 'USocialButton_C::VariableSize' has a wrong offset!");

}

