#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialPanelWeGameFriendButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUILegacy_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SocialPanelWeGameFriendButton.SocialPanelWeGameFriendButton_C
// 0x0020 (0x1010 - 0x0FF0)
class USocialPanelWeGameFriendButton_C final : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_FE8[0x8];                                      // 0x0FE8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0FF0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHovered;                                         // 0x0FF8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_LinkPrompt;                                   // 0x1000(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_SocialPanelWeGameFriendButton(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SocialPanelWeGameFriendButton_C">();
	}
	static class USocialPanelWeGameFriendButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialPanelWeGameFriendButton_C>();
	}
};
static_assert(alignof(USocialPanelWeGameFriendButton_C) == 0x000010, "Wrong alignment on USocialPanelWeGameFriendButton_C");
static_assert(sizeof(USocialPanelWeGameFriendButton_C) == 0x001010, "Wrong size on USocialPanelWeGameFriendButton_C");
static_assert(offsetof(USocialPanelWeGameFriendButton_C, UberGraphFrame) == 0x000FF0, "Member 'USocialPanelWeGameFriendButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USocialPanelWeGameFriendButton_C, OnHovered) == 0x000FF8, "Member 'USocialPanelWeGameFriendButton_C::OnHovered' has a wrong offset!");
static_assert(offsetof(USocialPanelWeGameFriendButton_C, Text_LinkPrompt) == 0x001000, "Member 'USocialPanelWeGameFriendButton_C::Text_LinkPrompt' has a wrong offset!");

}

