#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialButton_Sidebar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SocialButton_Sidebar.SocialButton_Sidebar_C
// 0x0080 (0x1090 - 0x1010)
class USocialButton_Sidebar_C final : public UFortSocialButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1010(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Indentifier_Outro;                                 // 0x1018(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Indentifier_Intro;                                 // 0x1020(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover_Grow;                                        // 0x1028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover_Bounce;                                      // 0x1030(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x1038(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortPlayerBanner*                      Banner_MemberBanner;                               // 0x1040(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ButtonBacking;                                     // 0x1048(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_InputAction;                         // 0x1050(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_MeepHolder;                          // 0x1058(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Icon_Meep;                                         // 0x1060(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       Image_FriendIcon;                                  // 0x1068(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LeaderIcon;                                  // 0x1070(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       MenuButtonIcon;                                    // 0x1078(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PlayerIdentifier_Bkg;                              // 0x1080(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               VariableSize;                                      // 0x1088(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_SocialButton_Sidebar(int32 EntryPoint);
	void OnInitialized();
	void OnNumFriendsTextUpdated(const int32 FriendsOnline);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SocialButton_Sidebar_C">();
	}
	static class USocialButton_Sidebar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialButton_Sidebar_C>();
	}
};
static_assert(alignof(USocialButton_Sidebar_C) == 0x000010, "Wrong alignment on USocialButton_Sidebar_C");
static_assert(sizeof(USocialButton_Sidebar_C) == 0x001090, "Wrong size on USocialButton_Sidebar_C");
static_assert(offsetof(USocialButton_Sidebar_C, UberGraphFrame) == 0x001010, "Member 'USocialButton_Sidebar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USocialButton_Sidebar_C, Indentifier_Outro) == 0x001018, "Member 'USocialButton_Sidebar_C::Indentifier_Outro' has a wrong offset!");
static_assert(offsetof(USocialButton_Sidebar_C, Indentifier_Intro) == 0x001020, "Member 'USocialButton_Sidebar_C::Indentifier_Intro' has a wrong offset!");
static_assert(offsetof(USocialButton_Sidebar_C, Hover_Grow) == 0x001028, "Member 'USocialButton_Sidebar_C::Hover_Grow' has a wrong offset!");
static_assert(offsetof(USocialButton_Sidebar_C, Hover_Bounce) == 0x001030, "Member 'USocialButton_Sidebar_C::Hover_Bounce' has a wrong offset!");
static_assert(offsetof(USocialButton_Sidebar_C, Hover) == 0x001038, "Member 'USocialButton_Sidebar_C::Hover' has a wrong offset!");
static_assert(offsetof(USocialButton_Sidebar_C, Banner_MemberBanner) == 0x001040, "Member 'USocialButton_Sidebar_C::Banner_MemberBanner' has a wrong offset!");
static_assert(offsetof(USocialButton_Sidebar_C, ButtonBacking) == 0x001048, "Member 'USocialButton_Sidebar_C::ButtonBacking' has a wrong offset!");
static_assert(offsetof(USocialButton_Sidebar_C, HorizontalBox_InputAction) == 0x001050, "Member 'USocialButton_Sidebar_C::HorizontalBox_InputAction' has a wrong offset!");
static_assert(offsetof(USocialButton_Sidebar_C, HorizontalBox_MeepHolder) == 0x001058, "Member 'USocialButton_Sidebar_C::HorizontalBox_MeepHolder' has a wrong offset!");
static_assert(offsetof(USocialButton_Sidebar_C, Icon_Meep) == 0x001060, "Member 'USocialButton_Sidebar_C::Icon_Meep' has a wrong offset!");
static_assert(offsetof(USocialButton_Sidebar_C, Image_FriendIcon) == 0x001068, "Member 'USocialButton_Sidebar_C::Image_FriendIcon' has a wrong offset!");
static_assert(offsetof(USocialButton_Sidebar_C, Image_LeaderIcon) == 0x001070, "Member 'USocialButton_Sidebar_C::Image_LeaderIcon' has a wrong offset!");
static_assert(offsetof(USocialButton_Sidebar_C, MenuButtonIcon) == 0x001078, "Member 'USocialButton_Sidebar_C::MenuButtonIcon' has a wrong offset!");
static_assert(offsetof(USocialButton_Sidebar_C, PlayerIdentifier_Bkg) == 0x001080, "Member 'USocialButton_Sidebar_C::PlayerIdentifier_Bkg' has a wrong offset!");
static_assert(offsetof(USocialButton_Sidebar_C, VariableSize) == 0x001088, "Member 'USocialButton_Sidebar_C::VariableSize' has a wrong offset!");

}

