#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SoloButton_ViewQuest

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SoloButton_ViewQuest.SoloButton_ViewQuest_C
// 0x0050 (0x1040 - 0x0FF0)
class USoloButton_ViewQuest_C final : public UFortAthenaViewQuestsButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0FF0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ViewQuest_Hover;                                   // 0x0FF8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewQuestPulse_Pressed;                             // 0x1000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewQuestPulse_Hover;                               // 0x1008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewQuestPulse;                                     // 0x1010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ButtonBacking;                                     // 0x1018(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_NewQuestBorder;                              // 0x1020(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              InputActionIconScale;                              // 0x1028(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Pulse;                                             // 0x1030(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ViewQuestText;                                     // 0x1038(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_SoloButton_ViewQuest(int32 EntryPoint);
	void HandleUnseenQuestsChanged(bool bHasUnseenQuests);
	void OnTriggeredInputActionChanged(const struct FDataTableRowHandle& NewTriggeredAction);
	void UpdateInputActionIconScale();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SoloButton_ViewQuest_C">();
	}
	static class USoloButton_ViewQuest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoloButton_ViewQuest_C>();
	}
};
static_assert(alignof(USoloButton_ViewQuest_C) == 0x000010, "Wrong alignment on USoloButton_ViewQuest_C");
static_assert(sizeof(USoloButton_ViewQuest_C) == 0x001040, "Wrong size on USoloButton_ViewQuest_C");
static_assert(offsetof(USoloButton_ViewQuest_C, UberGraphFrame) == 0x000FF0, "Member 'USoloButton_ViewQuest_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USoloButton_ViewQuest_C, ViewQuest_Hover) == 0x000FF8, "Member 'USoloButton_ViewQuest_C::ViewQuest_Hover' has a wrong offset!");
static_assert(offsetof(USoloButton_ViewQuest_C, NewQuestPulse_Pressed) == 0x001000, "Member 'USoloButton_ViewQuest_C::NewQuestPulse_Pressed' has a wrong offset!");
static_assert(offsetof(USoloButton_ViewQuest_C, NewQuestPulse_Hover) == 0x001008, "Member 'USoloButton_ViewQuest_C::NewQuestPulse_Hover' has a wrong offset!");
static_assert(offsetof(USoloButton_ViewQuest_C, NewQuestPulse) == 0x001010, "Member 'USoloButton_ViewQuest_C::NewQuestPulse' has a wrong offset!");
static_assert(offsetof(USoloButton_ViewQuest_C, ButtonBacking) == 0x001018, "Member 'USoloButton_ViewQuest_C::ButtonBacking' has a wrong offset!");
static_assert(offsetof(USoloButton_ViewQuest_C, Image_NewQuestBorder) == 0x001020, "Member 'USoloButton_ViewQuest_C::Image_NewQuestBorder' has a wrong offset!");
static_assert(offsetof(USoloButton_ViewQuest_C, InputActionIconScale) == 0x001028, "Member 'USoloButton_ViewQuest_C::InputActionIconScale' has a wrong offset!");
static_assert(offsetof(USoloButton_ViewQuest_C, Pulse) == 0x001030, "Member 'USoloButton_ViewQuest_C::Pulse' has a wrong offset!");
static_assert(offsetof(USoloButton_ViewQuest_C, ViewQuestText) == 0x001038, "Member 'USoloButton_ViewQuest_C::ViewQuestText' has a wrong offset!");

}

