#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SplashScreenWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SplashScreenWidget.SplashScreenWidget_C
// 0x0060 (0x0560 - 0x0500)
class USplashScreenWidget_C final : public UFortSplashScreenWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0500(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       InputPromptIdle;                                   // 0x0508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonActionWidget*                    GamepadActionWidget;                               // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         GamepadInputHbox;                                  // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       GamepadInputText;                                  // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       I_Fortnite;                                        // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageFakeButtonBackground;                         // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         MobileInputHbox;                                   // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MobileInputText;                                   // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         MouseInputHBox;                                    // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MouseInputText;                                    // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_Input;                                    // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnInputMethodChanged(ECommonInputType InputType);
	void ExecuteUbergraph_SplashScreenWidget(int32 EntryPoint);
	void BP_OnActivated();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SplashScreenWidget_C">();
	}
	static class USplashScreenWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USplashScreenWidget_C>();
	}
};
static_assert(alignof(USplashScreenWidget_C) == 0x000008, "Wrong alignment on USplashScreenWidget_C");
static_assert(sizeof(USplashScreenWidget_C) == 0x000560, "Wrong size on USplashScreenWidget_C");
static_assert(offsetof(USplashScreenWidget_C, UberGraphFrame) == 0x000500, "Member 'USplashScreenWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, InputPromptIdle) == 0x000508, "Member 'USplashScreenWidget_C::InputPromptIdle' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, GamepadActionWidget) == 0x000510, "Member 'USplashScreenWidget_C::GamepadActionWidget' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, GamepadInputHbox) == 0x000518, "Member 'USplashScreenWidget_C::GamepadInputHbox' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, GamepadInputText) == 0x000520, "Member 'USplashScreenWidget_C::GamepadInputText' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, I_Fortnite) == 0x000528, "Member 'USplashScreenWidget_C::I_Fortnite' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, ImageFakeButtonBackground) == 0x000530, "Member 'USplashScreenWidget_C::ImageFakeButtonBackground' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, MobileInputHbox) == 0x000538, "Member 'USplashScreenWidget_C::MobileInputHbox' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, MobileInputText) == 0x000540, "Member 'USplashScreenWidget_C::MobileInputText' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, MouseInputHBox) == 0x000548, "Member 'USplashScreenWidget_C::MouseInputHBox' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, MouseInputText) == 0x000550, "Member 'USplashScreenWidget_C::MouseInputText' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, Switcher_Input) == 0x000558, "Member 'USplashScreenWidget_C::Switcher_Input' has a wrong offset!");

}

