#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SubscriptionModalButton

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUILegacy_classes.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SubscriptionModalButton.SubscriptionModalButton_C
// 0x00A0 (0x1090 - 0x0FF0)
class USubscriptionModalButton_C final : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_FE8[0x8];                                      // 0x0FE8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0FF0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover2;                                            // 0x0FF8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x1000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Material;                                   // 0x1008(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x1010(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_45;                                          // 0x1018(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Right_Image;                               // 0x1020(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Rich_text;                                         // 0x1028(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Height;                                    // 0x1030(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Button_text;                                       // 0x1038(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FSlateColor                            Text_Color;                                        // 0x1050(0x0014)(Edit, BlueprintVisible)
	uint8                                         Pad_1064[0x4];                                     // 0x1064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Material_Brush;                                    // 0x1068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Right_Image;                                       // 0x1070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  Justifiction;                                      // 0x1078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Auto_wrap_text;                                    // 0x1079(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          SimpleHover;                                       // 0x107A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FontSizeOverride;                                  // 0x107B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FontSize;                                          // 0x107C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShearText;                                         // 0x1080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetBorderShowEffectWhenDisable(bool ShowEffectWhenDisabled);
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_SubscriptionModalButton(int32 EntryPoint);
	void BP_OnUnhovered();
	void BP_OnHovered();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SubscriptionModalButton_C">();
	}
	static class USubscriptionModalButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USubscriptionModalButton_C>();
	}
};
static_assert(alignof(USubscriptionModalButton_C) == 0x000010, "Wrong alignment on USubscriptionModalButton_C");
static_assert(sizeof(USubscriptionModalButton_C) == 0x001090, "Wrong size on USubscriptionModalButton_C");
static_assert(offsetof(USubscriptionModalButton_C, UberGraphFrame) == 0x000FF0, "Member 'USubscriptionModalButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USubscriptionModalButton_C, Hover2) == 0x000FF8, "Member 'USubscriptionModalButton_C::Hover2' has a wrong offset!");
static_assert(offsetof(USubscriptionModalButton_C, Hover) == 0x001000, "Member 'USubscriptionModalButton_C::Hover' has a wrong offset!");
static_assert(offsetof(USubscriptionModalButton_C, Border_Material) == 0x001008, "Member 'USubscriptionModalButton_C::Border_Material' has a wrong offset!");
static_assert(offsetof(USubscriptionModalButton_C, Image) == 0x001010, "Member 'USubscriptionModalButton_C::Image' has a wrong offset!");
static_assert(offsetof(USubscriptionModalButton_C, Image_45) == 0x001018, "Member 'USubscriptionModalButton_C::Image_45' has a wrong offset!");
static_assert(offsetof(USubscriptionModalButton_C, Overlay_Right_Image) == 0x001020, "Member 'USubscriptionModalButton_C::Overlay_Right_Image' has a wrong offset!");
static_assert(offsetof(USubscriptionModalButton_C, Rich_text) == 0x001028, "Member 'USubscriptionModalButton_C::Rich_text' has a wrong offset!");
static_assert(offsetof(USubscriptionModalButton_C, SizeBox_Height) == 0x001030, "Member 'USubscriptionModalButton_C::SizeBox_Height' has a wrong offset!");
static_assert(offsetof(USubscriptionModalButton_C, Button_text) == 0x001038, "Member 'USubscriptionModalButton_C::Button_text' has a wrong offset!");
static_assert(offsetof(USubscriptionModalButton_C, Text_Color) == 0x001050, "Member 'USubscriptionModalButton_C::Text_Color' has a wrong offset!");
static_assert(offsetof(USubscriptionModalButton_C, Material_Brush) == 0x001068, "Member 'USubscriptionModalButton_C::Material_Brush' has a wrong offset!");
static_assert(offsetof(USubscriptionModalButton_C, Right_Image) == 0x001070, "Member 'USubscriptionModalButton_C::Right_Image' has a wrong offset!");
static_assert(offsetof(USubscriptionModalButton_C, Justifiction) == 0x001078, "Member 'USubscriptionModalButton_C::Justifiction' has a wrong offset!");
static_assert(offsetof(USubscriptionModalButton_C, Auto_wrap_text) == 0x001079, "Member 'USubscriptionModalButton_C::Auto_wrap_text' has a wrong offset!");
static_assert(offsetof(USubscriptionModalButton_C, SimpleHover) == 0x00107A, "Member 'USubscriptionModalButton_C::SimpleHover' has a wrong offset!");
static_assert(offsetof(USubscriptionModalButton_C, FontSizeOverride) == 0x00107B, "Member 'USubscriptionModalButton_C::FontSizeOverride' has a wrong offset!");
static_assert(offsetof(USubscriptionModalButton_C, FontSize) == 0x00107C, "Member 'USubscriptionModalButton_C::FontSize' has a wrong offset!");
static_assert(offsetof(USubscriptionModalButton_C, ShearText) == 0x001080, "Member 'USubscriptionModalButton_C::ShearText' has a wrong offset!");

}

