#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SuggestedFriendListEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SuggestedFriendListEntry.SuggestedFriendListEntry_C
// 0x0060 (0x10D0 - 0x1070)
class USuggestedFriendListEntry_C final : public UFortConnectionsUserListEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1070(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x1078(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x1080(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Arrow;                                             // 0x1088(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_Background;                                 // 0x1090(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_Highlight;                                  // 0x1098(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      EmptyButtonToEatOneMouseUpEvent;                   // 0x10A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUserActionMenuInputButton_C*           UserActionMenuInputButton;                         // 0x10A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           EncourageEpicFriend_IdleColor;                     // 0x10B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EncourageEpicFriend_HoveredColor;                  // 0x10C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_SuggestedFriendListEntry(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SuggestedFriendListEntry_C">();
	}
	static class USuggestedFriendListEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USuggestedFriendListEntry_C>();
	}
};
static_assert(alignof(USuggestedFriendListEntry_C) == 0x000010, "Wrong alignment on USuggestedFriendListEntry_C");
static_assert(sizeof(USuggestedFriendListEntry_C) == 0x0010D0, "Wrong size on USuggestedFriendListEntry_C");
static_assert(offsetof(USuggestedFriendListEntry_C, UberGraphFrame) == 0x001070, "Member 'USuggestedFriendListEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USuggestedFriendListEntry_C, Selected) == 0x001078, "Member 'USuggestedFriendListEntry_C::Selected' has a wrong offset!");
static_assert(offsetof(USuggestedFriendListEntry_C, Hovered) == 0x001080, "Member 'USuggestedFriendListEntry_C::Hovered' has a wrong offset!");
static_assert(offsetof(USuggestedFriendListEntry_C, Arrow) == 0x001088, "Member 'USuggestedFriendListEntry_C::Arrow' has a wrong offset!");
static_assert(offsetof(USuggestedFriendListEntry_C, Border_Background) == 0x001090, "Member 'USuggestedFriendListEntry_C::Border_Background' has a wrong offset!");
static_assert(offsetof(USuggestedFriendListEntry_C, Border_Highlight) == 0x001098, "Member 'USuggestedFriendListEntry_C::Border_Highlight' has a wrong offset!");
static_assert(offsetof(USuggestedFriendListEntry_C, EmptyButtonToEatOneMouseUpEvent) == 0x0010A0, "Member 'USuggestedFriendListEntry_C::EmptyButtonToEatOneMouseUpEvent' has a wrong offset!");
static_assert(offsetof(USuggestedFriendListEntry_C, UserActionMenuInputButton) == 0x0010A8, "Member 'USuggestedFriendListEntry_C::UserActionMenuInputButton' has a wrong offset!");
static_assert(offsetof(USuggestedFriendListEntry_C, EncourageEpicFriend_IdleColor) == 0x0010B0, "Member 'USuggestedFriendListEntry_C::EncourageEpicFriend_IdleColor' has a wrong offset!");
static_assert(offsetof(USuggestedFriendListEntry_C, EncourageEpicFriend_HoveredColor) == 0x0010C0, "Member 'USuggestedFriendListEntry_C::EncourageEpicFriend_HoveredColor' has a wrong offset!");

}

