#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TopBarTabButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TopBarTabButton.TopBarTabButton_C
// 0x00B0 (0x10F0 - 0x1040)
class UTopBarTabButton_C final : public UFortTopBarTabTextIconButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1040(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hovered;                                           // 0x1048(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x1050(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x1058(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_1;                                         // 0x1060(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_2;                                         // 0x1068(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_0;                                     // 0x1070(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_ButtonBorder;                                  // 0x1078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PreviewMobileStyle;                                // 0x1080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1081[0x3];                                     // 0x1081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFloatSpringState                      SpringState_ShapeChange;                           // 0x1084(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FFloatSpringState                      SpringState_Scale;                                 // 0x1090(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                         Spring_Scale_Target;                               // 0x109C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MassMultiply;                                      // 0x10A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DampenMultiply;                                    // 0x10A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StiffnessMultiply;                                 // 0x10A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          VisualSelectionState;                              // 0x10AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10AD[0x3];                                     // 0x10AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RandomFloat_Top;                                   // 0x10B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RandomFloat_Left;                                  // 0x10B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RandomFloat_Right;                                 // 0x10B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RandomFloat_Bottom;                                // 0x10BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ShapeChange_New;                                   // 0x10C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ShapeChange_Target;                                // 0x10C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UpdateSpring;                                      // 0x10C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C9[0x7];                                     // 0x10C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ButtonText;                                        // 0x10D0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_TopBarTabButton(int32 EntryPoint);
	void HandleSelectionChangedVisuals(bool bIsSelected);
	void InitializeButtonBorderMID();
	void OnCurrentTextStyleChanged();
	void OnInitialized();
	void OnSelectedChangedEvent(class UCommonButtonLegacy* Button, bool Selected_0);
	void OverrideIcon(bool Show, const struct FSlateBrush& inSlateBrush);
	void PreConstruct(bool IsDesignTime);
	void SeedRandomValues();
	void SetText(const class FText& ButtonText_0);
	void UpdateMIDWithRandomValues();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TopBarTabButton_C">();
	}
	static class UTopBarTabButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTopBarTabButton_C>();
	}
};
static_assert(alignof(UTopBarTabButton_C) == 0x000010, "Wrong alignment on UTopBarTabButton_C");
static_assert(sizeof(UTopBarTabButton_C) == 0x0010F0, "Wrong size on UTopBarTabButton_C");
static_assert(offsetof(UTopBarTabButton_C, UberGraphFrame) == 0x001040, "Member 'UTopBarTabButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_C, Hovered) == 0x001048, "Member 'UTopBarTabButton_C::Hovered' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_C, Selected) == 0x001050, "Member 'UTopBarTabButton_C::Selected' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_C, SizeBox_0) == 0x001058, "Member 'UTopBarTabButton_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_C, SizeBox_1) == 0x001060, "Member 'UTopBarTabButton_C::SizeBox_1' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_C, SizeBox_2) == 0x001068, "Member 'UTopBarTabButton_C::SizeBox_2' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_C, VerticalBox_0) == 0x001070, "Member 'UTopBarTabButton_C::VerticalBox_0' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_C, MID_ButtonBorder) == 0x001078, "Member 'UTopBarTabButton_C::MID_ButtonBorder' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_C, PreviewMobileStyle) == 0x001080, "Member 'UTopBarTabButton_C::PreviewMobileStyle' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_C, SpringState_ShapeChange) == 0x001084, "Member 'UTopBarTabButton_C::SpringState_ShapeChange' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_C, SpringState_Scale) == 0x001090, "Member 'UTopBarTabButton_C::SpringState_Scale' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_C, Spring_Scale_Target) == 0x00109C, "Member 'UTopBarTabButton_C::Spring_Scale_Target' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_C, MassMultiply) == 0x0010A0, "Member 'UTopBarTabButton_C::MassMultiply' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_C, DampenMultiply) == 0x0010A4, "Member 'UTopBarTabButton_C::DampenMultiply' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_C, StiffnessMultiply) == 0x0010A8, "Member 'UTopBarTabButton_C::StiffnessMultiply' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_C, VisualSelectionState) == 0x0010AC, "Member 'UTopBarTabButton_C::VisualSelectionState' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_C, RandomFloat_Top) == 0x0010B0, "Member 'UTopBarTabButton_C::RandomFloat_Top' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_C, RandomFloat_Left) == 0x0010B4, "Member 'UTopBarTabButton_C::RandomFloat_Left' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_C, RandomFloat_Right) == 0x0010B8, "Member 'UTopBarTabButton_C::RandomFloat_Right' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_C, RandomFloat_Bottom) == 0x0010BC, "Member 'UTopBarTabButton_C::RandomFloat_Bottom' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_C, ShapeChange_New) == 0x0010C0, "Member 'UTopBarTabButton_C::ShapeChange_New' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_C, ShapeChange_Target) == 0x0010C4, "Member 'UTopBarTabButton_C::ShapeChange_Target' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_C, UpdateSpring) == 0x0010C8, "Member 'UTopBarTabButton_C::UpdateSpring' has a wrong offset!");
static_assert(offsetof(UTopBarTabButton_C, ButtonText) == 0x0010D0, "Member 'UTopBarTabButton_C::ButtonText' has a wrong offset!");

}

