#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UserSearchResultListEntry_XS

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UserSearchResultListEntry_XS.UserSearchResultListEntry_XS_C
// 0x0060 (0x10F0 - 0x1090)
class UUserSearchResultListEntry_XS_C final : public UFortUserSearchResultListEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1090(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x1098(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x10A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Arrow;                                             // 0x10A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      EmptyButtonToEatOneMouseUpEvent;                   // 0x10B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Lock;                                        // 0x10B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_DisplayName;                                  // 0x10C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUserActionMenuInputButton_C*           UserActionMenuInputButton;                         // 0x10C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           EncourageEpicFriend_IdleColor;                     // 0x10D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EncourageEpicFriend_HoveredColor;                  // 0x10E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_UserSearchResultListEntry_XS(int32 EntryPoint);
	void SetNamePlatformAndMutuals(const class FText& DisplayName, const class FText& Platform, int32 MutualCount);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UserSearchResultListEntry_XS_C">();
	}
	static class UUserSearchResultListEntry_XS_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUserSearchResultListEntry_XS_C>();
	}
};
static_assert(alignof(UUserSearchResultListEntry_XS_C) == 0x000010, "Wrong alignment on UUserSearchResultListEntry_XS_C");
static_assert(sizeof(UUserSearchResultListEntry_XS_C) == 0x0010F0, "Wrong size on UUserSearchResultListEntry_XS_C");
static_assert(offsetof(UUserSearchResultListEntry_XS_C, UberGraphFrame) == 0x001090, "Member 'UUserSearchResultListEntry_XS_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUserSearchResultListEntry_XS_C, Selected) == 0x001098, "Member 'UUserSearchResultListEntry_XS_C::Selected' has a wrong offset!");
static_assert(offsetof(UUserSearchResultListEntry_XS_C, Hovered) == 0x0010A0, "Member 'UUserSearchResultListEntry_XS_C::Hovered' has a wrong offset!");
static_assert(offsetof(UUserSearchResultListEntry_XS_C, Arrow) == 0x0010A8, "Member 'UUserSearchResultListEntry_XS_C::Arrow' has a wrong offset!");
static_assert(offsetof(UUserSearchResultListEntry_XS_C, EmptyButtonToEatOneMouseUpEvent) == 0x0010B0, "Member 'UUserSearchResultListEntry_XS_C::EmptyButtonToEatOneMouseUpEvent' has a wrong offset!");
static_assert(offsetof(UUserSearchResultListEntry_XS_C, Image_Lock) == 0x0010B8, "Member 'UUserSearchResultListEntry_XS_C::Image_Lock' has a wrong offset!");
static_assert(offsetof(UUserSearchResultListEntry_XS_C, Text_DisplayName) == 0x0010C0, "Member 'UUserSearchResultListEntry_XS_C::Text_DisplayName' has a wrong offset!");
static_assert(offsetof(UUserSearchResultListEntry_XS_C, UserActionMenuInputButton) == 0x0010C8, "Member 'UUserSearchResultListEntry_XS_C::UserActionMenuInputButton' has a wrong offset!");
static_assert(offsetof(UUserSearchResultListEntry_XS_C, EncourageEpicFriend_IdleColor) == 0x0010D0, "Member 'UUserSearchResultListEntry_XS_C::EncourageEpicFriend_IdleColor' has a wrong offset!");
static_assert(offsetof(UUserSearchResultListEntry_XS_C, EncourageEpicFriend_HoveredColor) == 0x0010E0, "Member 'UUserSearchResultListEntry_XS_C::EncourageEpicFriend_HoveredColor' has a wrong offset!");

}

