#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VKEditUI

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// Class VKEditUI.VKConnectionIndicator
// 0x0008 (0x02E8 - 0x02E0)
class UVKConnectionIndicator final : public UFortHUDElementWidget
{
public:
	bool                                          bHasActiveConnection;                              // 0x02E0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnConnectionChanged();
	void OnConnectionToEditChanged(bool bConnected);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VKConnectionIndicator">();
	}
	static class UVKConnectionIndicator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVKConnectionIndicator>();
	}
};
static_assert(alignof(UVKConnectionIndicator) == 0x000008, "Wrong alignment on UVKConnectionIndicator");
static_assert(sizeof(UVKConnectionIndicator) == 0x0002E8, "Wrong size on UVKConnectionIndicator");
static_assert(offsetof(UVKConnectionIndicator, bHasActiveConnection) == 0x0002E0, "Member 'UVKConnectionIndicator::bHasActiveConnection' has a wrong offset!");

// Class VKEditUI.VKDebugMessagesBase
// 0x0000 (0x02E0 - 0x02E0)
class UVKDebugMessagesBase final : public UFortHUDElementWidget
{
public:
	void BP_OnGameStateInitialized(class AFortGameState* GameState);
	void HandleGameStateInitialized(class AFortGameState* GameState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VKDebugMessagesBase">();
	}
	static class UVKDebugMessagesBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVKDebugMessagesBase>();
	}
};
static_assert(alignof(UVKDebugMessagesBase) == 0x000008, "Wrong alignment on UVKDebugMessagesBase");
static_assert(sizeof(UVKDebugMessagesBase) == 0x0002E0, "Wrong size on UVKDebugMessagesBase");

}

