#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: windowchromebuttons

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass windowchromebuttons.windowchromebuttons_C
// 0x0020 (0x02C0 - 0x02A0)
class Uwindowchromebuttons_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOut;                                           // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWindowTitleBarArea*                    WindowTitleBarArea_107;                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_windowchromebuttons(int32 EntryPoint);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"windowchromebuttons_C">();
	}
	static class Uwindowchromebuttons_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uwindowchromebuttons_C>();
	}
};
static_assert(alignof(Uwindowchromebuttons_C) == 0x000008, "Wrong alignment on Uwindowchromebuttons_C");
static_assert(sizeof(Uwindowchromebuttons_C) == 0x0002C0, "Wrong size on Uwindowchromebuttons_C");
static_assert(offsetof(Uwindowchromebuttons_C, UberGraphFrame) == 0x0002A0, "Member 'Uwindowchromebuttons_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(Uwindowchromebuttons_C, FadeOut) == 0x0002A8, "Member 'Uwindowchromebuttons_C::FadeOut' has a wrong offset!");
static_assert(offsetof(Uwindowchromebuttons_C, FadeIn) == 0x0002B0, "Member 'Uwindowchromebuttons_C::FadeIn' has a wrong offset!");
static_assert(offsetof(Uwindowchromebuttons_C, WindowTitleBarArea_107) == 0x0002B8, "Member 'Uwindowchromebuttons_C::WindowTitleBarArea_107' has a wrong offset!");

}

